/* REXX FRONT END TO WALKER                                         */
trace ?R
userid = USERID()
address ispexec
  "DISPLAY PANEL(WALKSEL1)"
  exit
end
