/*REXX*****************************************************************/00020000
/***                                                                  */00030000
/**********************************************************************/00040000
trace n                                                                 00050007
address ispexec;                                                        00060000
'control errors cancel'                                                 00070007
address isredit;  "macro"                                               00080000
'line_after 0 = noteline "                                         "'   00231012
'line_after 0 = noteline "to sort by walker name again               "' 00290012
'line_after 0 = noteline "3) Before saving enter SORT  "'               00290112
'line_after 0 = noteline "2) Page to the bottom to add the next entry"' 00290312
'line_after 0 = noteline "1) On the command line enter SORT 30 "'       00290412
'line_after 0 = noteline "To add a new entry:                  "'       00290512
'line_after 0 = noteline "                                         "'   00290612
'LINE_AFTER 0 = noteline "WALKER ELEMENTS NEED UNIQUE ENDEVOR NAMES "'  00290812
'line_after 0 = noteline "                                          "'  00300012
'line_after 0 = noteline "=======================================   "'  00310012
'line_after 0 = noteline "This table maps walker to endevor names   "'  00320012
