/*REXX*****************************************************************/00020000
/***                                                                  */00030000
/**********************************************************************/00040000
TRACE N                                                                 00050000
address ispexec;                                                        00060000
'CONTROL ERRORS CANCEL'                                                 00070000
address isredit;  "macro"                                               00080000
'HILITE JCL'                                                            00090011
'recovery on'                                                           00090012
