/*REXX*****************************************************************/00020000
/***                                                                  */00030000
/**********************************************************************/00040000
TRACE N                                                                 00050000
address ispexec;                                                        00060000
'CONTROL ERRORS CANCEL'                                                 00070000
address isredit;  "macro"                                               00080000
'LINE_AFTER 0 = MSGLINE "                                    "  '       00091000
'LINE_AFTER 0 = MSGLINE "                                    " '        00100000
'LINE_AFTER 0 = MSGLINE "FOR THIS TYPE                       " '        00110000
'LINE_AFTER 0 = MSGLINE "BUILD A LIST OF WALKER ELEMENTS TO BE ADDED" ' 00200000
