)CM  PACKAGE SHIPMENT BATCH JCL -  REMOTE SITE JCL      ISPSLIB(C1BMXDEL)
)CM
)CM  JCL TO DELETE PRODUCTION MEMBERS AND REMOTE STAGING DATASETS AT THES.
)CM  REMOTE SITE.  THIS MEMBER IS READ/WRITTEN AT THE HOST SITE BY THE
)CM  SHIPMENT STAGING UTILITY AND IS EXECUTED AT THE REMOTE SITE.
)CM
)CM  THIS IS  N-O-T  AN ISPF SKELETON.  ALL SKELETON CONTROL STATEMENTS
)CM  (CLOSE PARENTHESIS IN COLUMN 1) WILL BE IGNORED.
)CM
)CM  * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
)CM
)CM  TAILORING INSTRUCTIONS:
)CM
)CM  NO TAILORING IS NECESSARY FOR THIS JCL.
)CM
)CM  * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
)CM
//* *----------------------------------------------* C1BMXRJC(C1BMXDEL)
//* *  REMOTE SITE JOBSTEP TO DELETE FILES WHICH
//* *  WERE CREATED BY THE EXECUTION OF THE PACKAGE
//* *-----------------------------------------------------------------*
//DELETE   EXEC PGM=IDCAMS,COND=(8,LT)
//SYSPRINT DD   SYSOUT=*
//SYSIN    DD   *
