)CM  PACKAGE SHIPMENT BATCH JCL - CONFIRMATION - ISPSLIB(C1BMXRCN)
)CM
)CM  THIS SKELETON IS USED TO CONFIRM THE EXECUTION OF THE IEBCOPY JOB AT
)CM  THE REMOTE SITE (COPY STAGING DATASETS TO PRODUCTION SATASETS).  IT
)CM  IS INCLUDED IN SKELETON ISPSLIB(C1BMXJOB).
)CM
)CM  THIS SKELETON IS READ BY THE SHIPMENT STAGING UTILITY AND IS USED
)CM  TO BUILD PART OF THE REMOTE JOB WHICH COPIES STAGING DATASETS INTO
)CM  THEIR RESPECTIVE PRODUCTION DATASETS.  THERE ARE TWO IEBGENER STEPS
)CM  WHICH WRITE JCL TO THE INTERNAL READER.  BASED ON CONDITION CODES,
)CM  ONLY ONE OF THE GENER STEPS WILL EXECUTE.  THE JOB STREAM WHICH IS
)CM  GENERED INTO THE INTERNAL READER WILL EXECUTE AT THE HOST AND CAUSE
)CM  THE SHIPMENT RECORD TO BE UPDATED.
)CM
)CM  * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
)CM
)CM  NO TAILORING IS NECESSARY FOR THIS SKELETON.  HOWEVER, IT CAN BE
)CM  MODIFIED TO GIVE MORE SPECIFIC INFORMATION ABOUT THE RESULTS OF
)CM  THE COPYING PROCESS (CF. ADMINISTRATORS GUIDE - "SHIPMENT
)CM  TRACKING AND CONFIRMATION").
)CM
)CM  * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
)CM
)CM
//* *--------------------------------------------* ISPSLIB(C1BMXRCN) *
//*
//* *================================================================*
//* *  INSTREAM DATASET CONTAINING REMOTE CONFIRMATION JCL
//* *================================================================*
//*
//CONFCOPY EXEC PGM=IEBGENER           EXECUTED AT THE REMOTE SITE
//SYSUT1   DD DATA,DLM=$$              JOB SHIPPED BACK TO HOST
)IM C1BMXHJC
//CONFEXEC EXEC PGM=NDVRC1,
//   PARM='&VNBCPARM,CONF,RCPY,EX,****,$DEST_ID'
)IM C1BMXLIB OPT
//* *--------------------------------------------* C1BMXRCN (CONT.)  *
$$
//SYSUT2   DD SYSOUT=(A,INTRDR)
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
//*
//CONFABND EXEC PGM=IEBGENER,COND=ONLY EXECUTED AT THE REMOTE SITE
//SYSUT1   DD DATA,DLM=$$              JOB SHIPPED BACK TO HOST
)IM C1BMXHJC
//ABNDEXEC EXEC PGM=NDVRC1,
//  PARM='&VNBCPARM,CONF,RCPY,AB,****,$DEST_ID'
//*
)IM C1BMXLIB OPT
//* *--------------------------------------------* C1BMXRCN (CONT.)  *
$$
//SYSUT2   DD SYSOUT=(A,INTRDR)
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
