)CM *-----------------------------------------------------------------*
)CM *                                                                 *
)CM *  COPYRIGHT (C) 1986-2013 CA. ALL RIGHTS RESERVED.               *
)CM *                                                                 *
)CM * NAME: ENSP1000                                                  *
)CM *                                                                 *
)CM * PURPOSE: THIS IS THE ISPF FILE TAILORING SKELETON THAT IS USED  *
)CM *  TO GENERATE THE JCL TO EXECUTE THE BATCH PACKAGE FACILITY      *
)CM *  PROGRAM                                                        *
)CM *                                                                 *
)CM * ISPSLIB(SCMM@SYM) - IMBEDDED MBR TO SET STANDARD VARIABLES,     *
)CM *                     TAILORED BY THE HOST SITE.                  *
)CM * ISPSLIB(SCMM@LIB) - IMBEDDED STEPLIB/CONLIB CONCATENATIONS,     *
)CM *                     TAILORED BY THE HOST SITE.                  *
)CM *-----------------------------------------------------------------*
)SEL &C1BJC1 NE &Z
&C1BJC1
)ENDSEL
)SEL &C1BJC2 NE &Z
&C1BJC2
)ENDSEL
)SEL &C1BJC3 NE &Z
&C1BJC3
)ENDSEL
)SEL &C1BJC4 NE &Z
&C1BJC4
)ENDSEL
)IM SCMM@SYM
//ENBP1000 EXEC PGM=NDVRC1,
//             PARM=ENBP1000,
//             DYNAMNBR=1500,
//             REGION=4096K
)IM SCMM@LIB
//*-------------------------------------------------------------------*
//* MESSAGE DATASETS                                                  *
//* NOTE: TO CREATE THE SUMMARY REPORT TO A SEPARATE FILE, UNCOMMENT  *
//* THE C1MSGS2 DD STATEMENT                                          *
//*-------------------------------------------------------------------*
//C1MSGS1  DD SYSOUT=*
//*C1MSGS2  DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYMDUMP  DD DUMMY
//*-------------------------------------------------------------------*
//* THE JCLOUT DD STATEMENT IS USED BY THE SUBMIT ACTION              *
//*-------------------------------------------------------------------*
//JCLOUT   DD SYSOUT=(A,INTRDR),
//            DCB=(LRECL=80,RECFM=F,BLKSIZE=80)
//*-------------------------------------------------------------------*
//* BATCH PACKAGE FACILITY REQUEST DATA SET                           *
//*-------------------------------------------------------------------*
//ENPSCLIN DD DISP=SHR,
// DSN=&PDVSCLDS
)SEL &PDVINCJC = Y
//*-------------------------------------------------------------------*
//* ADDITIONAL INCLUDED JCL                                           *
//*-------------------------------------------------------------------*
)SEL &PDVDD01 NE &Z
&PDVDD01
)ENDSEL
)SEL &PDVDD02 NE &Z
&PDVDD02
)ENDSEL
)SEL &PDVDD03 NE &Z
&PDVDD03
)ENDSEL
)SEL &PDVDD04 NE &Z
&PDVDD04
)ENDSEL
)SEL &PDVDD05 NE &Z
&PDVDD05
)ENDSEL
)SEL &PDVDD06 NE &Z
&PDVDD06
)ENDSEL
)SEL &PDVDD07 NE &Z
&PDVDD07
)ENDSEL
)SEL &PDVDD08 NE &Z
&PDVDD08
)ENDSEL
)SEL &PDVDD09 NE &Z
&PDVDD09
)ENDSEL
)SEL &PDVDD10 NE &Z
&PDVDD10
)ENDSEL
)SEL &PDVDD11 NE &Z
&PDVDD11
)ENDSEL
)SEL &PDVDD12 NE &Z
&PDVDD12
)ENDSEL
)SEL &PDVDD13 NE &Z
&PDVDD13
)ENDSEL
)SEL &PDVDD14 NE &Z
&PDVDD14
)ENDSEL
)SEL &PDVDD15 NE &Z
&PDVDD15
)ENDSEL
)SEL &PDVDD16 NE &Z
&PDVDD16
)ENDSEL
)SEL &PDVDD17 NE &Z
&PDVDD17
)ENDSEL
)SEL &PDVDD18 NE &Z
&PDVDD18
)ENDSEL
)SEL &PDVDD19 NE &Z
&PDVDD19
)ENDSEL
)SEL &PDVDD20 NE &Z
&PDVDD20
)ENDSEL
)ENDSEL
//* ENSP1000 WAS GENERATED BY &ZUSER ON &ZDATE AT &ZTIME
