//*STEPLIB  DD DISP=SHR,DSN=TSOXX4.ENDEVOR.V16.CSIQAUTU
//*         DD DISP=SHR,DSN=TSOXX4.ENDEVOR.V16.CSIQAUTH
//*CONLIB   DD DISP=SHR,DSN=TSOXX4.ENDEVOR.V16.CSIQLOAD
