)CM *----------------------------------------------------------------*
)CM *                                                                *
)CM *  COPYRIGHT (C) 1986-2012 CA. ALL RIGHTS RESERVED.              *
)CM *                                                                *
)CM * NAME: C1SB3000                                                 *
)CM * UPDATED BY : PN01795, PN01890                                  *
)CM *                                                                *
)CM * PURPOSE: THIS SKELETON IS USED BY THE BATCH SCL DIALOG         *
)CM *          TO GENERATE JCL FOR BATCH EXECUTION.                  *
)CM *                                                                *
)CM * ISPSLIB(SCMM@SYM) - IMBEDDED MBR TO SET STANDARD VARIABLES,    *
)CM *                     TAILORED BY THE HOST SITE.                 *
)CM * ISPSLIB(SCMM@LIB) - IMBEDDED STEPLIB/CONLIB CONCATENATIONS,    *
)CM *                     TAILORED BY THE HOST SITE.                 *
)CM *----------------------------------------------------------------*
)SEL &C1BJC1 NE &Z
&C1BJC1
)ENDSEL
)SEL &C1BJC2 NE &Z
&C1BJC2
)ENDSEL
)SEL &C1BJC3 NE &Z
&C1BJC3
)ENDSEL
)SEL &C1BJC4 NE &Z
&C1BJC4
)ENDSEL
)IM SCMM@SYM
//*********************************************************************
//*  BATCH JCL STATEMENTS                                             *
//*********************************************************************
//NDVRBAT  EXEC PGM=NDVRC1,DYNAMNBR=1500,
)SEL &C1BLDPKG NE P
//             PARM='C1BM3000'
)ENDSEL
)SEL &C1BLDPKG  = P
//             PARM='C1BM3000,,&VPHPKGID'
)ENDSEL
//*********************************************************************
//*  SORT WORK FILES                                                  *
//*********************************************************************
//C1SORTIO DD SPACE=(CYL,(50,50)),
//             RECFM=VB,LRECL=32760
//*********************************************************************
//*  INFOMAN API DATASET(S)                                           *
//*********************************************************************
//APIPRINT DD SYSOUT=Z
//HLAPILOG DD SYSOUT=*
//*********************************************************************
//*  OUTPUT DATA SETS                                                 *
//*********************************************************************
//C1MSGS1  DD SYSOUT=*
//C1MSGS2  DD SYSOUT=*
//C1PRINT  DD SYSOUT=*,RECFM=FBA,LRECL=133
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=C
//SYSOUT   DD SYSOUT=*
//SYMDUMP  DD DUMMY
)SEL &C1BLDPKG NE P
//*********************************************************************
//*  REQUEST DATA SET                                                 *
//*********************************************************************
//BSTIPT01 DD DISP=SHR,
// DSN=&VNBDFDSN
)ENDSEL
)SEL &C1BLDPKG = P
//BSTIPT01 DD SPACE=(TRK,(15,5)),
//             DISP=(NEW,DELETE),
//             RECFM=FB,LRECL=80
)ENDSEL
)SEL &VCAPYN = Y
//*********************************************************************
//*  CONCURRENT ACTION PROCESSING REQUESTED                           *
//*********************************************************************
//EN$CAP&VCAPRN DD SYSOUT=*
)ENDSEL
)SEL &VNBINCF = Y
//*********************************************************************
//*  INCLUDED JCL                                                     *
//*********************************************************************
)SEL &VNBDD01 NE &Z
&VNBDD01
)ENDSEL
)SEL &VNBDD02 NE &Z
&VNBDD02
)ENDSEL
)SEL &VNBDD03 NE &Z
&VNBDD03
)ENDSEL
)SEL &VNBDD04 NE &Z
&VNBDD04
)ENDSEL
)SEL &VNBDD05 NE &Z
&VNBDD05
)ENDSEL
)SEL &VNBDD06 NE &Z
&VNBDD06
)ENDSEL
)SEL &VNBDD07 NE &Z
&VNBDD07
)ENDSEL
)SEL &VNBDD08 NE &Z
&VNBDD08
)ENDSEL
)SEL &VNBDD09 NE &Z
&VNBDD09
)ENDSEL
)SEL &VNBDD10 NE &Z
&VNBDD10
)ENDSEL
)SEL &VNBDD11 NE &Z
&VNBDD11
)ENDSEL
)SEL &VNBDD12 NE &Z
&VNBDD12
)ENDSEL
)SEL &VNBDD13 NE &Z
&VNBDD13
)ENDSEL
)SEL &VNBDD14 NE &Z
&VNBDD14
)ENDSEL
)SEL &VNBDD15 NE &Z
&VNBDD15
)ENDSEL
)SEL &VNBDD16 NE &Z
&VNBDD16
)ENDSEL
)SEL &VNBDD17 NE &Z
&VNBDD17
)ENDSEL
)SEL &VNBDD18 NE &Z
&VNBDD18
)ENDSEL
)SEL &VNBDD19 NE &Z
&VNBDD19
)ENDSEL
)SEL &VNBDD20 NE &Z
&VNBDD20
)ENDSEL
)ENDSEL
//* C1SB3000 GENERATED BY &ZUSER ON &ZDATE AT &ZTIME
//*
)IM C1MSGS3
