//&HLQ.NDCL JOB 0,'COMPONENT LIST CMPR',CLASS=3,
//             NOTIFY=&&SYSUID
//*
//* SKELETON: CLCOMP (SYSTEM EV, TYPE SKELS)
//*
//* THIS JOB COMPARES TWO COMPONENT LISTS, HIGHLIGHTING DIFFERENCES
//*
//JSTEP010 EXEC PGM=NDVRC1,DYNAMNBR=1500,
//             PARM='C1BM3000'
//APIPRINT DD SYSOUT=Z
//C1MSGS1  DD SYSOUT=*
//C1MSGS2  DD SYSOUT=*
//C1PRINTO DD DISP=(NEW,PASS),DSN=&&&&C1PRINT1,
//             SPACE=(TRK,(1,1)),RECFM=FB,LRECL=133
//C1PRINTN DD DISP=(NEW,PASS),DSN=&&&&C1PRINT2,
//             SPACE=(TRK,(1,1)),RECFM=FB,LRECL=133
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=C
//SYSOUT   DD SYSOUT=*
//SYMDUMP  DD DUMMY
//BSTIPT01 DD *
SET STOPRC 16 .
PRINT ELEMENT &NEWELE
)SEL    &NEWVVLL NE &Z
  VER &NEWVER LEV &NEWLEV
)ENDSEL
  FROM ENVIRONMENT &NEWENV SYSTEM &NEWSYS SUBSYSTEM &NEWSBS
    TYPE &NEWTYP STAGE &NEWSTG
    TO FILE C1PRINTN
  OPTIONS NOSEARCH NOCC
  COMPONENT BROWSE
 .
PRINT ELEMENT &OLDELE
)SEL    &OLDVVLL NE &Z
  VER &OLDVER LEV &OLDLEV
)ENDSEL
  FROM ENVIRONMENT &OLDENV SYSTEM &OLDSYS SUBSYSTEM &OLDSBS
    TYPE &OLDTYP STAGE &OLDSTG
    TO FILE C1PRINTO
  OPTIONS NOSEARCH NOCC
  COMPONENT BROWSE
 .
//*
//JSTEPMSG EXEC PGM=IKJEFT1B
//SYSEXEC  DD DISP=SHR,DSN=PGEV.BASE.REXX
//SYSTSPRT DD SYSOUT=Z
//C1MSGS3  DD SYSOUT=*
//SYSTSIN  DD *
 %C1MSGS3
/*
//CHECK010 IF JSTEP010.RC GT 0 THEN
//*
//JSTEP015 EXEC @SPWARN
//CHECK010 ENDIF
//*
//JSTEP020 EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=Z
//SYSUT1   DD DISP=(OLD,PASS),DSN=&&&&C1PRINT1
//         DD DISP=(OLD,PASS),DSN=&&&&C1PRINT2
//SYSUT2   DD SYSOUT=Z
//SYSIN    DD DUMMY
//*
//CHECK020 IF JSTEP020.RC GT 0 THEN
//*
//JSTEP025 EXEC @SPWARN
//CHECK020 ENDIF
//*
//JSTEP030 EXEC PGM=IKJEFT1B
//SYSEXEC  DD DISP=SHR,DSN=&REXXLIB
//         DD DISP=SHR,DSN=&REXXLIB2
//SYSTSPRT DD SYSOUT=*
//COMPLST1 DD DISP=(OLD,DELETE),DSN=&&&&C1PRINT1
//COMPLST2 DD DISP=(OLD,DELETE),DSN=&&&&C1PRINT2
//TRACEX   DD DUMMY
//REPORT   DD SYSOUT=*
//* THE CLCOMP REXX TAKES VARIOUS POSITIONAL PARAMETERS AS FOLLOWS:
//* %CLCOMP <<PG INFO?>> <<PG SYMBOLICS?>> <<RELATED OBJECTS?>>
//*  <<OUTPUT COMPONENTS?>> <<DIFFERENCES ONLY?>> <<INPUT COMPONENTS?>>
//SYSTSIN  DD *
 %CLCOMP &CLPGI &CLPGS &CLRO &CLOC &CLDO &CLIC
/*
//CHECK030 IF JSTEP030.RC GT 0 THEN
//*
//JSTEP035 EXEC @SPWARN
//CHECK030 ENDIF
//*
