/*
//*--SKELETON CMSCDUP2                                               --
//*
//*********************************************************************
//** SPWARN - ABEND IF NDMUPD RETURN CODE IS GREATER THAN FOUR       **
//*********************************************************************
//CHECKIT  IF NDMUPD.RC NE 0 THEN
//*
//SPWARN   EXEC @SPWARN,COND=EVEN
//CHECKIT  ENDIF
//*
