//*********************************************************************
//** SKELETON CMSEXER                                                **
//** NDVRC1 - ENDEVOR PRODUCTION PACKAGE EXECUTION                   **
//*********************************************************************
//PACKEXEC EXEC PGM=NDVRC1,DYNAMNBR=1500,PARM='C1BM3000,,&PKG'
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=C
//C1SORTIO DD SPACE=(TRK,(750,750),RLSE),
//             RECFM=VB,LRECL=32760,BLKSIZE=32764
//C1TPDD01 DD SPACE=(TRK,(75,15),RLSE),RECFM=VB,LRECL=260
//C1TPDD02 DD SPACE=(TRK,(75,15),RLSE),RECFM=VB,LRECL=260
//C1TPLSIN DD SPACE=(TRK,(75,15),RLSE),RECFM=FB,LRECL=80
//C1TPLSOU DD SPACE=(TRK,(75,15),RLSE)
//APIPRINT DD SYSOUT=*
//HLAPILOG DD SYSOUT=*
//C1PLMSGS DD SYSOUT=*
//C1MSGS1  DD SYSOUT=*
//C1MSGS2  DD SYSOUT=*
//EN$PPRT  DD DUMMY
//EN$CAP&NN DD SYSOUT=*
//C1PRINT  DD SYSOUT=*,RECFM=FBA,LRECL=121
//SYSABEND DD SYSOUT=C
//SYSOUT   DD SYSOUT=*
//BSTIPT01 DD SPACE=(TRK,(30,15),RLSE),RECFM=FB,LRECL=80
//*
//CHECKIT  IF PACKEXEC.RC GT 0 THEN
//NDVRMSG  EXEC PGM=IKJEFT1B
//SYSEXEC  DD DSN=PGEV.BASE.REXX,DISP=SHR
//SYSTSPRT DD SYSOUT=*
//C1MSGS3  DD SYSOUT=*
//SYSTSIN  DD *
 %C1MSGS3
/*
//CHECKIT  ENDIF
//*
//*********************************************************************
//** SPWARN - ABEND IF PACKEXEC RETURN CODE IS GREATER THAN EIGHT    **
//*********************************************************************
//CHECKIT  IF PACKEXEC.RC GT 8 THEN
//*
//SPWARN   EXEC @SPWARN,COND=EVEN
//CHECKIT  ENDIF
//*
