//*--SKELETON CMSSHP1R - START OF SHIPMENT STEP                      --
//*********************************************************************
//** NDVRC1 - SHIP PACKAGE TO EACH OF THE DESTINATIONS SPECIFIED     **
//**          IN PGEV.BASE.DATA(DESTSYS)                             **
//*********************************************************************
//SHIPMENT EXEC PGM=NDVRC1,DYNAMNBR=1500,
//             PARM='C1BMX000,&CURRDT,&CURRTM,SHIP,PMFBCH'
//SYSABEND DD SYSOUT=C
//APIPRINT DD SYSOUT=*
//HLAPILOG DD SYSOUT=*
//C1BMXLOG DD SYSOUT=*
//C1BMXDET DD DSN=&SHIPHLQC..XDET,
//             DISP=(NEW,CATLG,DELETE),
//             RECFM=FBA,LRECL=133,
//             SPACE=(TRK,(15,30),RLSE)
//C1BMXSUM DD SYSOUT=*
//C1BMXSYN DD SYSOUT=*
//C1BMXLCC DD DSN=&XLCC,DISP=(,DELETE),
//             SPACE=(TRK,(15,15),RLSE),RECFM=FB,
//             LRECL=80
)SEL &C1SY = EK
//C1BMXLCM DD DSN=PREV.FEV1.SOURCE,DISP=SHR
//         DD DSN=&EVBASE..BASE.SOURCE,DISP=SHR
//         DD DSN=SYSNDVR.CAI.SOURCE,DISP=SHR
)ENDSEL
)SEL &C1SY ^= EK
//C1BMXLCM DD DSN=&EVBASE..BASE.SOURCE,DISP=SHR
//         DD DSN=SYSNDVR.CAI.SOURCE,DISP=SHR
)ENDSEL
)SEL &C1SY = EK
//C1BMXMDL DD DSN=PREV.FEV1.SOURCE,DISP=SHR
//         DD DSN=&EVBASE..BASE.SOURCE,DISP=SHR
//         DD DSN=SYSNDVR.CAI.SOURCE,DISP=SHR
)ENDSEL
)SEL &C1SY ^= EK
//C1BMXMDL DD DSN=&EVBASE..BASE.SOURCE,DISP=SHR
//         DD DSN=SYSNDVR.CAI.SOURCE,DISP=SHR
)ENDSEL
//C1BMXNWC DD DSN=&SHIPHLQC..XNWC,
//             DISP=(NEW,CATLG,DELETE),
//             RECFM=FB,LRECL=80,
//             SPACE=(TRK,(15,15),RLSE)
)SEL &C1SY = EK
//C1BMXNWM DD DSN=PREV.FEV1.SOURCE,DISP=SHR
//         DD DSN=&EVBASE..BASE.SOURCE,DISP=SHR
//         DD DSN=SYSNDVR.CAI.SOURCE,DISP=SHR
)ENDSEL
)SEL &C1SY ^= EK
//C1BMXNWM DD DSN=&EVBASE..BASE.SOURCE,DISP=SHR
//         DD DSN=SYSNDVR.CAI.SOURCE,DISP=SHR
)ENDSEL
//C1BMXRJC DD DSN=&EVBASE..BASE.ISPSLIB,DISP=SHR
//         DD DSN=SYSNDVR.CAI.ISPSLIB,DISP=SHR
//C1BMXDTM DD DSN=&XDTM.,DISP=(,DELETE),
//             SPACE=(TRK,(1,1)),RECFM=F,
//             LRECL=80
//C1BMXDEL DD DSN=&HDEL.,DISP=(,DELETE),
//             SPACE=(TRK,(15,15),RLSE),RECFM=F,
//             LRECL=80
//C1BMXUDL DD DSN=&&HUDL,DISP=(,DELETE),
//             SPACE=(TRK,(10,10),RLSE),RECFM=VB,
//             LRECL=3000
//C1BMXHJC DD DATA,DLM=##
//*
##
//C1BMXHCN DD DATA,DLM=##
//*
##
//C1BMXRCN DD DATA,DLM=##
//*
##
//C1BMXIN  DD *
