//*
//*--SKELETON CMSWIZAB - WIZARD ABORT STEP                           --
//WIZABORT EXEC GTISPF,
//             PARM='ISPSTART CMD(WIZABORT &CMR)'
//SYSEXEC  DD DISP=SHR,DSN=PGEV.BASE.REXX
//BACKOUT  DD SYSOUT=(A,INTRDR),DCB=LRECL=80
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD DUMMY
//*
//CHECKIT  IF (WIZABORT.ISPF.RC GT 4) THEN
//*
//SPWARN   EXEC @SPWARN,COND=EVEN
//CHECKIT  ENDIF
