)CM *----------------------------------------------------------------*
)CM *                                                                *
)CM *  COPYRIGHT (C) 1986-2012 CA. ALL RIGHTS RESERVED.              *
)CM *                                                                *
)CM * NAME: ENDSE000                                                 *
)CM *                                                                *
)CM * PURPOSE: THIS SKELETON IS USED BY THE QUICK-EDIT DIALOG TO     *
)CM *  GENERATE JCL TO GENERATE AN EDITED ELEMENT IN BATCH MODE.     *
)CM *                                                                *
)CM * ISPSLIB(SCMM@SYM) - IMBEDDED MBR TO SET STANDARD VARIABLES,    *
)CM *                     TAILORED BY THE HOST SITE.                 *
)CM * ISPSLIB(SCMM@LIB) - IMBEDDED STEPLIB/CONLIB CONCATENATIONS,    *
)CM *                     TAILORED BY THE HOST SITE.                 *
)CM *----------------------------------------------------------------*
)SEL &C1BJC1 NE &Z
&C1BJC1
)ENDSEL
)SEL &C1BJC2 NE &Z
&C1BJC2
)ENDSEL
)SEL &C1BJC3 NE &Z
&C1BJC3
)ENDSEL
)SEL &C1BJC4 NE &Z
&C1BJC4
)ENDSEL
)IM SCMM@SYM
//*-------------------------------------------------------------------*
//*    BATCH JCL STATEMENTS                                           *
//*-------------------------------------------------------------------*
//NDVRQEDT EXEC PGM=NDVRC1,
//             DYNAMNBR=1500,
//             PARM='C1BM3000'
//*-------------------------------------------------------------------*
//*  OUTPUT DATA SETS                                                 *
//*-------------------------------------------------------------------*
//APIPRINT DD SYSOUT=Z
//HLAPILOG DD SYSOUT=*
//C1MSGS1  DD SYSOUT=*
//C1MSGS2  DD SYSOUT=*
//SYSUDUMP DD SYSOUT=C
//SYMDUMP  DD DUMMY
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//*-------------------------------------------------------------------*
//*  CONTROL STATEMENTS                                               *
//*-------------------------------------------------------------------*
//BSTIPT01 DD *
&EEVGENS1
&EEVGENS2
&EEVGENS3
&EEVGENS4
&EEVGENS5
&EEVGENS6
&EEVGENS7
&EEVGENS8
&EEVGENS9
)SEL &EEVINJCL = Y
//*-------------------------------------------------------------------*
//*  INCLUDED JCL                                                     *
//*-------------------------------------------------------------------*
)SEL &VNBDD01 NE &Z
&VNBDD01
)ENDSEL
)SEL &VNBDD02 NE &Z
&VNBDD02
)ENDSEL
)SEL &VNBDD03 NE &Z
&VNBDD03
)ENDSEL
)SEL &VNBDD04 NE &Z
&VNBDD04
)ENDSEL
)SEL &VNBDD05 NE &Z
&VNBDD05
)ENDSEL
)SEL &VNBDD06 NE &Z
&VNBDD06
)ENDSEL
)SEL &VNBDD07 NE &Z
&VNBDD07
)ENDSEL
)SEL &VNBDD08 NE &Z
&VNBDD08
)ENDSEL
)SEL &VNBDD09 NE &Z
&VNBDD09
)ENDSEL
)SEL &VNBDD10 NE &Z
&VNBDD10
)ENDSEL
)SEL &VNBDD11 NE &Z
&VNBDD11
)ENDSEL
)SEL &VNBDD12 NE &Z
&VNBDD12
)ENDSEL
)SEL &VNBDD13 NE &Z
&VNBDD13
)ENDSEL
)SEL &VNBDD14 NE &Z
&VNBDD14
)ENDSEL
)SEL &VNBDD15 NE &Z
&VNBDD15
)ENDSEL
)SEL &VNBDD16 NE &Z
&VNBDD16
)ENDSEL
)SEL &VNBDD17 NE &Z
&VNBDD17
)ENDSEL
)SEL &VNBDD18 NE &Z
&VNBDD18
)ENDSEL
)SEL &VNBDD19 NE &Z
&VNBDD19
)ENDSEL
)SEL &VNBDD20 NE &Z
&VNBDD20
)ENDSEL
)ENDSEL
//* ENDES000 GENERATED BY &ZUSER ON &ZDATE AT &ZTIME
//*
//IFBAD    IF (RC >> 4) THEN
//*
)IM C1MSGS3
//NDBAD    ENDIF
