//&PREFIX.CKQ1 JOB 0,'DATASET COMPARE',CLASS=C,NOTIFY=&SYSUID
//*
//DELETE   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=Z
//SYSIN    DD *
)SEL &CPLEX = Y
 DELETE &PREFIX..&SYSUID..&DSN..CHKC1
)ENDSEL
)SEL &DPLEX = Y
 DELETE &PREFIX..&SYSUID..&DSN..CHKD1
)ENDSEL
)SEL &EPLEX = Y
 DELETE &PREFIX..&SYSUID..&DSN..CHKE1
)ENDSEL
)SEL &FPLEX = Y
 DELETE &PREFIX..&SYSUID..&DSN..CHKF1
)ENDSEL
)SEL &MPLEX = Y
 DELETE &PREFIX..&SYSUID..&DSN..CHKM1
)ENDSEL
)SEL &NPLEX = Y
 DELETE &PREFIX..&SYSUID..&DSN..CHKN1
)ENDSEL
)SEL &PPLEX = Y
 DELETE &PREFIX..&SYSUID..&DSN..CHKP1
)ENDSEL
)SEL &TPLEX = Y
 DELETE &PREFIX..&SYSUID..&DSN..CHKT1
)ENDSEL
)SEL &PREV  = Y
 DELETE &PREFIX..&SYSUID..&DSN..CHKPREV
)ENDSEL
 SET MAXCC=0
//**
//**
//**
)SEL &CPLEX = Y
//SUBMITC1 EXEC PGM=IEBGENER
//SYSUT1   DD DATA,DLM=ZZ
//&PREFIX.CKC1 JOB 0,CLASS=N,NOTIFY=&SYSUID
/*ROUTE XEQ RBJESC1
//*
//RECALL   EXEC PGM=IEFBR14
//DD1      DD DISP=SHR,DSN=&DSN
//*
//DELETE   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=Z
//SYSIN    DD *
 DELETE &PREFIX..&SYSUID..&DSN..CHKC1
 SET MAXCC=0
//*
//CHCKSUM2 EXEC PGM=PDSM37,REGION=200M
//PDSMRPT  DD SYSOUT=*
//CHECKSUM DD DSN=&PREFIX..&SYSUID..&DSN..CHKC1,
//             SPACE=(CYL,(1,1),RLSE),
//             DISP=(,CATLG,DELETE)
//SYSIN    DD *
  GENERATE OUTDD=CHECKSUM,RECALL=YES
  SELECT   DSN=&DSN
  EXCLUDE  MEM=$$$SPACE
//*
//NDM      EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//DMNETMAP DD DISP=SHR,DSN=PGTN.CD.CD01.C1.NETMAP
//DMMSGFIL DD DSN=PGTN.CD.MSG,DISP=SHR
//DMPRINT  DD SYSOUT=*
//DMPUBLIB DD DSN=PGOS.BASE.NDMPROC,DISP=SHR
//SYSIN    DD *
 SIGNON
  SUBMIT PROC=MFS1FLXX SNODE=CD.OS390.Q101               -
         NEWNAME=TTEVCOMP                                -
         &&DISPI1=SHR,DELETE &&DISPO1=RPL                  -
         &&FILEIN1=&PREFIX..&SYSUID..&DSN..CHKC1      -
         &&FILEOUT1=&PREFIX..&SYSUID..&DSN..CHKC1
 SIGNOFF
ZZ
//SYSUT2   DD SYSOUT=(A,INTRDR)
//SYSIN    DD DUMMY
//SYSPRINT DD SYSOUT=Z
)ENDSEL
//*
)SEL &DPLEX = Y
//SUBMITD1 EXEC PGM=IEBGENER
//SYSUT1   DD DATA,DLM=ZZ
//&PREFIX.CKD1 JOB 0,CLASS=N,NOTIFY=&SYSUID
/*ROUTE XEQ RBJESD1
//*
//RECALL   EXEC PGM=IEFBR14
//DD1      DD DISP=SHR,DSN=&DSN
//*
//DELETE   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=Z
//SYSIN    DD *
 DELETE &PREFIX..&SYSUID..&DSN..CHKD1
 SET MAXCC=0
//*
//CHCKSUM2 EXEC PGM=PDSM37,REGION=200M
//PDSMRPT  DD SYSOUT=*
//CHECKSUM DD DSN=&PREFIX..&SYSUID..&DSN..CHKD1,
//             SPACE=(CYL,(1,1),RLSE),
//             DISP=(,CATLG,DELETE)
//SYSIN    DD *
  GENERATE OUTDD=CHECKSUM,RECALL=YES
  SELECT   DSN=&DSN
  EXCLUDE  MEM=$$$SPACE
//*
//NDM      EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//DMNETMAP DD DISP=SHR,DSN=PGTN.CD.CD01.D1.NETMAP
//DMMSGFIL DD DSN=PGTN.CD.MSG,DISP=SHR
//DMPRINT  DD SYSOUT=*
//DMPUBLIB DD DSN=PGOS.BASE.NDMPROC,DISP=SHR
//SYSIN    DD *
 SIGNON
  SUBMIT PROC=MFS1FLXX SNODE=CD.OS390.Q101               -
         NEWNAME=TTEVCOMP                                -
         &&DISPI1=SHR,DELETE &&DISPO1=RPL                  -
         &&FILEIN1=&PREFIX..&SYSUID..&DSN..CHKD1      -
         &&FILEOUT1=&PREFIX..&SYSUID..&DSN..CHKD1
 SIGNOFF
ZZ
//SYSUT2   DD SYSOUT=(A,INTRDR)
//SYSIN    DD DUMMY
//SYSPRINT DD SYSOUT=Z
)ENDSEL
//*
)SEL &EPLEX = Y
//SUBMITE1 EXEC PGM=IEBGENER
//SYSUT1   DD DATA,DLM=ZZ
//&PREFIX.CKE1 JOB 0,CLASS=N,NOTIFY=&SYSUID
/*ROUTE XEQ RBJESE1
//*
//RECALL   EXEC PGM=IEFBR14
//DD1      DD DISP=SHR,DSN=&DSN
//*
//DELETE   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=Z
//SYSIN    DD *
 DELETE &PREFIX..&SYSUID..&DSN..CHKE1
 SET MAXCC=0
//*
//CHCKSUM2 EXEC PGM=PDSM37,REGION=200M
//PDSMRPT  DD SYSOUT=*
//CHECKSUM DD DSN=&PREFIX..&SYSUID..&DSN..CHKE1,
//             SPACE=(CYL,(1,1),RLSE),
//             DISP=(,CATLG,DELETE)
//SYSIN    DD *
  GENERATE OUTDD=CHECKSUM,RECALL=YES
  SELECT   DSN=&DSN
  EXCLUDE  MEM=$$$SPACE
//*
//NDM      EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//DMNETMAP DD DISP=SHR,DSN=PGTN.CD.CD01.E1.NETMAP
//DMMSGFIL DD DSN=PGTN.CD.MSG,DISP=SHR
//DMPRINT  DD SYSOUT=*
//DMPUBLIB DD DSN=PGOS.BASE.NDMPROC,DISP=SHR
//SYSIN    DD *
 SIGNON
  SUBMIT PROC=MFS1FLXX SNODE=CD.OS390.Q101               -
         NEWNAME=TTEVCOMP                                -
         &&DISPI1=SHR,DELETE &&DISPO1=RPL                  -
         &&FILEIN1=&PREFIX..&SYSUID..&DSN..CHKE1      -
         &&FILEOUT1=&PREFIX..&SYSUID..&DSN..CHKE1
 SIGNOFF
ZZ
//SYSUT2   DD SYSOUT=(A,INTRDR)
//SYSIN    DD DUMMY
//SYSPRINT DD SYSOUT=Z
)ENDSEL
//*
)SEL &FPLEX = Y
//SUBMITF1 EXEC PGM=IEBGENER
//SYSUT1   DD DATA,DLM=ZZ
//&PREFIX.CKF1 JOB 0,CLASS=N,NOTIFY=&SYSUID
/*ROUTE XEQ RBJESF1
//*
//RECALL   EXEC PGM=IEFBR14
//DD1      DD DISP=SHR,DSN=&DSN
//*
//DELETE   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=Z
//SYSIN    DD *
 DELETE &PREFIX..&SYSUID..&DSN..CHKF1
 SET MAXCC=0
//*
//CHCKSUM2 EXEC PGM=PDSM37,REGION=200M
//PDSMRPT  DD SYSOUT=*
//CHECKSUM DD DSN=&PREFIX..&SYSUID..&DSN..CHKF1,
//             SPACE=(CYL,(1,1),RLSE),
//             DISP=(,CATLG,DELETE)
//SYSIN    DD *
  GENERATE OUTDD=CHECKSUM,RECALL=YES
  SELECT   DSN=&DSN
  EXCLUDE  MEM=$$$SPACE
//*
//NDM      EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//DMNETMAP DD DISP=SHR,DSN=PGTN.CD.CD01.F1.NETMAP
//DMMSGFIL DD DSN=PGTN.CD.MSG,DISP=SHR
//DMPRINT  DD SYSOUT=*
//DMPUBLIB DD DSN=PGOS.BASE.NDMPROC,DISP=SHR
//SYSIN    DD *
 SIGNON
  SUBMIT PROC=MFS1FLXX SNODE=CD.OS390.Q101               -
         NEWNAME=TTEVCOMP                                -
         &&DISPI1=SHR,DELETE &&DISPO1=RPL                  -
         &&FILEIN1=&PREFIX..&SYSUID..&DSN..CHKF1      -
         &&FILEOUT1=&PREFIX..&SYSUID..&DSN..CHKF1
 SIGNOFF
ZZ
//SYSUT2   DD SYSOUT=(A,INTRDR)
//SYSIN    DD DUMMY
//SYSPRINT DD SYSOUT=Z
)ENDSEL
//*
)SEL &MPLEX = Y
//SUBMITM1 EXEC PGM=IEBGENER
//SYSUT1   DD DATA,DLM=ZZ
//&PREFIX.CKM1 JOB 0,CLASS=C,NOTIFY=&SYSUID
/*ROUTE XEQ RBJESM1
//*
//RECALL   EXEC PGM=IEFBR14
//DD1      DD DISP=SHR,DSN=&DSN
//*
//DELETE   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=Z
//SYSIN    DD *
 DELETE &PREFIX..&SYSUID..&DSN..CHKM1
 SET MAXCC=0
//*
//CHCKSUM2 EXEC PGM=PDSM37,REGION=200M
//PDSMRPT  DD SYSOUT=*
//CHECKSUM DD DSN=&PREFIX..&SYSUID..&DSN..CHKM1,
//             SPACE=(CYL,(1,1),RLSE),
//             DISP=(,CATLG,DELETE)
//SYSIN    DD *
  GENERATE OUTDD=CHECKSUM,RECALL=YES
  SELECT   DSN=&DSN
  EXCLUDE  MEM=$$$SPACE
//*
//NDM      EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//DMNETMAP DD DISP=SHR,DSN=PGTN.CD.CD01.M1.NETMAP
//DMMSGFIL DD DSN=PGTN.CD.MSG,DISP=SHR
//DMPRINT  DD SYSOUT=*
//DMPUBLIB DD DSN=PGOS.BASE.NDMPROC,DISP=SHR
//SYSIN    DD *
 SIGNON
  SUBMIT PROC=MFS1FLXX SNODE=CD.OS390.Q101               -
         NEWNAME=TTEVCOMP                                -
         &&DISPI1=SHR,DELETE &&DISPO1=RPL                  -
         &&FILEIN1=&PREFIX..&SYSUID..&DSN..CHKM1      -
         &&FILEOUT1=&PREFIX..&SYSUID..&DSN..CHKM1
 SIGNOFF
ZZ
//SYSUT2   DD SYSOUT=(A,INTRDR)
//SYSIN    DD DUMMY
//SYSPRINT DD SYSOUT=Z
)ENDSEL
//**
//**
//**
)SEL &NPLEX = Y
//SUBMITN1 EXEC PGM=IEBGENER
//SYSUT1   DD DATA,DLM=ZZ
//&PREFIX.CKN1 JOB 0,CLASS=T,NOTIFY=&SYSUID
/*ROUTE XEQ RBJESN1
//*
//RECALL   EXEC PGM=IEFBR14
//DD1      DD DISP=SHR,DSN=&DSN
//*
//DELETE   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=Z
//SYSIN    DD *
 DELETE &PREFIX..&SYSUID..&DSN..CHKN1
 SET MAXCC=0
//*
//CHCKSUM2 EXEC PGM=PDSM37,REGION=200M
//PDSMRPT  DD SYSOUT=*
//CHECKSUM DD DSN=&PREFIX..&SYSUID..&DSN..CHKN1,
//             SPACE=(CYL,(1,1),RLSE),
//             DISP=(,CATLG,DELETE)
//SYSIN    DD *
  GENERATE OUTDD=CHECKSUM,RECALL=YES
  SELECT   DSN=&DSN
  EXCLUDE  MEM=$$$SPACE
//*
//NDM      EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//DMNETMAP DD DISP=SHR,DSN=PGTN.CD.CD01.N1.NETMAP
//DMMSGFIL DD DSN=PGTN.CD.MSG,DISP=SHR
//DMPRINT  DD SYSOUT=*
//DMPUBLIB DD DSN=PGOS.BASE.NDMPROC,DISP=SHR
//SYSIN    DD *
 SIGNON
  SUBMIT PROC=MFS1FLXX SNODE=CD.OS390.Q101               -
         NEWNAME=TTEVCOMP                                -
         &&DISPI1=SHR,DELETE &&DISPO1=RPL                  -
         &&FILEIN1=&PREFIX..&SYSUID..&DSN..CHKN1      -
         &&FILEOUT1=&PREFIX..&SYSUID..&DSN..CHKN1
 SIGNOFF
ZZ
//SYSUT2   DD SYSOUT=(A,INTRDR)
//SYSIN    DD DUMMY
//SYSPRINT DD SYSOUT=Z
)ENDSEL
//**
//**
//**
)SEL &PPLEX = Y
//SUBMITP1 EXEC PGM=IEBGENER
//SYSUT1   DD DATA,DLM=ZZ
//&PREFIX.CKP1 JOB 0,CLASS=T,NOTIFY=&SYSUID
/*ROUTE XEQ RBJESP1
//*
//RECALL   EXEC PGM=IEFBR14
//DD1      DD DISP=SHR,DSN=&DSN
//*
//DELETE   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=Z
//SYSIN    DD *
 DELETE &PREFIX..&SYSUID..&DSN..CHKP1
 SET MAXCC=0
//*
//CHCKSUM2 EXEC PGM=PDSM37,REGION=200M
//PDSMRPT  DD SYSOUT=*
//CHECKSUM DD DSN=&PREFIX..&SYSUID..&DSN..CHKP1,
//             SPACE=(CYL,(1,1),RLSE),
//             DISP=(,CATLG,DELETE)
//SYSIN    DD *
  GENERATE OUTDD=CHECKSUM,RECALL=YES
  SELECT   DSN=&DSN
  EXCLUDE  MEM=$$$SPACE
//*
//NDM      EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//DMNETMAP DD DISP=SHR,DSN=PGTN.CD.CD01.P1.NETMAP
//DMMSGFIL DD DSN=PGTN.CD.MSG,DISP=SHR
//DMPRINT  DD SYSOUT=*
//DMPUBLIB DD DSN=PGOS.BASE.NDMPROC,DISP=SHR
//SYSIN    DD *
 SIGNON
  SUBMIT PROC=MFS1FLXX SNODE=CD.OS390.Q101               -
         NEWNAME=TTEVCOMP                                -
         &&DISPI1=SHR,DELETE &&DISPO1=RPL                  -
         &&FILEIN1=&PREFIX..&SYSUID..&DSN..CHKP1      -
         &&FILEOUT1=&PREFIX..&SYSUID..&DSN..CHKP1
 SIGNOFF
ZZ
//SYSUT2   DD SYSOUT=(A,INTRDR)
//SYSIN    DD DUMMY
//SYSPRINT DD SYSOUT=Z
)ENDSEL
//**
//**
//**
)SEL &QPLEX = Y
//CHCKSUMQ EXEC PGM=PDSM37,REGION=200M
//PDSMRPT  DD SYSOUT=Z
//CHECKSUM DD DSN=&PREFIX..&SYSUID..&DSN..CHKQ1,
//             SPACE=(CYL,(1,1),RLSE),
//             DISP=(,CATLG,DELETE)
//SYSIN    DD *
  GENERATE OUTDD=CHECKSUM,RECALL=YES
  SELECT   DSN=&DSN
  EXCLUDE  MEM=$$$SPACE
)ENDSEL
//**
//**
//**
)SEL &PREV = Y
//CHCKSUME EXEC PGM=PDSM37,REGION=200M
//PDSMRPT  DD SYSOUT=Z
//CHECKSUM DD DSN=&PREFIX..&SYSUID..&DSN..CHKPREV,
//             SPACE=(CYL,(1,1),RLSE),
//             DISP=(,CATLG,DELETE)
//SYSIN    DD *
  GENERATE OUTDD=CHECKSUM,RECALL=YES
  SELECT   DSN=&PREVDSN
  EXCLUDE  MEM=$$$SPACE
  EXCLUDE  MEM=0+-
  EXCLUDE  MEM=1+-
  EXCLUDE  MEM=2+-
  EXCLUDE  MEM=3+-
  EXCLUDE  MEM=4+-
  EXCLUDE  MEM=5+-
  EXCLUDE  MEM=6+-
  EXCLUDE  MEM=7+-
  EXCLUDE  MEM=8+-
  EXCLUDE  MEM=9+-
  EXCLUDE  MEM=o+-
  EXCLUDE  MEM=.+-
)ENDSEL
//*
//*
//*
//WAIT     EXEC PGM=IKJEFT1B
//SYSTSPRT DD SYSOUT=*,LRECL=80
//SYSEXEC  DD DSN=PGEV.BASE.REXX,DISP=SHR
//SYSTSIN  DD *
ISPSTART CMD(WAITER 1                                                  +
             &PREFIX..&SYSUID..&DSN                                    +
             &WAITCMD)
//ISPLLIB  DD DISP=SHR,DSN=PGEV.BASE.LOAD
//ISPSLIB  DD DISP=SHR,DSN=SYS1.SISPSENU
//ISPMLIB  DD DISP=SHR,DSN=SYS1.SISPMENU
//ISPPLIB  DD DISP=SHR,DSN=SYS1.SISPPENU
//ISPTLIB  DD DISP=SHR,DSN=SYS1.SISPTENU
//ISPCTL1  DD SPACE=(CYL,(1,1)),
//             LRECL=80,BLKSIZE=800,RECFM=FB
//ISPPROF  DD SPACE=(CYL,(1,1,20)),LRECL=80,RECFM=FB
//ISPLIST  DD SYSOUT=*,
//             LRECL=121,BLKSIZE=1210,RECFM=FBA
//ISPLOG   DD SYSOUT=Z,RECFM=VA,LRECL=125,BLKSIZE=129
//SUBJCL   DD DATA,DLM=ZZ
//&PREFIX.CHKS JOB CLASS=C,NOTIFY=&SYSUID
//*
//COMPARE  EXEC PGM=PDSM37,REGION=200M
//SYSPRINT DD SYSOUT=*
//PDSMRPT  DD SYSOUT=*
)SEL &CPLEX = Y
//C1F      DD DSN=&PREFIX..&SYSUID..&DSN..CHKC1,
//             DISP=(OLD,DELETE)
)ENDSEL
)SEL &DPLEX = Y
//D1F      DD DSN=&PREFIX..&SYSUID..&DSN..CHKD1,
//             DISP=(OLD,DELETE)
)ENDSEL
)SEL &EPLEX = Y
//E1F      DD DSN=&PREFIX..&SYSUID..&DSN..CHKE1,
//             DISP=(OLD,DELETE)
)ENDSEL
)SEL &FPLEX = Y
//F1F      DD DSN=&PREFIX..&SYSUID..&DSN..CHKF1,
//             DISP=(OLD,DELETE)
)ENDSEL
)SEL &MPLEX = Y
//M1F      DD DSN=&PREFIX..&SYSUID..&DSN..CHKM1,
//             DISP=(OLD,DELETE)
)ENDSEL
)SEL &NPLEX = Y
//N1F      DD DSN=&PREFIX..&SYSUID..&DSN..CHKN1,
//             DISP=(OLD,DELETE)
)ENDSEL
)SEL &PPLEX = Y
//P1F      DD DSN=&PREFIX..&SYSUID..&DSN..CHKP1,
//             DISP=(OLD,DELETE)
)ENDSEL
)SEL &QPLEX = Y
//Q1F      DD DSN=&PREFIX..&SYSUID..&DSN..CHKQ1,
//             DISP=(OLD,DELETE)
)ENDSEL
)SEL &PREV = Y
//PREV     DD DSN=&PREFIX..&SYSUID..&DSN..CHKPREV,
//             DISP=(OLD,DELETE)
)ENDSEL
//SYSIN    DD *
  COMPARE  INDD=&CMPRCMD
           REPORT=STANDARD
           MODE=DATASET2
/*
ZZ
