//&jpfx.LB5I JOB 0,'&desc',CLASS=&class,MSGCLASS=&mcls,USER=&user
//*
//*-- EVGELB5A TYPE SKELS
//*
//JSTEP010 EXEC PGM=BC1PNLIB
//STEPLIB  DD DSN=SYSNDVR.NOINFO.AUTHLIB,DISP=SHR
//ELIB     DD DISP=SHR,DSN=&dsn
//SYSPRINT DD DSN=&&INQUIRE,DISP=(NEW,PASS),
//             SPACE=(TRK,(15,15),RLSE),LRECL=133,
//             RECFM=FBA
//BSTERR   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=C
//SYSIN    DD DSN=PGEV.BASE.DATA(ELIBAUTO),DISP=SHR
//CHECK010 IF JSTEP010.RC NE 0 THEN
//*
//JSTEP015 EXEC @SPWARN
//CHECK010 ENDIF
//*
