//*
//*-- EVGELB5B TYPE SKELS
//*
//JSTEP020 EXEC PGM=BC1PNLIB
//STEPLIB  DD DSN=SYSNDVR.NOINFO.AUTHLIB,DISP=SHR
//ELIBA    DD DSN=PREV.A&SY..LISTINGS,DISP=SHR
//ELIBB    DD DSN=PREV.B&SY..LISTINGS,DISP=SHR
//ELIBC    DD DSN=PREV.C&SY..LISTINGS,DISP=SHR
//ELIBD    DD DSN=PREV.D&SY..LISTINGS,DISP=SHR
//ELIBE    DD DSN=PREV.E&SY..LISTINGS,DISP=SHR
//ELIBF    DD DSN=PREV.F&SY..LISTINGS,DISP=SHR
//ELIBO    DD DSN=PREV.O&SY..LISTINGS,DISP=SHR
//ELIBP    DD DSN=PREV.P&SY..LISTINGS,DISP=SHR
//SYSPRINT DD DSN=&&ALLDSNS,DISP=(NEW,PASS),
//             SPACE=(TRK,(75,75),RLSE),LRECL=133,
//             RECFM=FBA
//BSTERR   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=C
//SYSIN    DD *
  INQUIRE  DDNAME=ELIBA OPTION MEMBERS .
  INQUIRE  DDNAME=ELIBB OPTION MEMBERS .
  INQUIRE  DDNAME=ELIBC OPTION MEMBERS .
  INQUIRE  DDNAME=ELIBD OPTION MEMBERS .
  INQUIRE  DDNAME=ELIBE OPTION MEMBERS .
  INQUIRE  DDNAME=ELIBF OPTION MEMBERS .
  INQUIRE  DDNAME=ELIBO OPTION MEMBERS .
  INQUIRE  DDNAME=ELIBP OPTION MEMBERS .
/*
//CHECK020 IF JSTEP020.RC NE 0 THEN
//*
//JSTEP025 EXEC @SPWARN
//CHECK020 ENDIF
//*
//JSTEP030 EXEC PGM=SORT,PARM='NULLOUT=RC4'
//SYSOUT   DD SYSOUT=Z
//SORTIN   DD DSN=&&ALLDSNS,DISP=(OLD,PASS)
//SORTOUT  DD DSN=&&MAXPAGE,DISP=(NEW,PASS),
//             SPACE=(TRK,(75,75),RLSE),LRECL=133,
//             RECFM=FBA
//SYSIN    DD *
  INCLUDE  COND=(7,7,CH,EQ,C'MEMBER=')
  SORT FIELDS=(122,7,CH,D)
/*
//CHECK030 IF JSTEP030.RC NE 0 THEN
//*
//JSTEP035 EXEC @SPWARN
//CHECK030 ENDIF
//*
//JSTEP040 EXEC PGM=SORT,PARM='NULLOUT=RC4'
//SYSOUT   DD SYSOUT=Z
//SORTIN   DD DSN=&&ALLDSNS,DISP=(OLD,PASS)
//SORTOUT  DD DSN=&&MAXMEMS,DISP=(NEW,PASS),
//             SPACE=(TRK,(75,75),RLSE),LRECL=133,
//             RECFM=FBA
//SYSIN    DD *
  INCLUDE  COND=(14,1,CH,EQ,C'/')
  SORT FIELDS=(45,19,CH,A)
  SUM FIELDS=NONE
/*
//CHECK040 IF JSTEP040.RC NE 0 THEN
//*
//JSTEP045 EXEC @SPWARN
//CHECK040 ENDIF
//*
