//SYSUT2   DD DSN=&&TEMPDSN&SGTLIB,DISP=(NEW,PASS),
//             SPACE=(TRK,(5,5)),RECFM=FB,LRECL=80
//SYSIN    DD DUMMY
//*
//NDVRBAT  EXEC PGM=NDVRC1,DYNAMNBR=1500,PARM='C1BM3000'
//SYSPRINT DD SYSOUT=*
//PSPOFF   DD DUMMY
//C1SORTIO DD SPACE=(CYL,(50,50)),
//             RECFM=VB,LRECL=12405,BLKSIZE=12409
//C1TPDD01 DD SPACE=(CYL,5),
//             RECFM=VB,LRECL=260
//C1TPDD02 DD SPACE=(CYL,5),
//             RECFM=VB,LRECL=260
//C1TPLSIN DD SPACE=(CYL,5),
//             RECFM=FB,LRECL=80
//C1TPLSOU DD SPACE=(CYL,5)
//C1PLMSGS DD SYSOUT=*
//APIPRINT DD SYSOUT=Z
//HLAPILOG DD SYSOUT=*
//C1MSGS1  DD SYSOUT=*
//C1MSGS2  DD SYSOUT=*
//C1PRINT  DD SYSOUT=*,DCB=(RECFM=FBA,LRECL=121,BLKSIZE=0)
//SYSABEND DD SYSOUT=*
//SGTLIB&SGTLIB  DD DSN=&&TEMPDSN&SGTLIB,DISP=(OLD,DELETE)
//BSTIPT01 DD *
SET STOPRC 16 .
ADD ELEMENT '&CMRNO'
  FROM DDN SGTLIB&SGTLIB
  TO ENVIRONMENT 'ACPT' SYSTEM 'LN' SUBSYSTEM '&C1SUB'
    TYPE 'SGTLIB&SGTLIB'
  OPTIONS COMMENT 'GENEROL PROMOTE FOR &CMRNO' CCID '&CMRNO'
  OVE UPD
 .
/*
