//SYSUT2   DD DSN=TTYY.GENEROL.CNTL(&CHGNO),DISP=SHR
//SYSIN    DD DUMMY
//*
//NDVRBAT  EXEC PGM=NDVRC1,DYNAMNBR=1500,
//             PARM='C1BM3000'
//SYSPRINT DD SYSOUT=*
//PSPOFF   DD DUMMY
//SYSUDUMP DD SYSOUT=*
//SORTWK01 DD SPACE=(CYL,(5,5))
//SORTWK02 DD SPACE=(CYL,(5,5))
//SORTWK03 DD SPACE=(CYL,(5,5))
//SORTWK04 DD SPACE=(CYL,(5,5))
//C1SORTIO DD SPACE=(CYL,(50,50)),
//             RECFM=VB,LRECL=12405,BLKSIZE=12409
//APIPRINT DD SYSOUT=Z
//HLAPILOG DD SYSOUT=*
//C1MSGS1  DD SYSOUT=*
//C1MSGS2  DD SYSOUT=*
//C1PRINT  DD SYSOUT=*,RECFM=FBA,LRECL=121
//SYSOUT   DD SYSOUT=*
//BSTIPT01 DD *
 SET STOPRC 12 .
 ADD ELEMENT '&CHGNO'
   FROM DSNAME 'TTYY.GENEROL.CNTL'
   TO   ENVIRONMENT 'UNIT' SYSTEM 'LN' SUBSYSTEM 'LN1'
    TYPE 'SGTCNTL'
  OPTIONS CCID 'NDVR#SUPPORT' COMMENTS "TEST" UPD
 .
 MOVE ELEMENT '&CHGNO'
   FROM ENVIRONMENT 'UNIT' SYSTEM 'LN' SUBSYSTEM 'LN1'
    STAGE A TYPE 'SGTCNTL'
  OPTIONS CCID 'NDVR#SUPPORT' COMMENTS "TEST"
 .
