//*
//*-- EVGELB5C TYPE SKELS
//*
//JSTEP050 EXEC PGM=IKJEFT1B,PARM='ISPSTART CMD(ELIBAUTO &prefix)'
//ISPPROF  DD SPACE=(TRK,(1,1,4)),LRECL=80,
//             RECFM=FB
//SYSPROC  DD DSN=&ndvr..REXX,DISP=SHR
//         DD DSN=PGEV.BASE.REXX,DISP=SHR
//REPORT   DD DSN=&&INQUIRE,DISP=(OLD,DELETE)
)SEL &PROD = Y
//PRODELIB DD DSN=&&MAXPAGE,DISP=(OLD,DELETE)
//MEMBERS  DD DSN=&&MAXMEMS,DISP=(OLD,DELETE)
)ENDSEL
//ISPFILE  DD DSN=&prefix..ELIBLIST.CNTL,DISP=OLD
//ISPSLIB  DD DSN=&ndvr..ISPSLIB,DISP=SHR
//         DD DSN=PGEV.BASE.ISPSLIB,DISP=SHR
//ISPPLIB  DD DSN=SYS1.SISPPENU,DISP=SHR
//ISPMLIB  DD DSN=SYS1.SISPMENU,DISP=SHR
//ISPTLIB  DD DSN=SYS1.SISPTENU,DISP=SHR
//ISPLOG   DD SYSOUT=*,RECFM=VA,
//             LRECL=121
//ISPLIST  DD SYSOUT=*,RECFM=VA,
//             LRECL=121
//SYSTSPRT DD SYSOUT=*,RECFM=FB,LRECL=133
//SYSTSIN  DD DUMMY
//CHECK050 IF JSTEP050.RC NE 0 THEN
//*
//JSTEP055 EXEC @SPWARN
//CHECK050 ENDIF
//*
//JSTEP060 EXEC PGM=IEBCOPY
//FCOPYON  DD DUMMY
//SYSPRINT DD SYSOUT=*
//PDSIN    DD DSN=&prefix..ELIBLIST.CNTL,DISP=SHR
//PDSOUT   DD DSN=&prefix..NREPORTS.ELIB.REORG.JOBS(+1),
//             DISP=(NEW,CATLG,DELETE),
//             SPACE=(TRK,(15,15,5),RLSE),LRECL=80,
//             RECFM=FB
//SYSIN    DD *
 COPY INDD=PDSIN,OUTDD=PDSOUT
/*
//CHECK060 IF JSTEP060.RC NE 0 THEN
//*
//JSTEP065 EXEC @SPWARN
//CHECK060 ENDIF
//*
//JSTEP070 EXEC PGM=IEFBR14
//DD1      DD DSN=&pend1i,
//             DISP=(MOD,DELETE),
//             SPACE=(TRK,(0,0)),RECFM=FB,LRECL=80
//CHECK070 IF JSTEP070.RC NE 0 THEN
//*
//JSTEP075 EXEC @SPWARN
//CHECK070 ENDIF
//*
