//&HLQ.POST JOB 0,'RELEASE CJOB',CLASS=I,NOTIFY=&UID
//*
//SETVAR   SET ID=PG,BNK=G,TLQ=
//JCLLIB   JCLLIB ORDER=(PGOS.&TLQ.BASE.PROCLIB)
//*
//JSTEP010 EXEC OSBATCD,CDNO=CD02,PLEX=E1
//STEP010.SYSIN DD *
