&C1BJC1
&C1BJC2
&C1BJC3
&C1BJC4
//*
//* CREATED FROM PROD/EV/EV1/EVXPED01/SKELS
//*
)SEL    &CMD = E | &CMD = P
//******************************************************************
//* EXPORT ENDEVOR LISTING TEMP PDS
//******************************************************************
//NDVRLIST EXEC PGM=NDVRC1,PARM=(BC1PNCPY)
//I        DD DISP=SHR,DSN=PREV.&LISTQUAL..LISTINGS
//O        DD DSN=&&TEMP1,DISP=(,PASS,DELETE),
//             SPACE=(TRK,(30,75,44),RLSE),
//             RECFM=FBA,LRECL=133
//SYSPRINT DD SYSOUT=*
//APIPRINT DD SYSOUT=Z
//BSTERR   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=C
//SYSIN    DD *
 COPY INPUT DDNAME = I   OUTPUT DDNAME = O   MEMBER = &LISTMEM .
/*
)ENDSEL
)SEL     &CMD = P
//******************************************************************
//* COPY THE LISTING TO A PDS (AND RENAME TO ELEMENT NAME)
//******************************************************************
//NDVR2PDS EXEC PGM=IEBCOPY,COND=(0,LT)
//IN       DD DSN=&&TEMP1,DISP=(OLD,DELETE,DELETE)
//OUT      DD DISP=SHR,DSN=&UPDS1..&UPDS2..&UPDS3.
//SYSUT3   DD SPACE=(TRK,(30,15),RLSE)
//SYSUT4   DD SPACE=(TRK,(30,15),RLSE)
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  COPY O=OUT,I=IN
)SEL &LISTM8 = &ELE
  S M=(&ELE)
)ENDSEL
)SEL &LISTM8 ^= &ELE
  S M=((&LISTM8,&ELE.&UPD))
)ENDSEL
/*
)ENDSEL
)SEL     &CMD = E
//******************************************************************
//* ADD COMPILE LISTING INTO DDIO FILE FOR USE WITH COMPUWARE
//* PRODUCTS SUCH AS ABENDAID, XPEDITER AND STROBE
//******************************************************************
//NDVRDDIO EXEC PGM=CWP&JOBTYPE.DRVR,COND=(0,LT)
//CWPDDIO  DD DISP=SHR,DSN=&ODDIO1..&ODDIO2..&ODDIO3.
//SYSUDUMP DD SYSOUT=C
//SYSPRINT DD SYSOUT=*
//CWPPRTI  DD DSN=&&TEMP1(&LISTM8),DISP=(OLD,DELETE,DELETE)
//CWPERRM  DD SYSOUT=*
//CWPPRTO  DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CWPWRK0  DD SPACE=(TRK,(150,150),RLSE)
//CWPWRK1  DD SPACE=(TRK,(150,150),RLSE)
//CWPWRK2  DD SPACE=(TRK,(150,150),RLSE)
//CWPWRK3  DD SPACE=(TRK,(150,150),RLSE)
//CWPWRK4  DD SPACE=(TRK,(150,150),RLSE)
//CWPWRK5  DD SPACE=(TRK,(150,150),RLSE)
//CWPDECK  DD DUMMY
)SEL &JOBTYPE = A
//*
//* ASSEMBLER SPECIFIC BITS:
//*
//CWPPRMO  DD *
ASSEMBLER(OUTPUT(PRINT,DDIO))
)ENDSEL
)SEL &JOBTYPE = P
//*
//* PLI SPECIFIC BITS:
//*
//CWPPRMO  DD *
PL/I(OUTPUT(PRINT,DDIO))
)ENDSEL
)SEL &JOBTYPE = C
//*
//* COBOL SPECIFIC BITS:
//*
//CWPPRMO  DD *
COBOL(OUTPUT(NOPRINT,DDIO)),CONDDDIO(8)
)SEL &XPTYP = S
PROCESSOR(OUTPUT(PRINT,NODDIO),TEXT(NONE),$ASUP)
)ENDSEL
)SEL &XPTYP ^= S
PROCESSOR(OUTPUT(PRINT,NODDIO),TEXT(NONE))
)ENDSEL
DDIO(OUTPUT(NOLIST,FIND,CO))
)ENDSEL
/*
)ENDSEL
)SEL &CMD = X
//******************************************************************
//* COPY A LISTING FROM ONE DDIO FILE TO ANOTHER
//******************************************************************
//DDIODDIO EXEC PGM=CWDDSUTL,REGION=1024K,COND=(0,LT)
//ABNLFROM DD DISP=SHR,DSN=&IDDIO1..&IDDIO2..&IDDIO3.
//ABNLTO   DD DISP=SHR,DSN=&ODDIO1..&ODDIO2..&ODDIO3.
//SYSUDUMP DD SYSOUT=C
//ABNLREPT DD SYSOUT=*
//ABNLPARM DD *
 COPY DUPS=LOCKED,PROGRAM=&XPEDMEM
/*
)ENDSEL
