//&JOBNAME JOB 0,CLASS=3,MSGCLASS=0,NOTIFY=&SYSUID
//*
//* THIS IS A SAMPLE JOB TO EXECUTE LIST SCL TO SEARCH THROUGH ELEMENTS
//* N.B. SIMPLE SEARCHES ARE MORE EFFICIENTLY DONE WITH SUPERC OR
//*      THE SEARCH AND REPLACE UTILITY.
//*
//*  - CHANGE THE JOBNAME IF REQUIRED
//*  - CHANGE THE TO DSN AND MEMBER IF REQUIRED
//*  - CHANGE THE BSTIPT01 INPUT CARDS
//*
//*  - DETAILS AND MORE OPTIONS CAN BE FOUND IN THE SCL MANUAL
//*
//NDVRBAT  EXEC PGM=NDVRC1,DYNAMNBR=1500,PARM='C1BM3000'
//BSTIPT01 DD *
LIST ELEMENTS *
  FROM ENV PROD SYS '  ' SUB '   ' TYPE '       ' STAGE P
  TO DSN '&ZPREFIX..&SYSUID..SCL' MEM LISTSCL
* - THE WHERE STATEMENT IS OPTIONAL
*  WHERE -WHERE-OPTIONS-IF-REQUIRED--SEE-BELOW-
* - THE BUILD STATEMENT IS OPTIONAL
*  BUILD ACTION RETRIEVE LEVEL NONE
   OPTIONS
          REPLACE MEMBER
   .
*  OPTIONS REPLACE MEMBER SEARCH SHOW TEXT
*  WHERE GENERATE THRU DATE 08/30/98
*  WHERE GENERATE DATE 08/30/98
*  WHERE GENERATE FAILED
*  WHERE TEXT = 'PROGRAM1'
*  WHERE TEXT (( = 'PROGRAM1') OR
*              ( = 'PROGRAM2'))
*  WHERE PROCESSOR GROUP = 'XAXXXRNX'
*  WHERE CCID OF CURRENT = '-CCID-'
*  BUILD ACTION GENERATE LEVEL NONE
/*
//APIPRINT DD SYSOUT=Z
//HLAPILOG DD SYSOUT=*
//C1MSGS1  DD SYSOUT=*
//C1MSGS2  DD SYSOUT=*
//C1PRINT  DD SYSOUT=*,RECFM=FBA,LRECL=133
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=C
//SYSOUT   DD SYSOUT=*
//SYMDUMP  DD DUMMY
