&C1BJC1
&C1BJC2
&C1BJC3
&C1BJC4
//*
//* PACKAGE UTILITY - &ACTION
//*
//ENBP1000 EXEC PGM=NDVRC1,PARM=ENBP1000,DYNAMNBR=1500
//C1MSGS1  DD SYSOUT=*
//C1MSGS2  DD SYSOUT=*
//APIPRINT DD SYSOUT=Z
//SYSABEND DD SYSOUT=C
//ENPSCLIN DD *
&SCL1
&SCL2
/*
