//ALLOCS   EXEC PGM=IEFBR14                                             00010000
//*                                                                     00020000
)DOT PPCTABA                                                            00030003
//&TYPE    DD DSN=&TRGTDSN,                                             00040000
//         DISP=(,CATLG),                                               00050000
//         LIKE=&PRODDSN                                                00060000
//*                                                                     00070000
)ENDDOT                                                                 00080000
