//STEP010  EXEC PGM=IEBCOPY
//FCOPYON  DD   DUMMY
//SYSPRINT DD   SYSOUT=*
//SYSUT3   DD   UNIT=DASD,SPACE=(TRK,(5,5))
//SYSUT4   DD   UNIT=DASD,SPACE=(TRK,(5,5))
//OAR003    DD DISP=SHR,DSN=PREV.DEKM.LOAD
 EDITDIR OUTDD=OAR003
 DELETE    MEMBER=EWCOBB2
