//TTMTPRO4 JOB 0,'PRO IV / ENDEVOR',NOTIFY=&UID,MSGCLASS=0,CLASS=3
//*
//* THIS ELEMENT IS PROIVS10 IN THE EV SYSTEM TYPE SKELS
//*
//*********************************************************************
//*  LIST ALL PRO4 ELEMENTS WITH A SPECIFIED CCID                     *
//*********************************************************************
//NDVRLIST EXEC PGM=NDVRC1,DYNAMNBR=1500,PARM='C1BM3000'
//PSPOFF   DD DUMMY
//C1SORTIO DD SPACE=(CYL,(50,50)),RECFM=VB,LRECL=32760
//APIPRINT DD SYSOUT=Z
//HLAPILOG DD SYSOUT=*
//C1MSGS1  DD SYSOUT=*
//C1MSGS2  DD SYSOUT=*
//C1PRINT  DD SYSOUT=*,RECFM=FBA,LRECL=133
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=C
//SYSOUT   DD SYSOUT=*
//SYMDUMP  DD DUMMY
//FUNOUT   DD DSN=&&&&FUNLIST,DISP=(,PASS),
//             SPACE=(TRK,(15,15),RLSE),
//             RECFM=FBA,LRECL=133
//FILOUT   DD DSN=&&&&FILLIST,DISP=(,PASS),
//             SPACE=(TRK,(15,15),RLSE),
//             RECFM=FBA,LRECL=133
//GLGOUT   DD DSN=&&&&GLGLIST,DISP=(,PASS),
//             SPACE=(TRK,(15,15),RLSE),
//             RECFM=FBA,LRECL=133
//INTOUT   DD DSN=&&&&INTLIST,DISP=(,PASS),
//             SPACE=(TRK,(15,15),RLSE),
//             RECFM=FBA,LRECL=133
//GMSOUT   DD DSN=&&&&GMSLIST,DISP=(,PASS),
//             SPACE=(TRK,(15,15),RLSE),
//             RECFM=FBA,LRECL=133
//BSTIPT01 DD *
LIST ELEMENT '*'
  FROM ENVIRONMENT '&ENV' SYSTEM 'MT' SUBSYSTEM '&C1SUB'
    TYPE 'FUN&PROIVAPP' STAGE &SID
  TO DDN FUNOUT
  WHERE CCID EQ '&C1CCID'
  OPTIONS NOSEARCH
 .
LIST ELEMENT '*'
  FROM ENVIRONMENT '&ENV' SYSTEM 'MT' SUBSYSTEM '&C1SUB'
    TYPE 'FIL&PROIVAPP' STAGE &SID
  TO DDN FILOUT
  WHERE CCID EQ '&C1CCID'
  OPTIONS NOSEARCH
 .
LIST ELEMENT '*'
  FROM ENVIRONMENT '&ENV' SYSTEM 'MT' SUBSYSTEM '&C1SUB'
    TYPE 'GLG&PROIVAPP' STAGE &SID
  TO DDN GLGOUT
  WHERE CCID EQ '&C1CCID'
  OPTIONS NOSEARCH
 .
LIST ELEMENT '*'
  FROM ENVIRONMENT '&ENV' SYSTEM 'MT' SUBSYSTEM '&C1SUB'
    TYPE 'INT&PROIVAPP' STAGE &SID
  TO DDN INTOUT
  WHERE CCID EQ '&C1CCID'
  OPTIONS NOSEARCH
 .
LIST ELEMENT '*'
  FROM ENVIRONMENT '&ENV' SYSTEM 'MT' SUBSYSTEM '&C1SUB'
    TYPE 'GMS&PROIVAPP' STAGE &SID
  TO DDN GMSOUT
  WHERE CCID EQ '&C1CCID'
  OPTIONS NOSEARCH
 .
/*
//CHECKIT  IF NDVRLIST.RC GT 4 THEN
//*
//SPWARN   EXEC @SPWARN
//CHECKIT  ENDIF
//*
//CHECKIT  IF NDVRLIST.RC LE 4 THEN
//*********************************************************************
//*  BUILD PRO4 PARMS TO BE ADDED TO ENDEVOR                          *
//*********************************************************************
//JSTEP010 EXEC PGM=IKJEFT1B,DYNAMNBR=40,
//             PARM='ISPSTART CMD(%PROIVPRM &PROIVAPP.&DELTYPE)'
//STEPLIB  DD DSN=SYS1.ISPLOAD,DISP=SHR
//SYSPROC  DD DISP=SHR,DSN=PGEV.BASE.ISPCLIB
//SYSEXEC  DD DISP=SHR,DSN=PGEV.BASE.ISPCLIB
//ISPPROF  DD DSN=&&&&ISPPROF,DISP=(,PASS),
//             SPACE=(TRK,(15,15,44),RLSE),
//             RECFM=FB,LRECL=80
//ISPSLIB  DD DSN=PGEV.BASE.ISPSLIB,DISP=SHR
//         DD DSN=SYS1.SISPSLIB,DISP=SHR
//         DD DSN=SYS1.SISFSLIB,DISP=SHR
//ISPPLIB  DD DSN=SYS1.SISPPENU,DISP=SHR
//         DD DSN=SYS1.SISFPLIB,DISP=SHR
//ISPLLIB  DD DSN=SYS1.ISPLOAD,DISP=SHR
//ISPMLIB  DD DSN=SYS1.SISPMENU,DISP=SHR
//ISPTLIB  DD DSN=SYS1.SISPTENU,DISP=SHR
//ISPTABL  DD DSN=SYS1.SISPTENU,DISP=SHR
//ISPFILE  DD DSN=&&&&PARMS,DISP=(NEW,PASS),
//             SPACE=(TRK,(15,15,44),RLSE),
//             LRECL=80,RECFM=FB
//FUNOUT   DD DSN=&&&&FUNLIST,DISP=(OLD,DELETE)
//FILOUT   DD DSN=&&&&FILLIST,DISP=(OLD,DELETE)
//GLGOUT   DD DSN=&&&&GLGLIST,DISP=(OLD,DELETE)
//INTOUT   DD DSN=&&&&INTLIST,DISP=(OLD,DELETE)
//GMSOUT   DD DSN=&&&&GMSLIST,DISP=(OLD,DELETE)
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSTSIN  DD DUMMY
//SYSIN    DD DUMMY
//*
//CHECKIT  ENDIF
//*
//CHECKIT  IF JSTEP010.RC NE 0 THEN
//*
//SPWARN   EXEC @SPWARN
//CHECKIT  ENDIF
//*
//*********************************************************************
//*  CREATE A COPY OF THE PRODUCTION BOOTSTRAP FILES                  *
//*********************************************************************
//JSTEP020 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
 DELETE TTMT.PRO4.&DELTYPE..&PROIVAPP..DEVELOP CLUSTER PURGE
 DELETE TTMT.PRO4.&DELTYPE..&PROIVAPP..EXEC    CLUSTER PURGE
 DELETE TTMT.PRO4.&DELTYPE..&PROIVAPP..GENFILE CLUSTER PURGE
 SET MAXCC = 0
 DEFINE CLUSTER                                             -
       (NAME(TTMT.PRO4.&DELTYPE..&PROIVAPP..DEVELOP)        -
        MODEL(PRMT.PRO4.PRODEV.&PROIVAPP..DEVELOP))         -
     DATA                                                   -
        (NAME(TTMT.PRO4.&DELTYPE..&PROIVAPP..DEVELOP.DATA) -
         MODEL(PRMT.PRO4.PRODEV.&PROIVAPP..DEVELOP.DATA))   -
     INDEX                                                  -
        (NAME(TTMT.PRO4.&DELTYPE..&PROIVAPP..DEVELOP.INDEX) -
         MODEL(PRMT.PRO4.PRODEV.&PROIVAPP..DEVELOP.INDEX))

  DEFINE CLUSTER                                            -
        (NAME(TTMT.PRO4.&DELTYPE..&PROIVAPP..EXEC)          -
         MODEL(PRMT.PRO4.PRODEV.&PROIVAPP..EXEC))           -
     DATA                                                   -
        (NAME(TTMT.PRO4.&DELTYPE..&PROIVAPP..EXEC.DATA)     -
         MODEL(PRMT.PRO4.PRODEV.&PROIVAPP..EXEC.DATA))      -
     INDEX                                                  -
        (NAME(TTMT.PRO4.&DELTYPE..&PROIVAPP..EXEC.INDEX)    -
         MODEL(PRMT.PRO4.PRODEV.&PROIVAPP..EXEC.INDEX))

  DEFINE CLUSTER                                            -
        (NAME(TTMT.PRO4.&DELTYPE..&PROIVAPP..GENFILE)       -
         MODEL(PRMT.PRO4.PRODEV.&PROIVAPP..GENFILE))        -
     DATA                                                   -
        (NAME(TTMT.PRO4.&DELTYPE..&PROIVAPP..GENFILE.DATA) -
         MODEL(PRMT.PRO4.PRODEV.&PROIVAPP..GENFILE.DATA))   -
     INDEX                                                  -
        (NAME(TTMT.PRO4.&DELTYPE..&PROIVAPP..GENFILE.INDEX) -
         MODEL(PRMT.PRO4.PRODEV.&PROIVAPP..GENFILE.INDEX))
/*
//CHECKIT  IF JSTEP020.RC NE 0 THEN
//*
//SPWARN   EXEC @SPWARN
//CHECKIT  ENDIF
//*
//*********************************************************************
//*  INITIALISE DEVELOP BOOTSTRAP FILE                                *
//*********************************************************************
//JSTEP030 EXEC PGM=SFINITA,PARM=PHYSICAL
//STEPLIB  DD DSN=TTMT.PRO4V40.LOAD,DISP=SHR
//PRINTR   DD SYSOUT=*
//SYSFILE  DD DSN=TTMT.PRO4.&DELTYPE..&PROIVAPP..DEVELOP,DISP=SHR
//*
//CHECKIT  IF JSTEP030.RC NE 0 THEN
//*
//SPWARN   EXEC @SPWARN
//CHECKIT  ENDIF
//*
//*********************************************************************
//*  INITIALISE EXEC BOOTSTRAP FILE                                   *
//*********************************************************************
//JSTEP040 EXEC PGM=SFINITA,PARM=PHYSICAL
//STEPLIB  DD DSN=TTMT.PRO4V40.LOAD,DISP=SHR
//PRINTR   DD SYSOUT=*
//SYSFILE  DD DSN=TTMT.PRO4.&DELTYPE..&PROIVAPP..EXEC,DISP=SHR
//*
//CHECKIT  IF JSTEP040.RC NE 0 THEN
//*
//SPWARN   EXEC @SPWARN
//CHECKIT  ENDIF
//*
//*********************************************************************
//*  INITIALISE GENFILE BOOTSTRAP FILE                                *
//*********************************************************************
//JSTEP050 EXEC PGM=SFINITA,PARM=PHYSICAL
//STEPLIB  DD DSN=TTMT.PRO4V40.LOAD,DISP=SHR
//PRINTR   DD SYSOUT=*
//SYSFILE  DD DSN=TTMT.PRO4.&DELTYPE..&PROIVAPP..GENFILE,DISP=SHR
//*
//CHECKIT  IF JSTEP050.RC NE 0 THEN
//*
//SPWARN   EXEC @SPWARN
//CHECKIT  ENDIF
//*
//*********************************************************************
//*  APPLY BOOTSTRAP CHANGES TO PRODUCTION COPY FILES                 *
//*********************************************************************
//JSTEP060 EXEC PGM=PROUTVV
//STEPLIB  DD DSN=TTMT.PRO4V40.LOAD,DISP=SHR
//PROXECI  DD DSN=PREV.&STG.&C1SUB..&PROIVAPP..EXEC,DISP=SHR
//PRODEVI  DD DSN=PREV.&STG.&C1SUB..&PROIVAPP..DEVELOP,DISP=SHR
//GENFILI  DD DSN=PREV.&STG.&C1SUB..&PROIVAPP..GENFILE,DISP=SHR
//PROXECO  DD DSN=TTMT.PRO4.&DELTYPE..&PROIVAPP..EXEC,DISP=SHR
//PRODEVO  DD DSN=TTMT.PRO4.&DELTYPE..&PROIVAPP..DEVELOP,DISP=SHR
//GENFILO  DD DSN=TTMT.PRO4.&DELTYPE..&PROIVAPP..GENFILE,DISP=SHR
//PRINTR   DD SYSOUT=*
//SYSIN    DD DSN=&&&&PARMS(&PROIVAPP.&DELTYPE),DISP=(OLD,PASS)
//*
//CHECKIT  IF JSTEP060.RC GT 4 THEN
//*
//SPWARN   EXEC @SPWARN
//CHECKIT  ENDIF
//*
//*********************************************************************
//*  EXPORT BOOTSTRAP FILES TO A SINGLE PDS MEMBER FOR DEV DELIVERY   *
//*********************************************************************
//JSTEP070 EXEC PGM=GVEXPORT,
//             COND=(4,LT,JSTEP050)
//SYSPRINT DD SYSOUT=*
//SNAPDD   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//*    DO NOT DELETE THE BLKSIZE PARM, FAVER WILL OVERRIDE
//*    LRECL IF YOU DO
//FVROUT0  DD DSN=&&&&BOOTS(&PROIVAPP.&DELTYPE),DISP=(NEW,PASS),
//             SPACE=(CYL,(30,30,44),RLSE),
//             RECFM=VB,LRECL=23468,BLKSIZE=23472
//SYSIN    DD *
EXPORT HSM EXO
CLUSTER
 CL=TTMT.PRO4.&DELTYPE..&PROIVAPP..EXEC
 CL=TTMT.PRO4.&DELTYPE..&PROIVAPP..GENFILE
 CL=TTMT.PRO4.&DELTYPE..&PROIVAPP..DEVELOP
/*
//CHECKIT  IF JSTEP070.RC GT 4 THEN
//*
//SPWARN   EXEC @SPWARN
//CHECKIT  ENDIF
//*
//*********************************************************************
//*  COPY COMPRESSED BOOTSTRAP TO A CATALOGED DATASET                 *
//*********************************************************************
//JSTEP080 EXEC PGM=IEBCOPY
//FCOPYON  DD DUMMY
//SYSPRINT DD SYSOUT=*
//PDSIN    DD DSN=&&&&BOOTS,DISP=(OLD,DELETE)
//PDSOUT   DD DSN=TTMT.&UID..BOOTS,DISP=(NEW,CATLG),
//             SPACE=(CYL,(150,50,15),RLSE),
//             RECFM=VB,LRECL=23468,BLKSIZE=23472
//SYSUT3   DD SPACE=(CYL,(30,30),RLSE)
//SYSUT4   DD SPACE=(CYL,(30,30),RLSE)
//SYSIN    DD *
  COPY OUTDD=PDSOUT,INDD=((PDSIN,R))
/*
//CHECKIT  IF JSTEP080.RC GT 0 THEN
//*
//SPWARN   EXEC @SPWARN
//CHECKIT  ENDIF
//*
//*********************************************************************
//*  ADD PARMS AND BOOTS TO ENDEVOR                                   *
//*********************************************************************
//NDVRADD  EXEC PGM=NDVRC1,DYNAMNBR=1500,PARM='C1BM3000'
//PSPOFF   DD DUMMY
//C1SORTIO DD SPACE=(CYL,(50,50)),RECFM=VB,LRECL=32760
//APIPRINT DD SYSOUT=Z
//HLAPILOG DD SYSOUT=*
//C1MSGS1  DD SYSOUT=*
//C1MSGS2  DD SYSOUT=*
//C1PRINT  DD SYSOUT=*,RECFM=FBA,LRECL=133
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=C
//SYSOUT   DD SYSOUT=*
//SYMDUMP  DD DUMMY
//BOOTS    DD DSN=PREV.PEV1.DATA,DISP=SHR
//PARMS    DD DSN=&&&&PARMS,DISP=(OLD,DELETE)
//BSTIPT01 DD *
ADD ELEMENT '&PROIVAPP.&DELTYPE'
  FROM DSNAME 'PREV.PEV1.DATA' MEMBER 'BIND'
  TO   ENVIRONMENT '&ENV' SYSTEM 'MT' SUBSYSTEM '&C1SUB'
    TYPE 'BOOTS'
  OPTIONS CCID '&C1CCID' COMMENTS "ADD BOOTSTRAP FILE"
  PROCESSOR GROUP = 'NDVRPRO4' UPDATE OVE
 .
ADD ELEMENT '&PROIVAPP.&DELTYPE'
  FROM DDN PARMS
  TO   ENVIRONMENT '&ENV' SYSTEM 'MT' SUBSYSTEM '&C1SUB'
    TYPE 'PARM'
  OPTIONS CCID '&C1CCID' COMMENTS "ADD BOOTSTRAP FILE"
  UPDATE OVE
 .
/*
//CHECKIT  IF NDVRADD.RC GT 4 THEN
//*
//SPWARN   EXEC @SPWARN
//CHECKIT  ENDIF
//*
)SEL &PKGTYP = STANDARD
//*********************************************************************
//*  MOVE ELEMENTS TO ACPT STAGE F                                    *
//*********************************************************************
//NDVRMOVE EXEC PGM=NDVRC1,DYNAMNBR=1500,PARM='C1BM3000'
//PSPOFF   DD DUMMY
//C1SORTIO DD SPACE=(CYL,(50,50)),RECFM=VB,LRECL=32760
//APIPRINT DD SYSOUT=Z
//HLAPILOG DD SYSOUT=*
//C1MSGS1  DD SYSOUT=*
//C1MSGS2  DD SYSOUT=*
//C1PRINT  DD SYSOUT=*,RECFM=FBA,LRECL=133
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=C
//SYSOUT   DD SYSOUT=*
//SYMDUMP  DD DUMMY
//BSTIPT01 DD *
MOVE ELEMENT '&PROIVAPP.&DELTYPE'
  FROM ENVIRONMENT '&ENV' SYSTEM 'MT' SUBSYSTEM '&C1SUB'
    TYPE 'BOOTS' STAGE E
  OPTIONS CCID '&C1CCID' COMMENTS "PRO4 PROMOTE TO F"
  RETAIN SIGNOUT
 .
MOVE ELEMENT '&PROIVAPP.&DELTYPE'
  FROM ENVIRONMENT '&ENV' SYSTEM 'MT' SUBSYSTEM '&C1SUB'
    TYPE 'PARM' STAGE E
  OPTIONS CCID '&C1CCID' COMMENTS "PRO4 PROMOTE TO F"
  SYNC RETAIN SIGNOUT
 .
/*
//CHECKIT  IF NDVRMOVE.RC GT 4 THEN
//*
//SPWARN   EXEC @SPWARN
//CHECKIT  ENDIF
)ENDSEL
//*
//JSTEP090 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
 DELETE TTMT.&UID..&SLQ..TEMP1 PURGE
 DELETE TTMT.&UID..BOOTS PURGE
 SET MAXCC = 0
/*
//CHECKIT  IF JSTEP090.RC GT 0 THEN
//*
//SPWARN   EXEC @SPWARN
//CHECKIT  ENDIF
//*
