./ ENDUP
/*
//CHECKIT  IF JSTEP010.RC NE 0 THEN
//*
//JSTEP020 EXEC @SPWARN
//CHECKIT  ENDIF
//*
//NDVRADD  EXEC PGM=NDVRC1,DYNAMNBR=1500,PARM='C1BM3000'
//SYSPRINT DD SYSOUT=*
//C1TPDD01 DD SPACE=(CYL,5),RECFM=VB,LRECL=260
//C1TPDD02 DD SPACE=(CYL,5),RECFM=VB,LRECL=260
//C1TPLSIN DD SPACE=(CYL,5),RECFM=FB,LRECL=80
//C1TPLSOU DD SPACE=(CYL,5)
//C1PLMSGS DD SYSOUT=*
//APIPRINT DD SYSOUT=Z
//HLAPILOG DD SYSOUT=*
//C1MSGS1  DD SYSOUT=*
//C1MSGS2  DD SYSOUT=*
//C1PRINT  DD SYSOUT=*,RECFM=FBA,LRECL=121
//SYSABEND DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//BSTIPT01 DD *
