//&PREF.PRO4 JOB 'RBS INS PRO-IV',NOTIFY=&UID,CLASS=3,MSGCLASS=0
//*
//*********************************************************************
//*  ALLOCATE TEMPORARY BOOTSTRAP FILES
//*********************************************************************
//STEP010  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
 DELETE TTYY.PRO4.&C1CCID..&PROIVAPP..DEVELO&DSUF CLUSTER PURGE
 DELETE TTYY.PRO4.&C1CCID..&PROIVAPP..GENFIL&GSUF CLUSTER PURGE
 DELETE TTYY.PRO4.&C1CCID..&PROIVAPP..EXE&ESUF    CLUSTER PURGE
)SEL &PROIVAPP = LIFE
 DELETE TTYY.&UID..&C1CCID..BOOTSL            PURGE
)ENDSEL
)SEL &PROIVAPP = LOAN
 DELETE TTYY.&UID..&C1CCID..BOOTSP            PURGE
)ENDSEL
)SEL &PROIVAPP = SAVG
 DELETE TTYY.&UID..&C1CCID..BOOTSS            PURGE
)ENDSEL
)SEL &PROIVAPP = CALL
 DELETE TTYY.&UID..&C1CCID..BOOTSX            PURGE
)ENDSEL
 SET MAXCC = 0
 DEFINE CLUSTER                                      -
        (NAME(TTYY.PRO4.&C1CCID..&PROIVAPP..DEVELO&DSUF)       -
          MODEL(PREV.MODEL.DEVELOP))                 -
     DATA                                            -
        (NAME(TTYY.PRO4.&C1CCID..&PROIVAPP..DEVELO&DSUF..DATA)  -
         MODEL(PREV.MODEL.DEVELOP.DATA))             -
     INDEX                                           -
        (NAME(TTYY.PRO4.&C1CCID..&PROIVAPP..DEVELO&DSUF..INDEX) -
         MODEL(PREV.MODEL.DEVELOP.INDEX))

 DEFINE CLUSTER                                      -
        (NAME(TTYY.PRO4.&C1CCID..&PROIVAPP..GENFIL&GSUF)       -
         MODEL(PREV.MODEL.GENFILE))                  -
     DATA                                            -
        (NAME(TTYY.PRO4.&C1CCID..&PROIVAPP..GENFIL&GSUF..DATA)  -
         MODEL(PREV.MODEL.GENFILE.DATA))             -
     INDEX                                           -
        (NAME(TTYY.PRO4.&C1CCID..&PROIVAPP..GENFIL&GSUF..INDEX) -
         MODEL(PREV.MODEL.GENFILE.INDEX))

 DEFINE CLUSTER                                      -
        (NAME(TTYY.PRO4.&C1CCID..&PROIVAPP..EXE&ESUF)          -
         MODEL(PREV.MODEL.EXEC))                     -
     DATA                                            -
        (NAME(TTYY.PRO4.&C1CCID..&PROIVAPP..EXE&ESUF..DATA)     -
         MODEL(PREV.MODEL.EXEC.DATA))                -
     INDEX                                           -
        (NAME(TTYY.PRO4.&C1CCID..&PROIVAPP..EXE&ESUF..INDEX)    -
         MODEL(PREV.MODEL.EXEC.INDEX))
/*
//*********************************************************************
//*  INITIALISE DEVELO&DSUF BOOTSTRAP FILE
//*********************************************************************
//STEP020  EXEC PGM=SFINITA,PARM=PHYSICAL,
//             COND=(0,NE,STEP010)
//STEPLIB  DD DSN=PREV.PROIV.BATCH.LOADLIB,DISP=SHR
//PRINTR   DD SYSOUT=*
//SYSFILE  DD DSN=TTYY.PRO4.&C1CCID..&PROIVAPP..DEVELO&DSUF,DISP=SHR
//*
//*********************************************************************
//*  INITIALISE EXEC BOOTSTRAP FILE
//*********************************************************************
//STEP030  EXEC PGM=SFINITA,PARM=PHYSICAL,
//             COND=(0,NE,STEP020)
//STEPLIB  DD DSN=PREV.PROIV.BATCH.LOADLIB,DISP=SHR
//PRINTR   DD SYSOUT=*
//SYSFILE  DD DSN=TTYY.PRO4.&C1CCID..&PROIVAPP..EXE&ESUF,DISP=SHR
//*
//*********************************************************************
//*  INITIALISE GENFIL&GSUF BOOTSTRAP FILE
//*********************************************************************
//STEP040  EXEC PGM=SFINITA,PARM=PHYSICAL,
//             COND=(0,NE,STEP030)
//STEPLIB  DD DSN=PREV.PROIV.BATCH.LOADLIB,DISP=SHR
//PRINTR   DD SYSOUT=*
//SYSFILE  DD DSN=TTYY.PRO4.&C1CCID..&PROIVAPP..GENFIL&GSUF,DISP=SHR
//*
//*********************************************************************
//*  EXTRACT COMPONENTS LISTED IN CONTROL MEMBER FROM SOURCE PRO-IV
//*  FILES AND COPY INTO (EMPTY) STAGING PRO-IV
//*********************************************************************
//STEP050  EXEC PGM=PROUTVV,
//             COND=(0,NE,STEP040)
//STEPLIB  DD DSN=PREV.PROIV.BATCH.LOADLIB,DISP=SHR
)SEL &PROIVAPP = LIFE AND &C1SUB = LNA
//PROXECI  DD DSN=TTLL.Z3.VPROIV.EXE&ESUF,DISP=SHR
//PRODEVI  DD DSN=TTLL.Z3.VPROIV.DEVELO&DSUF,DISP=SHR
//GENFILI  DD DSN=TTLL.Z3.VPROIV.GENFIL&GSUF,DISP=SHR
)ENDSEL
)SEL &PROIVAPP = LIFE AND &C1SUB ^= LNA
//PROXECI  DD DSN=TTLL.Z1.VPROIV.EXE&ESUF,DISP=SHR
//PRODEVI  DD DSN=TTLL.Z1.VPROIV.DEVELO&DSUF,DISP=SHR
//GENFILI  DD DSN=TTLL.Z1.VPROIV.GENFIL&GSUF,DISP=SHR
)ENDSEL
)SEL &PROIVAPP = LOAN
//PROXECI  DD DSN=TTLZ.Z3.VPROIV.EXE&ESUF,DISP=SHR
//PRODEVI  DD DSN=TTLZ.Z3.VPROIV.DEVELO&DSUF,DISP=SHR
//GENFILI  DD DSN=TTLZ.Z3.VPROIV.GENFIL&GSUF,DISP=SHR
)ENDSEL
)SEL &PROIVAPP = SAVG
//PROXECI  DD DSN=TTLZ.Z3.VPROIV.EXES,DISP=SHR
//PRODEVI  DD DSN=TTLZ.Z3.VPROIV.DEVELOS,DISP=SHR
//GENFILI  DD DSN=TTLZ.Z3.VPROIV.GENFILS,DISP=SHR
)ENDSEL
)SEL &PROIVAPP = CALL
//PROXECI  DD DSN=TTLZ.Z3.VPROIV.EXEX,DISP=SHR
//PRODEVI  DD DSN=TTLZ.Z3.VPROIV.DEVELOX,DISP=SHR
//GENFILI  DD DSN=TTLZ.Z3.VPROIV.GENFILX,DISP=SHR
)ENDSEL
//PROXECO  DD DSN=TTYY.PRO4.&C1CCID..&PROIVAPP..EXE&ESUF,DISP=SHR
//PRODEVO  DD DSN=TTYY.PRO4.&C1CCID..&PROIVAPP..DEVELO&DSUF,DISP=SHR
//GENFILO  DD DSN=TTYY.PRO4.&C1CCID..&PROIVAPP..GENFIL&GSUF,DISP=SHR
//PRINTR   DD SYSOUT=*
//SYSIN    DD DSN=&CNTLDSN(&C1CCID),DISP=SHR
//*
//GENER01  EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD *
 DUMMY ELEMENT FOR PRO-IV BOOTSTRAP FILES FOR &C1CCID
/*
)SEL &PROIVAPP = LIFE
//SYSUT2   DD DSN=TTYY.&UID..&C1CCID..BOOTSL,DISP=(NEW,CATLG),
//             SPACE=(TRK,(3,3)),RECFM=FB,LRECL=80
)ENDSEL
)SEL &PROIVAPP = LOAN
//SYSUT2   DD DSN=TTYY.&UID..&C1CCID..BOOTSP,DISP=(NEW,CATLG),
//             SPACE=(TRK,(3,3)),RECFM=FB,LRECL=80
)ENDSEL
)SEL &PROIVAPP = SAVG
//SYSUT2   DD DSN=TTYY.&UID..&C1CCID..BOOTSS,DISP=(NEW,CATLG),
//             SPACE=(TRK,(3,3)),RECFM=FB,LRECL=80
)ENDSEL
)SEL &PROIVAPP = CALL
//SYSUT2   DD DSN=TTYY.&UID..&C1CCID..BOOTSX,DISP=(NEW,CATLG),
//             SPACE=(TRK,(3,3)),RECFM=FB,LRECL=80
)ENDSEL
//SYSIN    DD DUMMY
//*********************************************************************
//*  ADD PARMS AND BOOTS TO ENDEVOR
//*********************************************************************
//STEP080  EXEC PGM=NDVRC1,DYNAMNBR=1500,
//             PARM='C1BM3000',COND=(4,LT,STEP050)
//SYSPRINT DD SYSOUT=*
//C1TPDD01 DD SPACE=(CYL,5),
//             RECFM=VB,LRECL=260
//C1TPDD02 DD SPACE=(CYL,5),
//             RECFM=VB,LRECL=260
//C1TPLSIN DD SPACE=(CYL,5),
//             RECFM=FB,LRECL=80
//C1TPLSOU DD SPACE=(CYL,5)
//C1PLMSGS DD SYSOUT=*
//APIPRINT DD SYSOUT=Z
//HLAPILOG DD SYSOUT=*
//C1MSGS1  DD SYSOUT=*
//C1MSGS2  DD SYSOUT=*
//C1PRINT  DD SYSOUT=*,RECFM=FBA,LRECL=121
//SYSABEND DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//PARMS    DD DSN=&CNTLDSN(&C1CCID),DISP=SHR
//BSTIPT01 DD *
ADD ELEMENT '&C1CCID'
)SEL &PROIVAPP = LIFE
  FROM DSNAME 'TTYY.&UID..&C1CCID..BOOTSL'
)ENDSEL
)SEL &PROIVAPP = LOAN
  FROM DSNAME 'TTYY.&UID..&C1CCID..BOOTSP'
)ENDSEL
)SEL &PROIVAPP = SAVG
  FROM DSNAME 'TTYY.&UID..&C1CCID..BOOTSS'
)ENDSEL
)SEL &PROIVAPP = CALL
  FROM DSNAME 'TTYY.&UID..&C1CCID..BOOTSX'
)ENDSEL
       MEMBER '&C1CCID'
  TO   ENVIRONMENT '&ENV' SYSTEM '&C1SY' SUBSYSTEM '&C1SUB'
)SEL &PROIVAPP = LIFE
       TYPE 'BOOTSL'
)ENDSEL
)SEL &PROIVAPP = LOAN
       TYPE 'BOOTSP'
)ENDSEL
)SEL &PROIVAPP = SAVG
       TYPE 'BOOTSS'
)ENDSEL
)SEL &PROIVAPP = CALL
       TYPE 'BOOTSX'
)ENDSEL
  OPTIONS CCID '&C1CCID' COMMENTS "ADD BOOTSTRAP FILE"
  PROCESSOR GROUP = 'NDVRPRO4' UPDATE OVE
 .
ADD ELEMENT '&C1CCID'
  FROM DDN PARMS
  TO   ENVIRONMENT '&ENV' SYSTEM '&C1SY' SUBSYSTEM '&C1SUB'
)SEL &PROIVAPP = LIFE
       TYPE 'PARML'
)ENDSEL
)SEL &PROIVAPP = LOAN
       TYPE 'PARMP'
)ENDSEL
)SEL &PROIVAPP = SAVG
       TYPE 'PARMS'
)ENDSEL
)SEL &PROIVAPP = CALL
       TYPE 'PARMX'
)ENDSEL
  OPTIONS CCID '&C1CCID' COMMENTS "ADD PROIV PARM FILE"
  UPDATE OVE
 .
/*
//STEP090  EXEC PGM=IDCAMS,COND=(4,LT,STEP080)
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
)SEL &PROIVAPP = LIFE
 DELETE TTYY.&UID..&C1CCID..BOOTSL            PURGE
 DELETE TTYY.PRO4.&C1CCID..&PROIVAPP..DEVELO&DSUF CLUSTER PURGE
 DELETE TTYY.PRO4.&C1CCID..&PROIVAPP..EXE&ESUF    CLUSTER PURGE
 DELETE TTYY.PRO4.&C1CCID..&PROIVAPP..GENFIL&GSUF CLUSTER PURGE
)ENDSEL
)SEL &PROIVAPP = LOAN
 DELETE TTYY.&UID..&C1CCID..BOOTSP            PURGE
 DELETE TTYY.PRO4.&C1CCID..&PROIVAPP..DEVELO&DSUF CLUSTER PURGE
 DELETE TTYY.PRO4.&C1CCID..&PROIVAPP..EXE&ESUF    CLUSTER PURGE
 DELETE TTYY.PRO4.&C1CCID..&PROIVAPP..GENFIL&GSUF CLUSTER PURGE
)ENDSEL
)SEL &PROIVAPP = SAVG
 DELETE TTYY.&UID..&C1CCID..BOOTSS            PURGE
 DELETE TTYY.PRO4.&C1CCID..&PROIVAPP..DEVELO&DSUF CLUSTER PURGE
 DELETE TTYY.PRO4.&C1CCID..&PROIVAPP..EXE&ESUF    CLUSTER PURGE
 DELETE TTYY.PRO4.&C1CCID..&PROIVAPP..GENFIL&GSUF CLUSTER PURGE
)ENDSEL
)SEL &PROIVAPP = CALL
 DELETE TTYY.&UID..&C1CCID..BOOTSX            PURGE
 DELETE TTYY.PRO4.&C1CCID..&PROIVAPP..DEVELO&DSUF CLUSTER PURGE
 DELETE TTYY.PRO4.&C1CCID..&PROIVAPP..EXE&ESUF    CLUSTER PURGE
 DELETE TTYY.PRO4.&C1CCID..&PROIVAPP..GENFIL&GSUF CLUSTER PURGE
)ENDSEL
/*
