//&JOBNAME JOB 0,CLASS=3,MSGCLASS=0,NOTIFY=&SYSUID
//*
//* THIS IS A SAMPLE JOB TO SEARCH THROUGH THE ENDEVOR INVENTORY AND
//* OPTIONALLY REPLACE STRINGS.
//* CHANGED ELEMENTS ARE COPIED TO STAGE 1 OF THE ENVIRONMENT SPECIFIED.
//*
//*  - CHANGE THE JOBNAME IF REQUIRED
//*  - CHANGE THE ENSSCLOT DATASET/MEMBER IF REQUIRED
//*  - CHANGE THE ENSSCLIN INPUT CARDS
//*  - THE INPUT CARDS INPUT CARDS ARE SET UP FOR SEARCH ONLY
//*
//SEARCH   EXEC PGM=NDVRC1,PARM='ENBS1000',DYNAMNBR=1600
//ENSSCLOT DD DISP=SHR,DSN=&ZPREFIX..&SYSUID..SCL(SRCHSCL)
//ENSSCLIN DD *
   SEARCH ELEMENT '* or name*'
     FROM ENVIRONMENT 'put the environment name here'
          SYSTEM 'put the system name here'
          SUBSYSTEM 'put the subsystem name here'
          TYPE 'put the type name here'
     FOR TEXT 'put the search string here'
*        REPLACE WITH TEXT 'put the replace string here (optional)'
     OPTIONS
             LIST DETAILS
             SEARCH ENVIRONMENT MAP
*            SEARCH ENVIRONMENT ONLY
*            CCID = '        '
*            COMMENT = '            '
*            DATA TRUNCATION IS PROHIBITED
*            OVERRIDE SIGNOUT
*            DATA TRUNCATION IS PROHIBITED
*            BYPASS GENERATE PROCESSOR
*            UPDATE ELEMENTS
     .
/*
//ENSMSGS1 DD SYSOUT=*
//SYSABEND DD SYSOUT=*
//ENSSPILL DD SPACE=(TRK,450),
//             DSORG=PS,RECFM=VB,LRECL=32004,BLKSIZE=32008
