//&JOBNAME JOB 0,CLASS=I,MSGCLASS=0,NOTIFY=&SYSUID
//*
//* THIS IS A SAMPLE JOB TO SEARCH THROUGH MULTIPLE STAGE P ENDEVOR
//* SOURCE LIBRARIES.
//*  - CHANGE THE JOBNAME IF REQUIRED
//*  - CHANGE THE NEWDD DATASET(S) - YOU CAN HAVE UP TO 255
//*  - CHANGE THE "SRCHFOR" STRING - YOU CAN HAVE MULTIPLE STRINGS
//*
//SEARCH  EXEC PGM=ISRSUPC,PARM=(SRCHCMP,'ANYC')
//NEWDD   DD DISP=SHR,DSN=PREV.PRG1.COPYBOOK   - COMMON COPYBOOKS
//        DD DISP=SHR,DSN=PREV.PRG1.MACRO      - COMMON MACROS
//*       DD DISP=SHR,DSN=PREV.P--1.COBOL
//*       DD DISP=SHR,DSN=PREV.P--1.COPYBOOK
//*       DD DISP=SHR,DSN=PREV.P--1.ASM
//*       DD DISP=SHR,DSN=PREV.P--1.COPYBOOK
//*       DD DISP=SHR,DSN=PREV.P--1.EASYTREV
//*       DD DISP=SHR,DSN=PREV.P--1.EASYMAC
//OUTDD   DD SYSOUT=*
//SYSIN   DD *
SRCHFOR 'IP-ADDR'
SRCHFOR 'VER'
/*
