)SEL &TYPE = DOC
)IM WALKSDOC
)ENDSEL
)SEL &TYPE = DOP
)IM WALKSDOP
)ENDSEL
)SEL &TYPE = FID
)IM WALKSFID
)ENDSEL
)SEL &TYPE = GMT
)IM WALKSGMT
)ENDSEL
)SEL &TYPE = MVT
)IM WALKSMVT
)ENDSEL
)SEL &TYPE = NAM
)IM WALKSNAM
)ENDSEL
)SEL &TYPE = RPT
)IM WALKSRPT
)ENDSEL
)SEL &TYPE = SCR
)IM WALKSSCR
)ENDSEL
)SEL &TYPE = TGS
)IM WALKSTGS
)ENDSEL
)SEL &TYPE = TID
)IM WALKSTID
)ENDSEL
)SEL &TYPE = VMS
)IM WALKSVMS
)ENDSEL
