//&JNAME   JOB CLASS=3,NOTIFY=&&SYSUID                                  JOB01546
//*
//STEP01   EXEC PGM=NDVRC1,PARM='ENTBJAPI',REGION=4096K
//SYSOUT   DD SYSOUT=Z
//SYSPRINT DD SYSOUT=Z
//BSTERR   DD SYSOUT=Z
//BSTAPI   DD SYSOUT=Z
//APIPRINT DD SYSOUT=Z
//MSGFILE  DD SYSOUT=Z,RECFM=FB,
//             LRECL=133,BLKSIZE=13300
//OUTFILE  DD SYSOUT=*,RECFM=VB,
//             LRECL=2048,BLKSIZE=22800
//SYSIN    DD *
AACTL MSGFILE OUTFILE
ALELMPAA UNIT                     &TELM
RUN
AACTLY
RUN
QUIT
/*
//
