//&JOBNAME. JOB 0,CLASS=3,MSGCLASS=X,NOTIFY=&&SYSUID
//*
//*  THIS JOB WILL:
//*  DELETE PACKAGE &CHANGE.P
//*  DELETE ALL ELEMENTS WITH A NAME OF &CHANGE IN SYSTEM &C1SYSTEM
//*         IN STAGES E,F OR O
//*
//WIZDLPKG EXEC PGM=NDVRC1,PARM=ENBP1000,DYNAMNBR=1500
//C1MSGS1  DD SYSOUT=*
//C1MSGS2  DD SYSOUT=*
//APIPRINT DD SYSOUT=Z
//HLAPILOG DD SYSOUT=*
//SYSABEND DD SYSOUT=C
//JCLOUT   DD SYSOUT=(A,INTRDR),LRECL=80,RECFM=F
//ENPSCLIN DD *
  DELETE PACKAGE  &CHANGE.P .
/*
//*
//WIZDLELM EXEC PGM=NDVRC1,DYNAMNBR=1500,PARM='C1BM3000'
//C1TPDD01 DD SPACE=(CYL,(1,1)),RECFM=VB,LRECL=260
//C1TPDD02 DD SPACE=(CYL,(1,1)),RECFM=VB,LRECL=260
//C1TPLSIN DD SPACE=(CYL,(1,1)),RECFM=FB,LRECL=80
//C1TPLSOU DD SPACE=(CYL,(1,1))
//C1PLMSGS DD SYSOUT=*
//C1MSGS1  DD SYSOUT=*
//C1MSGS2  DD SYSOUT=*
//APIPRINT DD SYSOUT=Z
//HLAPILOG DD SYSOUT=*
//SYSABEND DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//*-------------------------------------------------------------------*
//*  ENDEVOR CONTROL STATEMENTS                                       *
//*-------------------------------------------------------------------*
//BSTIPT01 DD *
DELETE ELEMENT '&CHANGE'
  FROM ENVIRONMENT 'ACPT' SYSTEM '&C1SYSTEM' SUBSYSTEM '&C1SYSTEM.1'
    TYPE * STAGE E
  OPTIONS CCID '&CHANGE' COMMENTS "TIDY UP" &OVER
 .
DELETE ELEMENT '&CHANGE'
  FROM ENVIRONMENT 'ACPT' SYSTEM '&C1SYSTEM' SUBSYSTEM '&C1SYSTEM.1'
    TYPE * STAGE F
  OPTIONS CCID '&CHANGE' COMMENTS "TIDY UP" &OVER
 .
DELETE ELEMENT '&CHANGE'
  FROM ENVIRONMENT 'PROD' SYSTEM '&C1SYSTEM' SUBSYSTEM '&C1SYSTEM.1'
    TYPE * STAGE O
  OPTIONS CCID '&CHANGE' COMMENTS "TIDY UP" &OVER
 .
