//*
//* THE FOLLOWING STEPS ARE INCLUDED:
//*
)SEL &SCLADD = Y
//* ADD      - ADD TO STAGE 1 OF ENVIRONMENT &C1ENV
)ENDSEL
)SEL &SCLMOV = Y
//* MOVE     - MOVE FROM ACPT STAGE E
)ENDSEL
)SEL &SCLPKG = Y
//* PACKAGE  - BUILD PACKAGE &CHANGE.P TO MOVE TO PROD STAGE P
//*          - CAST  PACKAGE
)ENDSEL
//*
