//*
//WIZPACK  EXEC PGM=NDVRC1,PARM=ENBP1000,DYNAMNBR=1500
//C1MSGS1  DD SYSOUT=*
//C1MSGS2  DD SYSOUT=*
//APIPRINT DD SYSOUT=Z
//HLAPILOG DD SYSOUT=*
//SYSABEND DD SYSOUT=C
//JCLOUT   DD SYSOUT=(A,INTRDR),LRECL=80,RECFM=F
//ENPSCLIN DD *
  DEFINE PACKAGE  &CHANGE.P
  DESCRIPTION "#"
  IMPORT SCL FROM DDNAME SCL DO NOT APPEND
  OPTIONS SHARABLE .
  CAST    PACKAGE &CHANGE.P .
/*
//SCL      DD *
