//&ZPREFIX.XP2P JOB CLASS=3,MSGCLASS=X,NOTIFY=&ZUSER
//*ROUTE XEQ RBJESQ1
//*
//* JOB TO EXPORT DDIO LISTING TO FLAT FILE AND SEND TO P SYSTEM
//*
//* STEPS
//* =====
//*
//* STEP: DELETE
//*       DELETE TEMP FILE IF IT EXISTS
//* STEP: EXPORT
//*       EXPORT LISTING TO FLAT FILE
//* STEP: CONNECT
//*       CONNECT DIRECT FLAT FILE TO PLEXP*
//*
//DELETE   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
 DELETE '&EXPORTDS' PURGE
 SET MAXCC = 0
/*
//*
//EXPORT   EXEC PGM=CWDDSUTL,REGION=4M,COND=(8,LT)
//ABNLREPT DD SYSOUT=*
//ABNLTERM DD SYSOUT=*
//ABNLFROM DD DISP=SHR,DSN=&PDDIOFIL
//ABNLTO   DD DISP=(NEW,CATLG),DSN=&EXPORTDS,
//             DSORG=PS,SPACE=(CYL,(5,10),RLSE)
//ABNLPARM DD *
EXPORT PROGRAM=&PDDIOMEM
/*
//CHECKIT  IF EXPORT.RC GT 0 THEN
//*
//@SPWARN  EXEC @SPWARN
//CHECKIT  ENDIF
//*
//CONNECT  EXEC PGM=DMBATCH,
//             PARM=(YYSLYNN),
//             REGION=1M
//DMNETMAP DD DSN=PGTN.CD.CD01.Q1.NETMAP,DISP=SHR
)SEL &PARM = TEST
//DMPUBLIB DD DSN=PREV.OEV1.NDMDATA,DISP=SHR
//         DD DSN=PREV.PEV1.NDMDATA,DISP=SHR
)ENDSEL
)SEL &PARM NE TEST
//DMPUBLIB DD DSN=PREV.PEV1.NDMDATA,DISP=SHR
)ENDSEL
//DMMSGFIL DD DSN=PGTN.CD.MSG,DISP=SHR
//DMPRINT  DD SYSOUT=*
//SYSIN    DD *
 SIGNON
 SUBMIT  PROC=XPP -
)SEL &PLEXTG = PLEXP1
 PRTY=15 CLASS=1 SNODE=CD.OS390.P101 MAXDELAY=00:20:00 -
)ENDSEL
)SEL &PLEXTG = PLEXN1
 PRTY=15 CLASS=1 SNODE=CD.OS390.N101 MAXDELAY=00:20:00 -
)ENDSEL
)SEL &PLEXTG = PLEXR1
 PRTY=15 CLASS=1 SNODE=CD.OS390.R101 MAXDELAY=00:20:00 -
)ENDSEL
         &&NODE=PNODE  -
         &&DSN='&EXPORTDS' -
         &&DSN3='&PDDIOFI2' -
         &&ZUSER='&ZUSER' -
         &&ZPREFIX='&ZPREFIX' -
         &&COMPRESS=COMPRESS
//*
//CHECKIT  IF EXPORT.RC GT 0 THEN
//*
//@SPWARN  EXEC @SPWARN
//CHECKIT  ENDIF
