//&ZPREFIX.XP2Q JOB CLASS=X,MSGCLASS=X,NOTIFY=&ZUSER
/*ROUTE XEQ RCJESX
//*
//* JOB TO EXPORT DDIO LISTING TO FLAT FILE AND SEND TO Q SYSTEM
//*
//* STEPS
//* =====
//*
//* STEP: DELETE
//*       DELETE TEMP FILE IF IT EXISTS
//* STEP: EXPORT
//*       EXPORT LISTING TO FLAT FILE
//* STEP: CONNECT
//*       CONNECT DIRECT FLAT FILE TO PLEXQ1
//*
//DELETE      EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
 DELETE '&EXPORTDS' PURGE
 SET MAXCC = 0
/*
//*
//EXPORT   EXEC  PGM=CWDDSUTL,REGION=4M,COND=(8,LT)
//STEPLIB  DD  DISP=SHR,DSN=SYSCOMPU.XPEDMVS.LOADLIB
//         DD  DISP=SHR,DSN=SYSCOMPU.ECC.SLCXLOAD
//         DD  DISP=SHR,DSN=SYSCOMPU.ECC.SLCXLOAD
//ABNLREPT DD  SYSOUT=*
//ABNLTERM DD  SYSOUT=*
//ABNLFROM DD  DISP=SHR,DSN=&DDIOFILE
//ABNLTO   DD  DISP=(NEW,CATLG),DSN=&EXPORTDS,
//         DSORG=PS,SPACE=(CYL,(5,10),RLSE)
//ABNLPARM DD  *
EXPORT PROGRAM=&DDIOMEM
/*
//CHECKIT  IF  EXPORT.RC GT 0 THEN                                      00010000
//@SPWARN  EXEC @SPWARN                                                 00020000
//CHECKIT  ENDIF                                                        00030000
//*                                                                     00040000
//*                                                                     00020002
//CONNECT  EXEC PGM=DMBATCH,
//             PARM=(YYSLYNN),
//             REGION=1M
//STEPLIB  DD DSN=SYSNDM.CD01.LOAD,DISP=SHR
//         DD DSN=SYSNDM.CD01.LINKLIB,DISP=SHR
//DMNETMAP DD DSN=SYSNDM.CD01.NETMAP,DISP=SHR
)SEL &PARM = TEST
//DMPUBLIB DD DSN=PREV.OEV1.NDMDATA,DISP=SHR
//         DD DSN=PREV.PEV1.NDMDATA,DISP=SHR
)ENDSEL
)SEL &PARM NE TEST
//DMPUBLIB DD DSN=PREV.PEV1.NDMDATA,DISP=SHR
)ENDSEL
//DMMSGFIL DD DSN=PGTN.CD.MSG,DISP=SHR
//DMPRINT  DD SYSOUT=*
//SYSIN    DD *
 SIGNON
 SUBMIT  PROC=XPQ -
 PRTY=15 CLASS=1 SNODE=CD.OS390.Q101 MAXDELAY=00:20:00 -
         &&NODE=PNODE  -
         &&DSN='&EXPORTDS' -
         &&DSN2='&DDIOFILE' -
         &&DSN3='&DDIOFIL2' -
         &&ZUSER='&ZUSER' -
         &&ZPREFIX='&ZPREFIX' -
         &&COMPRESS=COMPRESS
//*
//CHECKIT  IF  EXPORT.RC GT 0 THEN                                      00010000
//@SPWARN  EXEC @SPWARN                                                 00020000
//CHECKIT  ENDIF                                                        00030000
