/* REXX */

ADDRESS MVS

"EXECIO * DISKR REPIN (STEM REP. FINIS"

DO C=1 TO REP.0
   IF SUBSTR(REP.C,1,6) = 'DEMAND' THEN
   DO
     CCID = SUBSTR(REP.C,12,8)
     QUEUE 'DEMANDH,JOB='CCID'                     '
     QUEUE 'ADDRQ,JOB='CCID',USR="HELD FOR MORTGAGE"'
   END

END
 "EXECIO "QUEUED()" DISKW REPOUT (FINIS)"
EXIT
