/*-----------------------------REXX----------------------------------*\
 *  Edit macro to set the changed date on Cjobs and Bjobs so that    *
 *  they do not get deleted.                                         *
\*-------------------------------------------------------------------*/
isredit macro
'isredit c / /'
isredit end
