/* REXX */

PARSE ARG SYS TYPE
ADDRESS MVS
RCODE = 0
WRITE = 'YES'
SUPER_LINES = 0

DO UNTIL READRC = 2               /* GET ON UP ON THE FLOOR      */
  "EXECIO 1 DISKR REPIN   "      /* READ 1 LINE                 */
  READRC = RC                     /* RETURN CODE FROM EXECIO     */
  IF READRC > 2 THEN EXIT READRC  /*  I/O ERROR                  */
  IF READRC = 2 THEN LEAVE        /* END OF FILE GET OUT         */
  SUPER_LINES = SUPER_LINES + 1   /* TOTAL SUPERC READ           */
  PARSE PULL SUP                  /* STORE SUPERC NO UPPER       */


IF POS('CNPML NON-PAIRED NEW FILE MEMBER',SUP) > 0 THEN WRITE = 'NO'
IF POS('MEMBER(S) PROCESSED HAD NO CHANG',SUP) > 0 THEN DO
TOTAL = STRIP(SUBSTR(SUP,1,6))
WRITE = 'YES'
END

IF WRITE = 'YES' THEN DO
PUSH SUP
"EXECIO 1 DISKW CHANGREP"
END

END  /* LOOP THROUGH FILE */
SAY '************************************************************'
SAY '************************************************************'
SAY ' '
SAY '      SOURCE CHANGE SUMMARY INFORMATION WILL BE WRITTEN     '
SAY '      TO THE SUPERC LIBRARY CALLED PREV.WIZARD'SYS'.'TYPE'.SUPERC'
SAY '                                                            '
SAY '************************************************************'
SAY '************************************************************'

IF TOTAL > 0 THEN DO

SAY 'WARNING!! SOME OF YOUR SOURCE MEMBERS HAD NO CHANGES'
SAY 'PLEASE READ THE CHANGE SUMMARY'
SAY '                      '
SAY 'POSSIBLE CAUSES ARE - '
SAY '1) YOU HAVE FORGOTTON TO COPY YOUR MEMBERS TO TT??.CCID.TYPE'
SAY '2) YOU HAVE FORGOTTON TO CHANGE SOME OF YOUR MEMBERS'
SAY '3) YOU HAVE CODED THE WRONG MEMBER IN THE WIZARD MEMBER'
SAY '                                         '
SAY 'YOU SHOULD DO THE FOLLOWING'
SAY '1) CHECK THE OUTPUT FROM THE CHANGE SUMMARY'
SAY '2) DECIDE IF YOU NEED TO MAKE CHANGES TO THE SOURCE IN THE TT??  '
SAY '   LIBRARY OR AMEND/DELETE/ADD SOME LINES IN THE WIZARD MEMBER'
SAY '3) UPDATE THE WIZARD MEMBER AT STAGE E AND ATTEMPT THE MOVE AGAIN'
RCODE = 4
END

"EXECIO 0 DISKW CHANGREP (FINIS"

EXIT RCODE
