/* REXX */


SAY '*****************************************************************'
SAY '                                                                 '
SAY 'SORRY, THIS ENDEVOR TYPE HAS BEEN CONVERTED TO USE THE WIZARD    '
SAY 'PROCESSOR GROUP AND YOU CAN NO LONGER UPDATE IT THIS WAY         '
SAY 'FOR INSTRUCTIONS ON HOW TO USE THE WIZARD PROCESSOR GROUP PLEASE '
SAY 'READ THE QUICK REF QUIDE ON THE ENDEVOR HOME PAGE                '
SAY '                                                                 '
SAY '                                                                 '
SAY 'HTTP://WWW.TECHNOLOGY.RBS.CO.UK/CIM/BATCH/ENDEVOR/               '
SAY '                                                                 '
SAY 'FOR A COMPLETE LIST OF TYPES THAT ARE UNDER WIZARD CONTROL       '
SAY 'SEE THE WIZARD POWERPOINT ON THE HOMEPAGE OR USE 3.4 IN ISPF     '
SAY 'TO LIST ALL THE TT%%.WIZARD.* DATASETS                           '
SAY '                                                                 '
EXIT 8
