/* REXX */

ADDRESS MVS

"EXECIO * DISKR REPIN (STEM REP. FINIS"

PARSE ARG THISCCID THISSTAG

DO C=1 TO REP.0
WRITE = 'YES'

   IF SUBSTR(REP.C,2,12) = '** PDSM08 **' THEN DO
      STAGE = SUBSTR(REP.C,61,1)
   END

   IF SUBSTR(REP.C,2,7) = 'Member:' THEN DO
      TAG = '1'
      CCID = SUBSTR(REP.C,10,8)
   END

   IF (CCID = THISCCID) & (STAGE = THISSTAG) THEN TAG = '0'
   IF (CCID = THISCCID) & (STAGE <> THISSTAG) THEN WRITE = 'NO'

   IF SUBSTR(REP.C,2,6) = 'COPY  ' | SUBSTR(REP.C,2,6) = 'DELETE' THEN
     DO
     IF WRITE = 'YES' THEN QUEUE SUBSTR(REP.C,2,15)||TAG||CCID||' 'STAGE
   END
END

"EXECIO "QUEUED()" DISKW REPOUT (FINIS)"

EXIT
