/* REXX */

ADDRESS MVS

"EXECIO * DISKR REPIN (STEM REP. FINIS"
DO C=1 TO REP.0

TRACE I
  IF SUBSTR(REP.C,17,23) = 'BUILD  PROCESSOR GROUP' THEN DO
  SYSTEM = SUBSTR(REP.C,85,3)
  TYPE = SUBSTR(REP.C,100,8)
  GROUP = SUBSTR(REP.C,44,8)
  QUEUE ' 'SYSTEM' 'TYPE' 'GROUP
  END
END

"EXECIO "QUEUED()" DISKW REPOUT (FINIS)"
EXIT
