/*REXX*/
SIGNAL ON SYNTAX NAME ERROR
SIGNAL ON ERROR
ARG XPESTAT
IF XPESTAT=START THEN DO
 ADDRESS OPER ,
 "COMMAND('ROUTE *ALL,STATESET XPEHOST MODE (ACTIVE)')"
 LOITER = OPSWAIT(5)
 ADDRESS OPER "COMMAND('STATESET XPEHOST DESIRED(UP)')"
 LOITER = OPSWAIT(120)
 ASNUM=1
 END
IF XPESTAT=STOP THEN DO
 ADDRESS OPER ,
 "COMMAND('ROUTE *ALL,F XPEHOST,DISPLAY ALL')"
 LOITER = OPSWAIT(10)
 ADDRESS OPER ,
 "COMMAND('ROUTE *ALL,STATESET XPEHOST DESIRED (DOWN)')"
 LOITER = OPSWAIT(5)
 ADDRESS OPER ,
 "COMMAND('ROUTE *ALL,STATESET XPEHOST MODE (PASSIVE)')"
 LOITER = OPSWAIT(120)
 ASNUM=0
 END
OK = 'NO'
DO I = 1 TO 10
    IF OPSTATUS('A','A','XPEHOST') = ASNUM THEN DO
       OK = 'YES'
       LEAVE I
    END
    LOITER = OPSWAIT(20)
END
IF OK = 'YES' THEN ENDRC=0
ELSE ENDRC=99
ZISPFRC = ENDRC
ADDRESS ISPEXEC 'VPUT (ZISPFRC) SHARED'
EXIT ZISPFRC
ERROR:
SAY 'RC = 'RC' AT LINE = 'SIGL
ZISPFRC = RC
ADDRESS ISPEXEC 'VPUT (ZISPFRC) SHARED'
EXIT RC
