/* REXX TO SCAN OUTPUT FROM BATCH TERMINAL FROM EVL0001D    */
/* TO ENSURE THAT C JOB AND B JOB HAVE BEEN ADDED SUCCESS   */
/* FULLY AND THAT THE C JOB WAS DEMANDED SUCCESSFULLY.      */

TRACE N

COUNT=0

"EXECIO * DISKR CA7IN (STEM IN. FINIS)"

/* SCAN THE OUTPUT AND LOOK FOR THE TWO MESSAGES WE EXPECT. */

DO I=1 TO IN.0
   PARSE VAR IN.I CA7MSG PART1 PART2 REST .

   IF CA7MSG='SM20-00'  &    ,
      PART1='ADD'       &    ,
      LEFT(PART2,10) = 'SUCCESSFUL' THEN ,
      COUNT=COUNT+1

   IF CA7MSG='SPO7-00' THEN COUNT=COUNT+1

   QUEUE IN.I
   END
 "EXECIO "QUEUED()" DISKW CA7OUT  (FINIS)"
IF COUNT=3 THEN EXIT 0
ELSE EXIT 8
