/* REXX */

VALID = 'UNIT.SYST.ACPT.PROD'

ARG SYSUID
ADDRESS TSO

 "ALLOC DA('TTYY."SYSUID".REPOUT') F(DATAIN) SHR"
 "ALLOC DA('TTYY."SYSUID".REPOUT2') F(DATAOUT) OLD"
 "EXECIO * DISKR DATAIN (STEM REP. FINIS"

DO A = 1 TO REP.0
   IF POS(SUBSTR(REP.A,14,4),VALID) > 0 THEN DO
   ELEMENT  = STRIP(SUBSTR(REP.A,2,8))
   ENV      = SUBSTR(REP.A,14,4)
   SUB      = SUBSTR(REP.A,34,3)
   TYPE     = STRIP(SUBSTR(REP.A,43,8))
   STAGE    = SUBSTR(REP.A,52,1)
   LEVEL    = STRIP(SUBSTR(REP.A,59,5))
   PRGRP    = STRIP(SUBSTR(REP.A,67,8))
   CURRUSER = STRIP(SUBSTR(REP.A,103,8))
   GENDATE  = SUBSTR(REP.A,112,7)
   OUTLINE = '                                                              '
   OUTLINE = OVERLAY(ELEMENT,OUTLINE,1)
   OUTLINE = OVERLAY(TYPE,OUTLINE,10)
   OUTLINE = OVERLAY(SUB,OUTLINE,19)
   OUTLINE = OVERLAY(ENV,OUTLINE,23)
   OUTLINE = OVERLAY(STAGE,OUTLINE,28)
   OUTLINE = OVERLAY(CURRUSER,OUTLINE,30)
   OUTLINE = OVERLAY(GENDATE,OUTLINE,38)
   OUTLINE = OVERLAY(PRGRP,OUTLINE,46)
   OUTLINE = OVERLAY(LEVEL,OUTLINE,55)
   SAY OUTLINE
   QUEUE OUTLINE
   END
END


  "EXECIO "QUEUED()" DISKW DATAOUT (FINIS)"
EXIT 0
