/* REXX */


ARG SYSUID
ADDRESS TSO

 "ALLOC DA('TTYY."SYSUID".REPOUT2') F(DATAIN) SHR"
 "ALLOC DA('TTYY."SYSUID".REPOUT3') F(DATAOUT) SHR"
 "EXECIO * DISKR DATAIN (STEM REP. FINIS"


   QUEUE 'ELEMENT,TYPE,OCCURRENCE,SUB,STAGE,ENVIRONMENT,LEVEL,'||,
             'PRGRP,LAST ENDEVOR ACTION,GENERATE DATE,'
   IF REP.0 = 0 THEN QUEUE 'NO ELEMENTS FOUND!'
DO A = 1 TO REP.0
   ELEMENT  = STRIP(SUBSTR(REP.A,1,8))
   ENV      = SUBSTR(REP.A,23,4)
   SUB      = SUBSTR(REP.A,19,3)
   TYPE     = STRIP(SUBSTR(REP.A,10,8))
   STAGE    = SUBSTR(REP.A,28,1)
   LEVEL    = STRIP(SUBSTR(REP.A,55,5))
   PRGRP    = STRIP(SUBSTR(REP.A,46,8))
   CURRUSER = STRIP(SUBSTR(REP.A,30,8))
   GENDATE  = SUBSTR(REP.A,38,7)
   DUPS = 'SINGLE'
   B = A+1
   ELETYP   = STRIP(SUBSTR(REP.A,1,18))
   NEXTELETYP = STRIP(SUBSTR(REP.B,1,18))
   IF ELETYP = OLDELETYP THEN DUPS = 'DUPLICATE'
   IF ELETYP = NEXTELETYP THEN DUPS = 'DUPLICATE'
   QUEUE ELEMENT','TYPE','DUPS','SUB','STAGE','ENV','LEVEL','||,
                   PRGRP','CURRUSER','GENDATE','

   OLDELETYP = ELETYP
END

  "EXECIO "QUEUED()" DISKW DATAOUT (FINIS)"
EXIT 0
