/* Rexx */                                                              00010000
/********************************************************************/  00020000
/* Edit Macro to copy update #SAMPLE member into new members        */  00030003
/********************************************************************/  00040000
address ISREDIT                                                         00050000
"MACRO"                                                                 00060000
"COPY #SAMPLE AFTER .ZFIRST"                                            00070002
exit 1                                                                  00080004
