/* Rexx */                                                              00010000
/********************************************************************/  00020000
/* Return a non-zero return code for an empty file                  */  00030000
/********************************************************************/  00040000
"EXECIO 1 DISKR IN (FINIS"                                              00050003
exit rc                                                                 00060003
