/*--------------------------REXX----------------------------*/
isredit macro
"isredit hilite on"     /* toggle cursor hilite off */
"isredit recovery on"
"isredit caps on"
exit
