/* REXX */

ADDRESS MVS

"EXECIO * DISKR FILEIN (STEM REP. FINIS"

 QUEUE REP.1

"EXECIO "QUEUED()" DISKW REPORT1 (FINIS)"

DELSTACK

DO C=2 TO REP.0
QUEUE REP.C
END

"EXECIO "QUEUED()" DISKW REPORT2 (FINIS)"


EXIT
