/*REXX*/
isredit macro
"isredit recovery on"
"isredit preserve on"
"isredit hilite on"
"isredit hilite paren"
"isredit hilite find"
"isredit hilite cursor"
exit
