)CM  PACKAGE SHIPMENT BATCH JCL -  REMOTE SITE JCL      ISPSLIB(C1BMXCOP)
)CM
)CM  JCL TO COPY REMOTE STAGING DATASETS TO THEIR PRODUCTION COUNTERPARTS.
)CM  THIS JOBSTEP MEMBER IS READ/WRITTEN AT THE HOST SITE BY THE SHIP-
)CM  MENT STAGING UTILITY AND IS EXECUTED AT THE REMOTE SITE.
)CM
)CM  THIS IS  N-O-T  AN ISPF SKELETON.  ALL SKELETON CONTROL STATEMENTS
)CM  (CLOSE PARENTHESIS IN COLUMN 1) WILL BE IGNORED.
)CM
)CM  * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
)CM
)CM  TAILORING INSTRUCTIONS:
)CM
)CM  THE UTILITY-GENERATED COPY CONTROL CARDS WILL BE IN IEBCOPY FORMAT.
)CM  COPY AND COPYMOD COMMANDS ARE USED.  THERE ARE NO SELECT MEMBER
)CM  STATEMENTS GENERATED.
)CM
)CM  THE UTILITY WILL GENERATE A "//SYSIN DD *" STATEMENT.
)CM
)CM  * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
)CM
//* *----------------------------------------------* C1BMXRJC(C1BMXCOP)
//* *  REMOTE SITE JOBSTEP TO COPY MEMBERS WHICH WERE
//* *  MODIFIED BY THE EXECUTION OF THE PACKAGE
//* *-----------------------------------------------------------------*
//COPY    EXEC PGM=IEBCOPY
//SYSUT3    DD UNIT=SYSDA,SPACE=(TRK,(5,5))
//SYSUT4    DD UNIT=SYSDA,SPACE=(TRK,(5,5))
//SYSPRINT  DD SYSOUT=*
