)CM  PACKAGE SHIPMENT BATCH JCL - REMOTE SITE         ISPSLIB(C1BMXBPX)
)CM
)CM  JCL TO COPY REMOTE USS FILES TO THEIR PRODUCTION COUNTERPART
)CM  THIS JOBSTEP MEMBER IS READ/WRITTEN AT THE HOST SITE BY THE SHIP-
)CM  MENT STAGING UTILITY AND IS EXECUTED AT THE REMOTE SITE.
)CM
)CM  THIS IS  N-O-T  AN ISPF SKELETON.  ALL SKELETON CONTROL STATEMENTS
)CM  (CLOSE PARENTHESIS IN COLUMN 1) WILL BE IGNORED.
)CM
)CM  * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
)CM
)CM  THE GENERATED cp SHELL COMMANDS ARE INPUT TO THE USS UTILITY
)CM  PROGRAM BPXBATCH.
)CM
)CM  THE STDPARM DD STATEMENT (WITH FILE CONTAINING THE SHELL
)CM  COMMANDS) WILL BE INSERTED INTO THE JOB STREAM AFTER THIS
)CM  MEMBER IS READ AND WRITTEN.
)CM
)CM  * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
)CM
//* *----------------------------------------------* C1BMXRJC(C1BMXBPX)
//* *  REMOTE SITE JOBSTEP TO COPY USS FILES TO THEIR PRODUCTION
//* *  DIRECTORIES.
//* *-----------------------------------------------------------------*
//BPXBAT   EXEC PGM=BPXBATCH           C1BMXBPX
//STDOUT   DD   SYSOUT=*
//STDERR   DD   SYSOUT=*
