)CM  PACKAGE SHIPMENT BATCH JCL -  LOCAL TRANSFERS - CSIQSENU(C1BMXLOC)
)CM
)CM  THIS SKELETON IS USED TO TRANSFER HOST STAGING DATASETS WHICH EXIST
)CM  ON SHARED DASD TO PRODUCTION DATASETS WHICH MAY OR MAY NOT EXIST ON
)CM  SHARED DASD.  THE JOB EXECUTES TSO IN BATCH AND THE INPUT (SYSTSIN)
)CM  CONTAINS A SUBMIT COMMAND TO RUN AHJOB.
)CM
//* *==============================================================* *
//* *===========================================* CSIQSENU(C1BMXLOC) *
//* *==============================================================* *
//*
//&VNBXSTP EXEC PGM=IKJEFT01,COND=(12,LE,NDVRSHIP)
//SYSTSIN   DD DSN=&&&&XLCC,DISP=(OLD,PASS)
//SYSTSPRT  DD SYSOUT=*
//SYSOUT    DD SYSOUT=*
