//USERID   JOB (JOBACNTCD),'PROGRAMMER NAME     ',
//         CLASS=A,MSGCLASS=X,NOTIFY=&SYSUID
/*JOBPARM SYSAFF=* ANY                      <=== MODIFY AS APPROPRIATE
//* JCLLIB ORDER=(IPRFX.IQUAL.CSIQJCL)      <=== UNCOMMENT IF NEEDED
