)CM CHECK IF THIS USER IS USING NON-STANDARD DEFAULTS TABLE NAME
)CM   AND IF SO PROPAGATE THAT TABLE NAME TO SUBMITTED JOBS
)IF &CIDFLTNM NE &Z THEN )DO
)SEL &CIDFLTNM NE C1DEFLTS
)SETF DFLSF = &SUBSTR(&CIDFLTNM,7,2)
//EN$DFT&DFLSF DD DUMMY         <<=== REQUEST DEFAULTS &CIDFLTNM
)ENDSEL
)ENDDO
)IF &EEVLIB01 EQ &Z THEN )DO
//STEPLIB  DD DISP=SHR,DSN=IPRFX.IQUAL.CSIQAUTU
//         DD DISP=SHR,DSN=IPRFX.IQUAL.CSIQAUTH
//CONLIB   DD DISP=SHR,DSN=IPRFX.IQUAL.CSIQLOAD
)ENDDO
)ELSE )DO
)SEL &EEVLIB01 NE &Z
&EEVLIB01
)ENDSEL
)SEL &EEVLIB02 NE &Z
&EEVLIB02
)ENDSEL
)SEL &EEVLIB03 NE &Z
&EEVLIB03
)ENDSEL
)SEL &EEVLIB04 NE &Z
&EEVLIB04
)ENDSEL
)SEL &EEVLIB05 NE &Z
&EEVLIB05
)ENDSEL
)SEL &EEVLIB06 NE &Z
&EEVLIB06
)ENDSEL
)SEL &EEVLIB07 NE &Z
&EEVLIB07
)ENDSEL
)SEL &EEVLIB08 NE &Z
&EEVLIB08
)ENDSEL
)SEL &EEVLIB09 NE &Z
&EEVLIB09
)ENDSEL
)SEL &EEVLIB10 NE &Z
&EEVLIB10
)ENDSEL
)SEL &EEVLIB11 NE &Z
&EEVLIB11
)ENDSEL
)SEL &EEVLIB12 NE &Z
&EEVLIB12
)ENDSEL
)SEL &EEVLIB13 NE &Z
&EEVLIB13
)ENDSEL
)SEL &EEVLIB14 NE &Z
&EEVLIB14
)ENDSEL
)SEL &EEVLIB15 NE &Z
&EEVLIB15
)ENDSEL
)SEL &EEVLIB16 NE &Z
&EEVLIB16
)ENDSEL
)SEL &EEVLIB17 NE &Z
&EEVLIB17
)ENDSEL
)SEL &EEVLIB18 NE &Z
&EEVLIB18
)ENDSEL
)SEL &EEVLIB19 NE &Z
&EEVLIB19
)ENDSEL
)SEL &EEVLIB20 NE &Z
&EEVLIB20
)ENDSEL
)SEL &EEVLIB21 NE &Z
&EEVLIB21
)ENDSEL
)SEL &EEVLIB22 NE &Z
&EEVLIB22
)ENDSEL
)SEL &EEVLIB23 NE &Z
&EEVLIB23
)ENDSEL
)SEL &EEVLIB24 NE &Z
&EEVLIB24
)ENDSEL
)SEL &EEVLIB25 NE &Z
&EEVLIB25
)ENDSEL
)SEL &EEVLIB26 NE &Z
&EEVLIB26
)ENDSEL
)SEL &EEVLIB27 NE &Z
&EEVLIB27
)ENDSEL
)SEL &EEVLIB28 NE &Z
&EEVLIB28
)ENDSEL
)SEL &EEVLIB29 NE &Z
&EEVLIB29
)ENDSEL
)SEL &EEVLIB23 NE &Z
&EEVLIB23
)ENDSEL
)ENDDO
