)BODY EXPAND(\\)
%TUTORIAL \-\ Merge Output Specification for Build WIP \-\ TUTORIAL
%SELECTION ===>_ZCMD                                                           +
%
+Use the Merge Output Specification Panel for Build WIP to identify where
+you want PDM to write the merge output to and to specify other options
+related to the automatic merge process.
+
%Merge to+- Indicates whether you want the merge output to be in a
+    data set%D,+or in a CA Endevor SCM location, option%E.+
+
+    Select%1-3+for information about:
+
%    1+- The automatic merge process   %2+- The merge file procedure
%    3+- The merge element procedure

)PROC
   &ZSEL = TRANS(&ZCMD 1,BC1T2410 2,BC1T4400 3,BC1T4500)
)END
