)ATTR DEFAULT(%+_)
       /* % TYPE(TEXT) INTENS(HIGH)      DEFAULTS DISPLAYED FOR      */
       /* + TYPE(TEXT) INTENS(LOW)       INFORMATION ONLY            */
       /* _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT)             */
   $ TYPE(INPUT) INTENS(LOW) PAD(_)      /* UNIQUE ATTRIBUTES FOR   */
   ! TYPE(INPUT) INTENS(LOW) PAD(NULLS)  /* DASHES AND NULL PADDING */
   ¢ TYPE(OUTPUT) INTENS(LOW)
   | TYPE(OUTPUT) INTENS(HIGH)
)BODY EXPAND(\\)
|VARFLIT%\-\  APPROVER GROUP RELATIONSHIP  \-\
%COMMAND ===>_VARWKCMD                                                         +
+
+ENVIRONMENT:          ¢VAREVNME+
+
+APPROVER GROUP   %===>_VARAGNME        +
+
+APPROVER TYPE:        ¢VARGJTYP  +
+
+UPDATED:              ¢Z      ¢Z    +BY¢VARLUUID+
+
+INVENTORY AREA TO WHICH APPROVER GROUP IS RELATED:
+
+   SYSTEM:            ¢VARSYNME+
+   SUBSYSTEM:         ¢VARSBNME+
+   TYPE:              ¢VARTYNME+
+   STAGE NUMBER:      ¢VARGJDS#+
+
)INIT
  .HELP = CITAGR00
  .ZVARS = '(VARLUDTE VARLUTME)'
)PROC
)END
