)ATTR DEFAULT(%+_)
       /* % TYPE(TEXT) INTENS(HIGH)      DEFAULTS DISPLAYED FOR      */
       /* + TYPE(TEXT) INTENS(LOW)       INFORMATION ONLY            */
       /* _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT)             */
   @ TYPE(INPUT) INTENS(HIGH) CAPS(OFF) JUST(LEFT)
   $ TYPE(INPUT) INTENS(LOW) PAD(_)      /* UNIQUE ATTRIBUTES FOR   */
   ! TYPE(INPUT) INTENS(LOW) PAD(NULLS)  /* DASHES AND NULL PADDING */
   ¢ TYPE(OUTPUT) INTENS(HIGH) JUST(RIGHT)
   | TYPE(OUTPUT) INTENS(LOW)
)BODY EXPAND(\\)
% \-\ VALIDATE ELEMENTS \-\
%OPTION  ===>_ZCMD                                                             +
+                               ELEMENT DISPLAY OPTIONS:
%   blank+- Element list         %S+- Summary  %B+- Browse  %H+- History
%   VE+- Validate element        %M+- Master   %C+- Changes
+
+FROM LOCATION:                         ACTION OPTIONS:
+  ENVIRONMENT%===>_VAREVNME+             ELEMENT MASTER      %===>_Z+(Y/N)
+  SYSTEM     %===>_SYS     +             SYNCHRONIZATION     %===>_Z+(Y/N)
+  SUBSYSTEM  %===>_SBS     +             COMPONENT VALIDATION%===>_Z+(Y/N)
+  ELEMENT    %===>_CIELM     +           TERSE MESSAGES      %===>_Z+(Y/N)
+  TYPE       %===>_TYPEN   +
+  STAGE      %===>_D+ ¢Z+-|CLU1ID  +
+                      ¢Z+-|CLU2ID  +
+                                       LIST OPTIONS:
+                                         DISPLAY LIST        %===>_Z+(Y/N)
+                                         APPLY LIST FILTERS  %===>_Z+(Y/N)
+                                         BUILD USING MAP     %===>_Z+(Y/N)
+
+
)INIT
  .ZVARS = '(VAREMCHK VARSYCHK VARCMCHK VARTMSGS CLU1I CLU2I VARWKLST +
             VARWHPNL VARSHMAP)'
  .HELP = CITFC000
  &LIST2 = 'Y N'
  IF (&VARWHPNL = ' ')
    &VARWHPNL = 'N'
)PROC
  VER  (&VARWHPNL,NB,LISTV,&LIST2,MSG=CIFV005)
)END
