)ATTR DEFAULT(%+_)
       /* % TYPE(TEXT) INTENS(HIGH)      DEFAULTS DISPLAYED FOR      */
       /* + TYPE(TEXT) INTENS(LOW)       INFORMATION ONLY            */
       /* _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT)             */
   @ TYPE(INPUT) INTENS(HIGH) CAPS(OFF) JUST(LEFT)
   $ TYPE(INPUT) INTENS(LOW) PAD(_)      /* UNIQUE ATTRIBUTES FOR   */
   ! TYPE(INPUT) INTENS(LOW) PAD(NULLS)  /* DASHES AND NULL PADDING */
   ¢ TYPE(OUTPUT) INTENS(HIGH) JUST(RIGHT)
   | TYPE(OUTPUT) INTENS(LOW)
 ^ TYPE(INPUT) CAPS(&VARCACCI) FORMAT(&VARFMCCI)
 ` TYPE(INPUT) CAPS(&VARCACOM) FORMAT(&VARFMCOM)
 ~ TYPE(INPUT) CAPS(&VARCADES) FORMAT(&VARFMDES)
)BODY
%------------------------------- DELETE ELEMENTS -------------------------------
%OPTION  ===>_ZCMD                                                             +
+                               ELEMENT DISPLAY OPTIONS:
%   blank+- Element list         %S+- Summary  %B+- Browse  %H+- History
%   #+- Delete element           %M+- Master   %C+- Changes
+
+CCID%===>^CTLNBR      +  COMMENT%===>`DESCRPT1                                +
+
+FROM LOCATION:                         ACTION OPTIONS:
+  ENVIRONMENT%===>_VAREVNME+             OVERRIDE SIGNOUT%===>_Z+(Y/N)
+  SYSTEM     %===>_SYS     +             ONLY COMPONENT  %===>_Z+(Y/N)
+  SUBSYSTEM  %===>_SBS     +
+  ELEMENT    %===>_CIELM     +         LIST OPTIONS:
+  TYPE       %===>_TYPEN   +             DISPLAY LIST      %===>_Z+(Y/N)
+  STAGE      %===>_D+ ¢Z+-|CLU1ID  +     APPLY LIST FILTERS%===>_Z+(Y/N)
+                      ¢Z+-|CLU2ID  +
+
+
+
)INIT
  .ZVARS = '(C1SISOFR VARONLCM VARWKLST CLU1I +
             VARWHPNL CLU2I)'
  .HELP = CITF5000
  &LIST2 = 'Y N'
  IF (&VARWHPNL = ' ')
    &VARWHPNL = 'N'
)PROC
  VER  (&VARWHPNL,NB,LISTV,&LIST2,MSG=CIFV005)
)END
