)ATTR DEFAULT(%+_)
       /* % TYPE(TEXT) INTENS(HIGH)      DEFAULTS DISPLAYED FOR      */
       /* + TYPE(TEXT) INTENS(LOW)       INFORMATION ONLY            */
       /* _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT)             */
   @ TYPE(INPUT) INTENS(HIGH) CAPS(OFF) JUST(LEFT)
   $ TYPE(INPUT) INTENS(LOW) PAD(_)      /* UNIQUE ATTRIBUTES FOR   */
   ! TYPE(INPUT) INTENS(LOW) PAD(NULLS)  /* DASHES AND NULL PADDING */
   ¢ TYPE(OUTPUT) INTENS(HIGH) JUST(RIGHT)
   | TYPE(OUTPUT) INTENS(LOW)
 ^ TYPE(INPUT) CAPS(&VARCACCI) FORMAT(&VARFMCCI)
 ` TYPE(INPUT) CAPS(&VARCACOM) FORMAT(&VARFMCOM)
 ~ TYPE(INPUT) CAPS(&VARCADES) FORMAT(&VARFMDES)
)BODY
%-----------------------------  ARCHIVE ELEMENTS  ------------------------------
%OPTION  ===>_ZCMD                                                             +
+                               ELEMENT DISPLAY OPTIONS:
%   blank+- Element list         %S+- Summary  %B+- Browse   %H+- History
%   V+- Archive element          %M+- Master   %C+- Changes
+
+CCID%===>^CTLNBR      +  COMMENT%===>`DESCRPT1                                +
+
+FROM LOCATION:                         ACTION OPTIONS:
+  ENVIRONMENT%===>_VAREVNME+             DELETE 'FROM' ELEMENT%===>_Z+(Y/N)
+  SYSTEM     %===>_SYS     +             OVERRIDE SIGNOUT     %===>_Z+(Y/N)
+  SUBSYSTEM  %===>_SBS     +
+  ELEMENT    %===>_CIELM     +         LIST OPTIONS:
+  TYPE       %===>_TYPEN   +             DISPLAY LIST      %===>_Z+(Y/N)
+  STAGE      %===>_D+ ¢Z+-|CLU1ID  +     APPLY LIST FILTERS%===>_Z+(Y/N)
+                      ¢Z+-|CLU2ID  +     BUILD USING MAP   %===>_Z+(Y/N)
+
+TO FILE      %===>_VNBFBFIL+
+
+
+
+
+
)INIT
  .HELP = CITFB000
  .ZVARS = '(VNBF9NOD C1SISOFR VARWKLST CLU1I VARWHPNL CLU2I +
             VARSHMAP)'
  &LIST2 = 'Y N'
  IF (&VARWHPNL = ' ')
    &VARWHPNL = 'N'
)PROC
  VER  (&VARWHPNL,NB,LISTV,&LIST2,MSG=CIFV005)
)END
