)ATTR DEFAULT(%+_)
       /* % TYPE(TEXT) INTENS(HIGH)      DEFAULTS DISPLAYED FOR      */
       /* + TYPE(TEXT) INTENS(LOW)       INFORMATION ONLY            */
       /* _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT)             */
   $ TYPE(INPUT) INTENS(HIGH) CAPS(OFF) JUST(LEFT) PAD(NULLS)
   ! TYPE(INPUT) INTENS(LOW) PAD(NULLS)  /* DASHES AND NULL PADDING */
   ¢ TYPE(OUTPUT) INTENS(HIGH) JUST(RIGHT)
   | TYPE(OUTPUT) INTENS(LOW)
)BODY
%-------------------------------  LIST MEMBERS  --------------------------------
%OPTION  ===>_ZCMD                                                             +
+
+  %blank+- Member list     %B+- Browse member      %L+- LIST action
+
+FROM ISPF LIBRARY:+             +LIST OPTIONS:
+  PROJECT%===>_PRJ0    +           DISPLAY LIST %===>_Z+(Y/N)
+  LIBRARY%===>_LIB0    +
+  TYPE   %===>_TYP0    +
+  MEMBER %===>_ISPFMB    +
+    THRU MEMBER%===>_C1DSPTNM  +
+
+FROM OTHER PARTITIONED OR SEQUENTIAL DATA SET:+
+  DATA SET NAME%===>_OTHDSN                                                  +
+
+TEXT STRING:
+ %===>$VNB50TXT
+
+SCAN COLUMNS:
+  START%===>_Z  +  END%===>_Z  +  SHOW TEXT%===>_Z+(Y/N)+
+
+ACTION TO BE GENERATED WHEN LIST IS CREATED%===>_VNB50ACT+
+WRITE LIST TO OUTPUT DATA SET%===>_Z+(Y/N)+
)INIT
  .HELP = CITN5000
  .ZVARS = '(VARWKLST VNB50BEG VNB50END VNB50STX VNBWOFLG)'
)END
