)ATTR DEFAULT(%+_)
   /*------------------------------------------------------------*/
   /* % TYPE(TEXT) INTENS(HIGH)      DEFAULTS DISPLAYED FOR      */
   /* + TYPE(TEXT) INTENS(LOW)       INFORMATION ONLY            */
   /* _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT)             */
   /*------------------------------------------------------------*/
   $ TYPE(INPUT) INTENS(LOW) PAD(_)
   ! TYPE(INPUT) INTENS(LOW) PAD(NULLS)
   ¢ TYPE(OUTPUT) INTENS(LOW)
   | TYPE(OUTPUT) INTENS(HIGH)
   < TYPE(TEXT) INTENS(&VNBPKGD9)
   ^ TYPE(TEXT) INTENS(&VARPKCIT)
   \ TYPE(TEXT) INTENS(&VARPKCIO)
   @ TYPE(TEXT) INTENS(&VARPKDAO)
   # TYPE(TEXT) INTENS(&VARPKDAT)
   ~ TYPE(OUTPUT) CAPS(&VARCADES) FORMAT(&VARFMDES) INTENS(HIGH)
)BODY
%REVIEW ----------------------- REVIEW PACKAGE ---------------------------------
%OPTION  ===>_VARWKCMD                                                         +
+
+  %blank+- Display Action Summary       %D+ - Deny Package
+  %A+- Approve Package                  %L+ - Display Approver Groups
+  %N+- Add Notes to Package             @DA#- Dynamic Approvers+
+  \CI^- Display Correlation Information
<NOTES EXIST FOR PACKAGE+
+
+PACKAGE ID:|VPHPKGID        +             STATUS:|VPHSTAT     +
+DESCRIPTION: ~VPHCOMM                                           +
+PACKAGE TYPE:|VPHTYPE   +                                                    +
+SHARABLE PACKAGE:|Z+
+EXECUTION WINDOW FROM:|Z      |Z    +     TO:|Z      |Z    +
+
+              User Id  Date    Time
+CREATED:     |VPHCRUID|Z      |Z    +
+LAST UPDATED:|VPHPUUID|Z      |Z    +
+CAST:        |VPHCUID |Z      |Z    +
+DENIED:               |Z      |Z    +
+
)INIT
  .HELP = CITP4000
  .ZVARS = '( VPHPSHR                                             +
              VPHWSD VPHWST VPHWED VPHWET                         +
              VPHCRD VPHCRT                                       +
              VPHPUD VPHPUT VPHCD  VPHCT                          +
              VPHAD VPHAT                                         )'
)PROC
)END
