)ATTR DEFAULT(%+_)
       /* % TYPE(TEXT) INTENS(HIGH)      DEFAULTS DISPLAYED FOR      */
       /* + TYPE(TEXT) INTENS(LOW)       INFORMATION ONLY            */
       /* _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT)             */
   $ TYPE(INPUT) INTENS(LOW) PAD(_)
   ! TYPE(INPUT) INTENS(LOW) PAD(NULLS)
   ¢ TYPE(OUTPUT) INTENS(LOW)
   | TYPE(OUTPUT) INTENS(HIGH)
)BODY
%-----------------------  DistribuLink Options Menu  ---------------------------
%Option  ===>_VARWKCMD                                                         +
+
+  %1+ DISPLAY - Display DistribuLink Connection Information
+  %2+ BUILD   - Create/Modify a DistribuLink Connection
+  %3+ DELETE  - Delete a DistribuLink Connection
+
+
+       Connection ID%===>_Z      +
+
)INIT
  .HELP = CITPC000
  .ZVARS = '(VNBSIDST)'
)PROC
)END
