)ATTR
  _ TYPE(INPUT) CAPS(OFF) INTENS(HIGH) FORMAT(&MIXED)
  ¢ TYPE(INPUT) CAPS(ON) INTENS(HIGH) JUST(LEFT)
  | AREA(DYNAMIC) EXTEND(ON) SCROLL(ON) USERMOD(20)
  ! TYPE(OUTPUT) INTENS(HIGH) PAD(-)
  ^ TYPE(INPUT) CAPS(&VARCACCI) FORMAT(&VARFMCCI)
  ` TYPE(INPUT) CAPS(&VARCACOM) FORMAT(&VARFMCOM)
  ~ TYPE(INPUT) CAPS(&VARCADES) FORMAT(&VARFMDES) INTENS(HIGH) JUST(LEFT)
 01 TYPE(DATAOUT) INTENS(LOW)
 02 TYPE(DATAOUT) INTENS(HIGH)
 03 TYPE(DATAOUT) SKIP(ON) /* FOR TEXT ENTER CMD. FIELD */
 04 TYPE(DATAIN)  INTENS(LOW)  CAPS(OFF)
 05 TYPE(DATAIN)  INTENS(HIGH) CAPS(OFF)
 06 TYPE(DATAIN)  INTENS(LOW)  CAPS(IN)
 07 TYPE(DATAIN)  INTENS(HIGH) CAPS(IN)
 08 TYPE(DATAIN)  INTENS(LOW)  FORMAT(DBCS)
 09 TYPE(DATAIN)  INTENS(LOW)  FORMAT(EBCDIC)
 0A TYPE(DATAIN)  INTENS(LOW)  FORMAT(&MIXED)
 20 TYPE(DATAIN)  INTENS(LOW) CAPS(IN) FORMAT(&MIXED)
)BODY WIDTH(&ZWIDTH) EXPAND(//)
%&VARPNLID - PACKAGE ID: &VARSLPKG ---/-/-----------------%COLUMNS!ZCL  !ZCR  %%
%COMMAND ===>_ZCMD                    / /                     %SCROLL ===>_Z   %
%DESCRIPTION:~VPHCOMM                                           +
|ZDATA -------------------------------/-/--------------------------------------|
|                                     / /                                      |
| ------------------------------------/-/--------------------------------------|
)INIT
&ZHIDEX = 'Y'
  .HELP = ISR20000         /* DEFAULT TUTORIAL NAME     */
  .ZVARS = 'ZSCED'         /* SCROLL AMT VARIABLE NAME  */
  &MIXED = MIX             /* SET FROMAT MIX            */
  IF (&ZPDMIX = N)         /* IF EBCDIC MODE REQUESTED  */
    &MIXED = EBCDIC        /*  SET FORMAT EBCDIC        */

  .CURSOR = ZCMD

)REINIT
  REFRESH(ZCMD,ZSCED,ZDATA,ZCL,ZCR)
  .HELP = ISR20000         /* DEFAULT TUTORIAL NAME     */


)PROC
  &ZCURSOR = .CURSOR
  &ZCSROFF = .CSRPOS
  &ZLVLINE = LVLINE(ZDATA)

)END

/*  DYNAMIC AREA SCREEN WIDTH FROM PQUERY. (80,132,160)
/*  DYNAMIC AREA SCREEN DEPTH FROM PQUERY. (24,32,43,27,60)
