)ATTR DEFAULT(%+_)
       /* % TYPE(TEXT) INTENS(HIGH)      DEFAULTS DISPLAYED FOR      */
       /* + TYPE(TEXT) INTENS(LOW)       INFORMATION ONLY            */
       /* _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT)             */
   $ TYPE(INPUT) INTENS(LOW) PAD(_)
   ! TYPE(INPUT) INTENS(LOW) PAD(NULLS)
   ¢ TYPE(OUTPUT) INTENS(LOW)
   | TYPE(OUTPUT) INTENS(HIGH)
)BODY EXPAND(\\)
%\-\ UNLOAD/RELOAD REPORTS \-\
%COMMAND%===>_ZCMD                                                             +
+
+SELECT REPORTS:
 _Z%50 +System Inventory Profile          _Z%53 +Unload Approver Group Usage
 _Z%51 +Unload System Definition profile  _Z%54 +Element Catalog
 _Z%52 +Unload Approver Group Definition  _Z%55 +Unload Package
+
+FROM UNLOAD TAPE:  (enter tape information in JCL format)
%===> +//UNLINPT DD_UNLDJCL1
%===> _UNLDJCL2
%===> _UNLDJCL3
+
+SELECTION:
+  ENVIRONMENT %===>_VAREVNME+
+  SYSTEM      %===>_SYS     +
+  SUBSYSTEM   %===>_SBS     +
+  ELEMENT     %===>_CIELM     +
+  TYPE        %===>_TYPEN   +
+  STAGE       %===>_D+
+
+  PACKAGE ID  %===>_VARSPPKG        +
%
)INIT
 .ZVARS = '(RPT50 RPT53 RPT51 RPT54 RPT52 RPT55)'
 .HELP = CITR1500
)PROC
)END
