)ATTR DEFAULT(%+_)
       /* % TYPE(TEXT) INTENS(HIGH)      DEFAULTS DISPLAYED FOR      */
       /* + TYPE(TEXT) INTENS(LOW)       INFORMATION ONLY            */
       /* _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT)             */
   $ TYPE(INPUT) INTENS(LOW) PAD(_)      /* UNIQUE ATTRIBUTES FOR   */
   ! TYPE(INPUT) INTENS(LOW) PAD(NULLS)  /* DASHES AND NULL PADDING */
   ¢ TYPE(OUTPUT) INTENS(HIGH)
   | TYPE(OUTPUT) INTENS(LOW)
)BODY
%--------------------------  Element Backed-Out  -------------------------------
%COMMAND ===>_ZCMD                                                             +
+
+
+
+   ************************************************************************
+   *                        %*** CAUTION ***+                             *
+   *                                                                     +*
+   *       You have selected an element that has been backed-out.        +*
+   *                                                                      *
+   *       Package associated with the element source:¢ESPKGID           +*
+   *                                   element output:¢EOPKGID           +*
+   *                                                                      *
+   *                                                                      *
+   *   If you wish to return to the previous panel, enter the%END+command *
+   *                                                                      *
+   *   Otherwise, press the%ENTER+key to continue...                      *
+   *                                                                      *
+   ************************************************************************
)INIT
)PROC
)END
