)BODY EXPAND(\\)
%\-\ CA Endevor Software Change Manager Version 16.0 - New Features \-\
%Option ===>_ZCMD                                                 %Version 16.0+
+                                                                 %Page 2 of 2+
+The following panels present information about the features and
+enhancements that are available with V16.0 of CA Endevor SCM.
+
+Select one of the options listed below for more information               Last+
+                                                                       Changed+
%12+- Standardize Version Level Format to VVLL                            %base+
+
+
+
+
+
+
+
+
+
+
+
%\ \+Refer to the%CA Endevor SCM+documentation for detailed information%\ \

+\ \ (Hit%ENTER+for the previous options,%END+to exit) \ \
)PROC
   &ZSEL = TRANS(&ZCMD 12,CIT160C0 13,CIT160D0)
   &ZCONT = CIT16000
)END
