)BODY EXPAND(\\)
%\-\ Software Configuration Services \-\
%Option ===>_ZCMD                                                 %Version 15.0+
%
%Software Configuration Services+
+
 Software Configuration Services automates the configuration of CA mainframe
 products after they have been installed using Mainframe Software Manager (MSM).
 When installing CA Endevor SCM for the first time and after installing CA
 Endevor SCM using Mainframe Software Manager, you can use Software
 Configuration Services to execute Rapid Implementation. The Software
 Configuration Services automated configuration for CA Endevor SCM leads you
 through all the tasks necessary to complete this process. Rapid Implementation
 is a basic implementation of CA Endevor SCM that uses a predefined environment,
 with minimum customization. Later the implementation can be customized as
 needed.





%\ \+Refer to the%CA Endevor SCM+documentation for detailed information%\ \

+\ \ (Hit%ENTER+to continue,%END+to exit) \ \
)PROC
   &ZCONT = CITC1520
)END
