)BODY EXPAND(\\)
%\-\ Rapid Implementation \-\
%Option ===>_ZCMD                                                 %Release 12.0+
+
% Rapid Implementation Facility +

  Rapid Implementation is a series of steps that allow you to perform a
 %standard implementation+of CA Endevor SCM using a%predefined
  environment.+ CA Endevor SCM is a powerful tool with great
  flexibility that encompasses many processes, designs, implementations,
  and abilities. After CA Endevor SCM is installed, you can use
  Rapid Implementation to set up an implementation, with%minimum
  customization,+to get you started using CA Endevor SCM.
  The tasks outlined in the%Rapid Implementation Guide+define a simple,
  but fully scalable software development environment that is complete
  and includes a life cycle and inventory structure.




%\*\+Refer to the%CA Endevor SCM+documentation%\*\
+\ \ for detailed information. \ \

+\ \ (Hit%ENTER+to continue,%END+to exit) \ \
)PROC
   &ZCONT = CITC12E2
)END
