)BODY EXPAND(\\)
%TUTORIAL \-\ Generate - Panel Options \-\ TUTORIAL
%OPTION ===>_ZCMD                                                              +
%
%blank+- Use this option to return an element selection list. This only
     applies if DISPLAY LIST=Y.
+
%G+- Use this option to generate the selected elements.
+
+
+                           (%PF3+to return,%ENTER+for display options)
)PROC
   &ZCONT = CITDOPT0
)END
