)BODY EXPAND(\\)
%TUTORIAL \-\ Retrieve - Panel Options \-\ TUTORIAL
%OPTION ===>_ZCMD                                                              +
%
%blank+- Use this option to return an element selection list. This
     only applies if DISPLAY LIST=Y.
+
%R+- Retrieve the specified element to a user library.

+
+                     (%PF3+to return,%ENTER+for display options)
)PROC
   &ZCONT = CITDOPT0
)END
