)BODY EXPAND(\\)
%TUTORIAL \-\ Dataset Backout Information \-\ TUTORIAL
%SELECTION ===>_ZCMD                                                           +
%
+  This panel displays:
+  - Package ID and package status information
+  - Dataset name and member backout status
+  - Date and time of the backout if a member has been backed out
+  - Date and time of the backin if a member has been backed in after backout
+
+
+  Select from the following options for more information:
%    1+- Package ID fields          %2+- Package status
+
+
+
+
+
+
+
+
+
+
+                               %PF3+to return
)PROC
   &ZSEL = TRANS(&ZCMD 1,CITPKID0 2,CITSTAT0)
)END
