)BODY EXPAND(\\)
%Tutorial \-\ Display Connection \-\ Tutorial
%Selection ===>_ZCMD                                                           +
%
+This panel displays information about a DistribuLink connection
+and can be used to display the connection's data set mapping rules.
+
%     D+- Display data set mapping rules for this connection.
+
+
+
+    Select%1+-%4+for information about specific fields
+
%    1+- Connection ID/Description  %3+- Staging Data Set Info
%    2+- Server LU Name             %4+- Created/Updated Fields

)PROC
   &ZSEL = TRANS(&ZCMD 1,CITCONN0 2,CITSLUN0
                  3,CITSTDS0 4,CITPDBTM)
)END
