)BODY EXPAND(\\)
%TUTORIAL \-\ Summary of Levels Panels \-\ TUTORIAL
%OPTION ===>_ZCMD                                                              +
%
%Heading+includes
+  * Element name.
+  * Environment name and Stage ID where the element resides.
+  * System, subsystem, and type associated with the element.
+  * (Retrieve only) Name of target data set for the Retrieve.
+
%Level information+includes
+  * Version/level (VVLL) number, DATE and TIME when the level was created.
+  * USER ID to which the element is signed out.
+  * Number of statements (STMTS) at each level.
+  * Number of INSERTS and DELETES at each level.
+  * (Display only) Whether or not the level is a SYNC level. SYNC levels
+  *   may be created when element are moved or transferred with history.
+  * (Retrieve only) NEWNAME, where you can specify the name of the
+       member at the target location of the Retrieve.
+  * (Retrieve only) COMMENT, where you can change the comment associated
+       with a level.
+
+                        (%PF3+to return,%ENTER+for more on SYNC levels)
)PROC
   &ZCONT = CITSYNC0
)END
