)ATTR DEFAULT(%+_)
/*-----------------------------------------------------------------------*/
/* Copyright (C) 1986-2013 CA. All Rights Reserved.                      */
/*-----------------------------------------------------------------------*/
 @ TYPE(OUTPUT) INTENS(LOW)
 _ TYPE(INPUT) INTENS(HIGH) PADC(_) CAPS(ON)
 ^ TYPE(INPUT) CAPS(&VARCACCI) FORMAT(&VARFMCCI) PADC(_)
 ` TYPE(INPUT) CAPS(&VARCACOM) FORMAT(&VARFMCOM) PADC(_)
 ~ TYPE(INPUT) CAPS(&VARCADES) FORMAT(&VARFMDES) PADC(_)
)BODY
%------------------------------- Action Prompt ---------------------------------
%Command ===>_VARWKCMD                                                         +
+
+   The system requires either a CCID or a Comment or both to be specified
+  but the request was missing one or both of the fields.  Complete the missing
+  field and hit ENTER to continue.
+
+   To cancel the request, enter the END command.
+
+  Element:@EEVETKEL
+
+  Current Location:
+    Environment:@EEVETKEN+  Stage ID:@Z+
+    System:@EEVETKSY+       Subsystem:@EEVETKSB+  Type:@EEVETKTY+
+
+  CCID Required:@Z+
+  Comment Required:@Z+
+
+  CCID.....^EEVPCCID    +
+  Comment..`EEVPCOMM                                +
)INIT
  .ZVARS = '(EEVETKSI EEVPSCCI EEVPSCOM)'
  .HELP = ENDHE400
)PROC
)END
