)ATTR
  _ TYPE(INPUT) CAPS(OFF) INTENS(HIGH) FORMAT(&MIXED)
  | AREA(DYNAMIC) EXTEND(ON) SCROLL(ON)
  + TYPE(TEXT) INTENS(LOW)
  ! TYPE(OUTPUT) INTENS(HIGH) PAD(-)
 01 TYPE(DATAOUT) INTENS(LOW)
 02 TYPE(DATAOUT) INTENS(HIGH)
 0B TYPE(DATAOUT) INTENS(HIGH) FORMAT(DBCS)
 0C TYPE(DATAOUT) INTENS(HIGH) FORMAT(EBCDIC)
 0D TYPE(DATAOUT) INTENS(HIGH) FORMAT(&MIXED)
 10 TYPE(DATAOUT) INTENS(LOW)  FORMAT(DBCS)
 11 TYPE(DATAOUT) INTENS(LOW)  FORMAT(EBCDIC)
 12 TYPE(DATAOUT) INTENS(LOW)  FORMAT(&MIXED)
)BODY WIDTH(&ZWIDTH) EXPAND(//)
%&EEVBRTIT                                      -/-/-%LINE!ZLINES  %COL!ZCOLUMS%
%Command ===>_ZCMD                             / /            %Scroll ===>_Z   +
|ZDATA ---------------------------------/ /------------------------------------|
|                                       / /                                    |
| --------------------------------------/-/------------------------------------|
)INIT
  .HELP = ISR10000         /* DEFAULT TUTORIAL NAME     */
  .ZVARS = 'ZSCBR'         /* SCROLL AMT VARIABLE NAME  */
  IF (&ZMEMB ^= ' ')
    &ZTITLE = '&ZDSNT(&ZMEMB)&ZLEVEL '       /* OZ91708 */
  IF (&ZMEMB = ' ')
    &ZTITLE = '&ZDSN&ZLEVEL '
  &MIXED = MIX
  IF (&ZPDMIX = N)         /* EBCDIC MODE REQUESTED     */
    &MIXED = EBCDIC

)REINIT
  REFRESH(ZCMD,ZSCBR,ZDATA,ZLINES,ZCOLUMS)
  .ATTRCHAR(+) = 'INTENS(&ZINTEN)'

)PROC
  &ZCURSOR = .CURSOR
  &ZCSROFF = .CSRPOS
  &ZLVLINE = LVLINE(ZDATA)

)END

/*  DYNAMIC AREA SCREEN WIDTH FROM PQUERY. (80,132,160)
/*  DYNAMIC AREA SCREEN DEPTH FROM PQUERY. (24,32,43,27,60)
/*---------------------------------------------------------------------------*/
/* 5665-402 (C) COPYRIGHT IBM CORP 1980, 1989                                */
/* Copyright (C) 1986-2013 CA. All Rights Reserved.                          */
/*---------------------------------------------------------------------------*/
