)ATTR DEFAULT(%+_)
/*-----------------------------------------------------------------------*/
/* Copyright (C) 1986-2013 CA. All Rights Reserved.                      */
/*-----------------------------------------------------------------------*/
 @ TYPE(OUTPUT) INTENS(LOW)
 _ TYPE(INPUT) INTENS(HIGH) PADC(_) CAPS(ON)
 ^ TYPE(INPUT) CAPS(&VARCACCI) FORMAT(&VARFMCCI) PADC(_)
 ` TYPE(INPUT) CAPS(&VARCACOM) FORMAT(&VARFMCOM) PADC(_)
 ~ TYPE(INPUT) CAPS(&VARCADES) FORMAT(&VARFMDES) PADC(_)
)BODY
%------------------------ Element Footprint Corruption -------------------------
%Command ===>_VARWKCMD                                                         +
+
+
+****************************************************************************
+*                     **** FOOTPRINT CORRUPTION ****                       *
+*    The element's@BSDLT+member footprint is missing and may not be        *
+*    modified.                                                             *
+*                                                                          *
+*    To repair the element, either                                         *
+*     - Delete the element                                                 *
+*     - Restore the element from an unload or archive                      *
+*    or                                                                    *
+*    - Retrieve the current version of the element                         *
+*         Note: this latest level may be corrupted and incomplete          *
+*     - Delete the element                                                 *
+*     - Correct the current source and add the element back                *
+*                                                                          *
+*    If you are in browse, press ENTER to browse the current source.       *
+*    Hit END to return to the previous panel.                              *
+*                                                                          *
+*                                                                          *
+****************************************************************************
+
)INIT
)PROC
)END
