)ATTR DEFAULT(%+_)
/*-----------------------------------------------------------------------*/
/* Copyright (C) 1986-2013 CA. All Rights Reserved.                      */
/*-----------------------------------------------------------------------*/
 ¢ TYPE(OUTPUT) INTENS(HIGH) JUST(RIGHT)
 | TYPE(OUTPUT) INTENS(LOW)
 _ TYPE(INPUT) INTENS(HIGH) PADC(_) CAPS(ON)
 @ TYPE(INPUT) INTENS(HIGH) PADC(_) CAPS(OFF)
 ^ TYPE(INPUT) CAPS(&VARCACCI) FORMAT(&VARFMCCI) PADC(_)
 ` TYPE(INPUT) CAPS(&VARCACOM) FORMAT(&VARFMCOM) PADC(_)
 ~ TYPE(INPUT) CAPS(&VARCADES) FORMAT(&VARFMDES) PADC(_)
)BODY EXPAND(\\)
%\-\ Quick Edit Copy Element \-\
%Command ===>_VARWKCMD                                                         +
+
+
+Inventory Location:
+  Environment.._QEPEVNME+
+  System......._QEPSYS  +
+  Subsystem...._QEPSBS  +
+  Element......@QEPELM    +
+  Type........._QEPTYP  +
+  Stage........_Z+
+
+List Options:
+  Apply List Filters.........._Z+(Y/N)
+  Build Using Map............._Z+(Y/N)
+  Return First Found.........._Z+(Y/N)
+  Display System/Subsys List.._Z+(Y/N)
+
+
+
+
+  Press%ENTER+to continue with the COPY function.
+  Press%END+to cancel the COPY function and return to ISPF/PDF Edit.
+
)INIT
  .ZVARS = '(QEPSTG EEVALF EEVSRCHM EEVFFND EEVDLIST)'
  .HELP = ENDHE900
  &VARWKCMD = '  '
)PROC
  &VARWKCMD = 'S '
  &EEVSELCH = TRUNC(&VARWKCMD,2)
)END
