)ATTR
 /*-----------------------------------------------------------------------*/
 /* Copyright (C) 1986-2013 CA. All Rights Reserved.                      */
 /* Panelid: ENIP2700                                                     */
 /*-----------------------------------------------------------------------*/
 # TYPE(OUTPUT)    INTENS(LOW) JUST(ASIS) CAPS(OFF)
 $ TYPE(INPUT)     INTENS(HIGH) JUST(LEFT)
 _ TYPE(INPUT)     INTENS(HIGH) JUST(LEFT) PADC(_)
 ~ TYPE(OUTPUT) CAPS(&VARCADES) FORMAT(&VARFMDES) INTENS(LOW)
)BODY
+-------------------------------%Reset Package+---------------------------------
+ Command ==>$ZCMD                                                             +
+
+  Complete the package information below and select an action:
+   _Z+ 1  Reset Package      2  Cancel the Reset action
+
+
+  Package ID.............#PDVSLPKG        +
+  Description............~PDVSLDSC                                          +
+  Package Status.........#PDVSLSTA    +
+  Promotion Package......#Z+
+  Sharable Package.......#Z+
+  Backout Enabled........#Z+
+  Package Type...........#PDVSLTYP  +
+
+
+       Created by user#Z       +on date#Z      +at time#Z    +
+  Last updated by user#Z       +on date#Z      +at time#Z    +
+
)INIT
  .HELP = enit2700
  .ZVARS = '(VARWKCMD,                                  +
             PDVSLPRO, PDVSLSHR, PDVSLBOE,              +
             PDVSLDUI, PDVSLDDT, PDVSLDTM,              +
             PDVSLLUI, PDVSLLDT, PDVSLLTM)'
)PROC
)END
