)ATTR
 /*-----------------------------------------------------------------------*/
 /* Copyright (C) 1986-2013 CA. All Rights Reserved.                      */
 /* Panelid: ENIP2400                                                     */
 /*-----------------------------------------------------------------------*/
 # TYPE(OUTPUT) INTENS(LOW) JUST(ASIS) CAPS(OFF)
 $ TYPE(INPUT)  INTENS(HIGH) JUST(LEFT)
 _ TYPE(INPUT)  INTENS(HIGH) JUST(LEFT) PADC(_)
)BODY
+--------------------------------%Deny Package+---------------------------------
+ Command ==>$ZCMD                                                             +
+
+  Complete the package information below and select an action:
+   _Z+ 1  Deny package         2  Cancel the Deny action
+       N  Enter Package Notes
+
+  Package ID.............#PDVSLPKG        +
+  Description............#PDVSLDSC                                          +
+  Package Type...........#PDVSLTYP  +
+  Sharable Package.......#Z+
+  Enable Backout.........#Z+
+  Execution window from..#Z      +#Z    +to#Z      +#Z    +
+
+  Created by user#Z       +on date#Z      +at time#Z    +
+  PKG last updated by user#Z       +on date#Z      +at time#Z    +
+  Cast by user#Z       +on date#Z      +at time#Z    +
+
+
+
+
+
+
)INIT
  .HELP = enit2400
  .ZVARS = '(VARWKCMD, PDVSLSHR, PDVSLBOE,              +
             PDVSLWSD, PDVSLWST, PDVSLWED, PDVSLWET,    +
             PDVSLDUI, PDVSLDDT, PDVSLDTM, PDVSLLUI,    +
             PDVSLLDT, PDVSLLTM, PDVSLCUI, PDVSLCDT,    +
             PDVSLCTM)'
)PROC
)END
