)ATTR
 /*-----------------------------------------------------------------------*/
 /* Copyright (C) 1986-2013 CA. All Rights Reserved.                      */
 /* Panelid: ENIP2D00                                                     */
 /*-----------------------------------------------------------------------*/
 # TYPE(OUTPUT) INTENS(LOW) JUST(ASIS) CAPS(OFF)
 $ TYPE(INPUT)  INTENS(HIGH) JUST(LEFT)
 _ TYPE(INPUT)  INTENS(HIGH) JUST(LEFT) PADC(_)
 ~ TYPE(OUTPUT) CAPS(&VARCADES) FORMAT(&VARFMDES) INTENS(LOW)
 @ TYPE(TEXT)   INTENS(&PDVPNINT)
)BODY
+------------------------------%Archive Package+--------------------------------
+ Command ==>$ZCMD                                                             +
+
+  Complete the Archive action information below and select an action:
+  _Z+ 1  Archive package        2  Cancel the Archive action
+     @N  Display package Notes +
+
+  Package ID.............#PDVSLPKG        +
+  Description............~PDVSLDSC                                           +
+
+  Archive to data set name:
+    Project.._PDVARPRO+
+    Group...._PDVARGRP+
+    Type....._PDVARTYP+
+    Member..._PDVARMBR+
+
+  Other partitioned or sequential data set:
+    Data set name.._PDVAROTH                                                 +
+
+  Archive options
+   Delete after Archive.._Z+ (Y/N)
+   Replace Member........_Z+ (Y/N)
+
+
)INIT
  .HELP = enit2D00
  .ZVARS = '(VARWKCMD, PDVARDEL, PDVARREP)'
)PROC
)END
