)PANEL
)ATTR DEFAULT(%+_)
       /* % TYPE(TEXT) INTENS(HIGH)      DEFAULTS DISPLAYED FOR      */
       /* + TYPE(TEXT) INTENS(LOW)       INFORMATION ONLY            */
   _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) PADC(_)
   $ TYPE(INPUT) INTENS(LOW) PAD(_)      /* UNIQUE ATTRIBUTES FOR   */
   ¢ TYPE(OUTPUT) INTENS(HIGH) JUST(RIGHT)
 !  TYPE(OUTPUT) INTENS(HIGH)
)BODY  CMD() LMSG(LMSG) EXPAND(@@)
 @-@ FILTER COMPONENTS ENTRY PANEL @-@
 !LMSG


+INCLUDE ONLY THOSE COMPONENTS WHOSE FOOTPRINTS MATCH THE CRITERIA BELOW:

  +ENVIRONMENT  . . ._WHEENV  +
  +SYSTEM . . . . . ._WHESYS  +
  +SUBSYSTEM  . . . ._WHESUB  +
  +TYPE . . . . . . ._WHETYP  +
  +STAGE NUMBER . . ._Z+


+PRESS PF3 TO EXIT
)INIT
.HELP  = TACMF
.ZVARS = '(WHESTG)'
.CURSOR = 'WHEENV'
VGET (WHEENV,WHESTG,WHESYS,WHESUB,WHETYP) PROFILE
)PROC
  IF  (&WHEENV = ' ')
    &WHEENV = '*'
  IF  (&WHESYS = ' ')
    &WHESYS = '*'
  IF  (&WHESUB = ' ')
    &WHESUB = '*'
  IF  (&WHETYP = ' ')
    &WHETYP = '*'
  IF  (&WHESTG = ' ')
    &WHESTG = '*'
  VER(&WHESTG,NONBLANK,LIST,'1','2','*')
VPUT (WHEENV,WHESTG,WHESYS,WHESUB,WHETYP) PROFILE
)END
