/* Rexx - Parse the column data for non-comment lines */
 Csave = 'YES' /* set save command indication and call parser */
 call ENDCPARS CSAVE
 return result
