/* REXX - QUICK EDIT INTERNAL MACRO FOR ENDIE4MX(COMPELM)
          CALLS COPYELM IN A TEMP FILE
*/
ADDRESS ISREDIT
"MACRO (PARMS)"
COMPELM# = 0 /* SET DEFAULT NUMBER OF LINES */
/* SAY "PARMS:" PARMS */
SETCMDS:
"DEFINE ENDIE4MO MACRO PGM" /* DEFINE COPYELEM MACRO */
CLEARCONTENT:
"(COMPELM#) = LINENUM .ZLAST" /* GET THE NUMBER OF LINES */
IF COMPELM# > 0 THEN
  "DELETE .ZFIRST .ZLAST" /* DELETE ANY LINES */
DONTUSENUMBERS:
"NONUMBER" /* DON'T USE NUMBERS*/
"PRESERVE ON" /* PRESERVE ANY TRAILING SPACES */
/* MAY NEED INSTEAD TO MATCH NUMBER MODE OF SOURCE FILE? */
COMPELMF = 'Y'
ADDRESS ISPEXEC "VPUT (COMPELMF) SHARED"
GETELE:
"ENDIE4MO" PARMS /* CALL COPYELM */
ADDRESS ISPEXEC "VERASE (COMPELMF) SHARED"
/* LOOKS LIKE RC WILL ALWAYS BE ZERO, BUT IF USER CANCELS THERE
   WILL BE A MSG I DON'T WANT TO CHANGE THE MESSAGE, BUT CAN USE
   THE LINECOUNT TO CHECK     */
CHKEMPTY:
"(COMPELM#) = LINENUM .ZLAST" /* GET THE NUMBER OF LINES */
ADDRESS ISPEXEC "VPUT (COMPELM#) SHARED" /* SAVE NO.LINES FOR CALLER */
IF COMPELM# = 0 THEN
   DO
      "CANCEL" /* IF NO DATA, QUIT OUT */
      EXIT 8   /* EXIT WITH CAUTION */
   END
ELSE
   DO
      "SAVE" /* SAVE IT */
      "END" /* AND GET OUT */
   END
