)ATTR DEFAULT(%+_)
       /* % TYPE(TEXT) INTENS(HIGH)      DEFAULTS DISPLAYED FOR      */
       /* + TYPE(TEXT) INTENS(LOW)       INFORMATION ONLY            */
       /* _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT)             */
   @ TYPE(INPUT) INTENS(HIGH) CAPS(OFF) JUST(LEFT)
   $ TYPE(INPUT) INTENS(LOW) PAD(_)      /* UNIQUE ATTRIBUTES FOR   */
   ! TYPE(INPUT) INTENS(LOW) PAD(NULLS)  /* DASHES AND NULL PADDING */
   ¢ TYPE(OUTPUT) INTENS(HIGH) JUST(RIGHT)
   | TYPE(OUTPUT) INTENS(LOW)
 ^ TYPE(INPUT) CAPS(&VARCACCI) FORMAT(&VARFMCCI)
 ` TYPE(INPUT) CAPS(&VARCACOM) FORMAT(&VARFMCOM)
 ~ TYPE(INPUT) CAPS(&VARCADES) FORMAT(&VARFMDES)
 # TYPE(&VARTAUTG) INTENS(&VARIAUTG) CAPS(ON) JUST(LEFT)
)BODY
%------------------------------ GENERATE ELEMENTS ------------------------------
%OPTION  ===>_ZCMD                                                             +
+                              +ELEMENT DISPLAY OPTIONS:
%   blank+- Element list         %S+- Summary  %B+- Browse   %H+- History
%   G+- Generate element         %M+- Master   %C+- Changes
+
+CCID%===>^CTLNBR      +  COMMENT%===>`DESCRPT1                                +
+
+AT LOCATION:                           ACTION OPTIONS:
+  ENVIRONMENT%===>_VAREVNME+             COPYBACK            %===>_Z+(Y/N)
+  SYSTEM     %===>_SYS     +             NOSOURCE            %===>_Z+(Y/N)
+  SUBSYSTEM  %===>_SBS     +             OVERRIDE SIGNOUT    %===>_Z+(Y/N)
+  ELEMENT    %===>_CIELM     +           PROCESSOR GROUP     %===>_VARFPGRP+
+  TYPE       %===>_TYPEN   +             AUTOGEN (BATCH ONLY)%===>#Z+(Y/N)
+  STAGE      %===>_D+ ¢Z+-|CLU1ID  +
+                      ¢Z+-|CLU2ID  +   LIST OPTIONS:
+                                         DISPLAY LIST        %===>_Z+(Y/N)
+                                         APPLY LIST FILTERS  %===>_Z+(Y/N)
+                                         BUILD USING MAP     %===>_Z+(Y/N)
+
+
+
+
+
)INIT
  .ZVARS = '(C1CPBK VARNOSRC C1SISOFR VAROAUTG CLU1I CLU2I VARWKLST   +
             VARWHPNL VARSHMAP)'
  .HELP = CITF3000
  &LIST2 = 'Y N'
  IF (&VARWHPNL = ' ')
    &VARWHPNL = 'N'
)PROC
  VER  (&VARWHPNL,NB,LISTV,&LIST2,MSG=CIFV005)
)END
