)ATTR DEFAULT(%+_)
   /*------------------------------------------------------------*/
   /* % TYPE(TEXT) INTENS(HIGH)      DEFAULTS DISPLAYED FOR      */
   /* + TYPE(TEXT) INTENS(LOW)       INFORMATION ONLY            */
   /*------------------------------------------------------------*/
   $ TYPE(INPUT) INTENS(LOW) PAD(_)
   ¢ TYPE(OUTPUT) INTENS(LOW)
   | TYPE(OUTPUT) INTENS(HIGH)
   < TYPE(TEXT) INTENS(&VNBPKGD9)
   # TYPE(TEXT) INTENS(&VNBPKGC2)
   ^ TYPE(TEXT) INTENS(&VARPKCIT)
   ! TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT)
   \ TYPE(TEXT) INTENS(&VARPKCIO)
   @ TYPE(&VNBPKGC1) INTENS(HIGH)
   ~ TYPE(OUTPUT) CAPS(&VARCADES) FORMAT(&VARFMDES) INTENS(HIGH)
)BODY
%CAST -------------------------- CAST PACKAGE ----------------------------------
%OPTION  ===>_VARWKCMD                                                         +
+
+  %C+- Cast Package                     %S+ - Display SCL
+  %N+- Add Notes to Package             \CI^- Display Correlation Information
+
+PACKAGE ID:|VPHPKGID        +             STATUS: |VPHSTAT     +
+DESCRIPTION: ~VPHCOMM                                           +
+PACKAGE TYPE:|VPHTYPE   +
+SHARABLE PACKAGE:  |Z+
+VALIDATE COMPONENTS  #===>@Z+(Y/W)
+ENABLE BACKOUT       %===>!Z+(Y/N)
<NOTES EXIST FOR PACKAGE+
+EXECUTION WINDOW FROM%===>¢Z      ¢Z    + TO%===>¢Z      ¢Z    +
+
+              USER ID  DATE    TIME
+CREATED:     |VPHCRUID|Z      |Z    +
+LAST UPDATED:|VPHPUUID|Z      |Z    +
+
)INIT
  .HELP = CITP3000
  .ZVARS = '(VPHPSHR  VNBPKGCV  VPHBOFLG            +
             VPHWSD   VPHWST    VPHWED    VPHWET    +
             VPHCRD   VPHCRT    VPHPUD    VPHPUT )'
 &PACKPRE = TRUNC(&VPHPKGID,2)
 IF (&PACKPRE = 'C0')
   .attrchar(!) = 'TYPE(OUTPUT) INTENS(LOW)'
)PROC
 VER (&VNBPKGCV,NB,LIST,Y,W)
)END
