)ATTR DEFAULT(%+_)
? TYPE(OUTPUT) INTENS(HIGH) COLOR(YELLOW)
% TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
+ TYPE(TEXT) INTENS(LOW) COLOR(TURQUOISE)
_ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(GREEN)
)BODY expand(//)
%-/-/- ENDEVOR Security Maintenance -/-/-
+Command%====>_ZCMD
%
+
+Environment :?envname +System :?sysname +User Type :?usertype
+
+
+
+User Id   :!usrname +
+
+
+Press%ENTER+to confirm deletion or%PF3+to cancel
)INIT
.CURSOR = &cursor
)PROC
)END
