)ATTR DEFAULT (%+_)
 ! TYPE(OUTPUT) INTENS(LOW)
 @ TYPE(OUTPUT) INTENS(HIGH)
 _ TYPE(INPUT)  INTENS(HIGH) CAPS(ON) JUST(LEFT)
)BODY WINDOW (65,5)
+
+%&MESSINV
+%&MESSINV2
+
+ Press%ENTER+to continue
)INIT
)PROC
)END
