)ATTR
+ TYPE(TEXT) INTENS(LOW)  SKIP(ON)
% TYPE(TEXT) INTENS(HIGH) SKIP(ON)
^ TYPE(INPUT) INTENS(HIGH)
)BODY EXPAND(\\)
+\-\%Submit CA-Gener/OL Endevor Migration+\-\
%Command ==>_ZCMD
+
+
+
+
+  Infoman Change Record Number      %===>^Z       +    (C0nnnnnn)
+
+
+  Insurance AD Team                 %===>^Z +          (See Help)
+
+
+
+  Press PF3 to exit or PF1 for HELP
)INIT
   .HELP     = EVGENMIH
   .ZVARS    = '(CHGNO ADTEAM)'
)REINIT
   &PMSG = ''
)PROC
   &PFKEY = .PFKEY
   &PMSG = ''
   VER (&CHGNO,NB)
   VER (&CHGNO,PICT,C9999999)
   VER (&ADTEAM,NB)
   VER (&ADTEAM,NB,LIST,HO,MO,TV,PT,HR,CL,AC,WB,LF,FS)
)END
