)ATTR DEFAULT(%+_)
  ! TYPE(OUTPUT) INTENS(HIGH) CAPS(OFF)
  % TYPE(TEXT)   INTENS(HIGH) SKIP(OFF)
  + TYPE(TEXT)   INTENS(LOW)  SKIP(ON)
  ¢ TYPE(OUTPUT) INTENS(LOW)  COLOR(TURQ)
  _ TYPE(INPUT)  INTENS(HIGH) CAPS(ON)

)BODY EXPAND(\\)
%\-\  ADD/UPDATE PRO-IV ENDEVOR ELEMENTS  \-\
%COMMAND ===>_ZCMD                                       \ \%Scroll ===>_amt +
%
%
%         CCID =>_C4CCID      +          STANDARD OR EMERGENCY =>_C4CMRTYP +
%
%      Comment =>_C4COMM                                  +
%
%   Parms File =>_C4PARMS                             +
%
% BOOTS Member =>_C4BOOTS +
%
%   Select a UAT region from the list below:
%
%  CICS Region        Endevor Subsystem    Library
%  ===========        =================    =======
)MODEL ROWS(ALL)
_z¢CICS              ¢SUBSYS              ¢DSN
)INIT
    .ZVARS = '(C4SEL)'
)PROC
)END
