)ATTR
    + TYPE(TEXT)   COLOR(green)           INTENS(LOW) SKIP(ON)
    $ TYPE(INPUT)  INTENS(HIGH) pad(_)
    ! TYPE(TEXT)   COLOR(blue)            INTENS(LOW) SKIP(ON)
    ¢ TYPE(TEXT)   COLOR(white)           INTENS(LOW) SKIP(ON)
    _ TYPE(INPUT)  INTENS(HIGH)
    ¯ TYPE(OUTPUT) COLOR(YELLOW) CAPS(OFF)
    " TYPE(OUTPUT) COLOR(RED)    CAPS(OFF)
    ` TYPE(OUTPUT) COLOR(BLUE)   CAPS(OFF)
    @ TYPE(OUTPUT) COLOR(BLUE)   CAPS(OFF) JUST(RIGHT)
)BODY EXPAND({{)
!-{-{- JOBCARD -{-{-
+OPTION  ===>_ZCMD
+
+ Job statement information:
+
+  ===>_C1BJC1
+  ===>_C1BJC2
+  ===>_C1BJC3
+  ===>_C1BJC4
+
)INIT
  .HELP   = EVXPED1H
  &ZCMD   = ''
  *REXX(C1BJC1,C1BJC2,C1BJC3,C1BJC4,(EVJOBCRD))
)REINIT
)PROC
  &PFK = .PFKEY
  VER (&JNAME,NB)
  *REXX(C1BJC1,C1BJC2,C1BJC3,C1BJC4,(EVJOBCRD))
)END
