)ATTR DEFAULT(%+_)
   _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT)
   $ TYPE(INPUT) INTENS(LOW) CAPS(ON) PAD(_)
   ! TYPE(text) INTENS(LOW) PAD(NULLS) skip(on)
   ¢ TYPE(OUTPUT) INTENS(LOW)
   | TYPE(OUTPUT) INTENS(HIGH)
)BODY
+    ------------- Build DB2 Stored Procedure ------------------------
%
%Please enter details for variable ¢a + of type ¢type
%PF3 to cancel
%
%Size must be a value bwtween 1 and 32704
%
%   ¢ERROR
%
 %Information required for Sysprocedures table insert:
+ ----------------------------------------------------
+ Variable name     ==>$VARNAMES!
+ IN/OUT/INOUT      ==>$INOUT!
+ Size              ==>$NNNNN!

)INIT
  .HELP = NOHELP
  &VARNAMES = &Z
  &INOUT = &Z
  &NNNNN = &Z

)PROC
  &TEST = TRUNC(&VARNAMES,4)
  VER (&TEST,NB,PICT,ACCC)
  VER (&INOUT,NB,LIST,IN,OUT,INOUT)
  VER (&NNNNN,nb,RANGE,1,32704)

)END
