)ATTR DEFAULT(%+_)
   _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT)
   $ TYPE(INPUT) INTENS(LOW) CAPS(ON) PAD(_)
   ! TYPE(text) INTENS(LOW) PAD(NULLS) skip(on)
   ¢ TYPE(OUTPUT) INTENS(LOW)
   | TYPE(OUTPUT) INTENS(HIGH)
)BODY
+    ------------- Build DB2 Stored Procedure ------------------------
%
%Please enter details for variable ¢a + of type ¢type
%Precision must be an integer between 1 and 31
%Scale must between 0 and the value of precision
+   PF3 to cancel
%
%  ¢ERROR
%
 %Information required for Sysprocedures table insert:
+ ----------------------------------------------------
+ Variable name     ==>$VARNAMES!
+ IN/OUT/INOUT      ==>$INOUT!
+ PRECISION         ==>$PP!
+ SCALE             ==>$SS!

)INIT
  .HELP = NOHELP

   &VARNAMES = &Z
   &INOUT = &Z
   &PP = &z
   &SS = &z

)PROC
  &TEST = TRUNC(&VARNAMES,4)
  VER (&TEST,NB,PICT,ACCC)
  VER (&INOUT,NB,LIST,IN,OUT,INOUT)
  VER (&PP,nb,RANGE,1,31)
  VER (&SS,nb,RANGE,0,&PP)

)END
