)ATTR
+ TYPE(TEXT) INTENS(LOW)  SKIP(ON)
% TYPE(TEXT) INTENS(HIGH) SKIP(ON)
^ TYPE(INPUT) INTENS(HIGH)
)BODY EXPAND(\\)
+\-\%Pro IV / Endevor Interface+\-\
%Command ==>_ZCMD
+
+  Pro IV Application%                ===>^Z +  (MM,NL,PL)
+
+  Endevor Subsystem to be updated%   ===>^Z  + (MT1 - 6 )
+
+  Endevor CCID%                      ===>^Z           +
+
+  Change Record Type%                ===>^Z        +
+  (STANDARD or EMERGENCY)
+
+  Item Name%                         ===>^Z       +
+
+  DB2%                               ===>^Z+   (Y,N)
+
+  Item Type%                         ===>^Z  + (FUN,FIL,GMS,GLG,INT)
+
+  Usage%                             ===>^Z+   (B,O,A)
+
+  Comments% ===>^Z                                                   +
+
)INIT
   .ZVARS    = '(PROIVAPP C1SUB C1CCID PKGTYP ITNAME DB2 ITTYPE USAGE +
                 COMMENTS)'
)REINIT
   &PMSG = ''
)PROC
   &PFKEY = .PFKEY
   &PMSG = ''
   VER (&PROIVAPP,NB,LIST,MM,NL,PL)
   VER (&C1SUB,NB,LIST,MT1,MT2,MT3,MT4,MT5,MT6)
   VER (&C1CCID,NB)
   VER (&PKGTYP,NB,LIST,STANDARD,EMERGENCY)
   VER (&ITNAME,NB)
   VER (&DB2,NB,LIST,Y,N)
   VER (&ITTYPE,NB,LIST,FUN,FIL,GMS,GLG,INT)
   VER (&USAGE,NB,LIST,B,O,A)
   VER (&COMMENTS,NB)
)END
