)ATTR
+ TYPE(TEXT) INTENS(LOW)  SKIP(ON)
% TYPE(TEXT) INTENS(HIGH) SKIP(ON)
^ TYPE(INPUT) INTENS(HIGH)
)BODY EXPAND(\\)
+\-\%Pro IV / Endevor Interface+\-\
%Command ==>_ZCMD
+
+
+
+
+  Pro IV Application%                ===>^Z +  (MM,NL,PL)
+
+  Endevor Subsystem                  ===>^Z  + (MT1 - 6 )
+
+  Endevor CCID                       ===>^Z       +
+
+  Change Record Type                 ===>^Z        +
+  (STANDARD or EMERGENCY)
+
+
+
+
+
+
)INIT
   .HELP     = HEDSN01
   .ZVARS    = '(PROIVAPP C1SUB C1CCID PKGTYP)'
)REINIT
   &PMSG = ''
)PROC
   &PFKEY = .PFKEY
   &PMSG = ''
   VER (&PROIVAPP,NB,LIST,MM,NL,PL)
   VER (&C1SUB,NB,LIST,MT1,MT2,MT3,MT4,MT5,MT6)
   VER (&C1CCID,NB,PICT,ANNNNNNN)
   VER (&PKGTYP,NB,LIST,STANDARD,EMERGENCY)
)END
