%-----------------------  Walker Type Selection Menu ------------------ --------
%OPTION  ===>_ZCMD                                                             +
%
%
%    1  +DOC      - Help TEXT
%    2  +DOP      - Dialogue Object Processor
%    3  +ERR      - Error Message
%    4  +FID      - File Definition & Data Dictionary Definitions
%    5  +GMT      - Maintainer Transaction Definition
%    6  +IFE      - Integrator Event
%    7  +IFI      - Integrator Move Set
%    8  +NAM      - TGS Name
%    9  +PSU      - Walker Production Software Update
%   10  +RPT      - Report Builder Report Program
%   11  +SCR      - Screenbuilder Screen Definition
%   12  +TGS      - Transaction Generator Program
%   13  +TID      - Transaction Definition
%   14  +VAL      - Value Definition
%   15  +VMS      - Validation Set
%
%
%
%
%
+Enter%END+command to return to PRIMARY OPTIONS PANEL
)INIT
  .HELP = TUTORPAN              /* insert name of tutorial panel    */
)PROC
  &ZSEL = TRANS( TRUNC (&ZCMD,'.')
                1,'CMD(%WALKIDOC)'
                2,'CMD(%WALKIDOP)'
                3,'CMD(%WALKIERR)'
                4,'CMD(%WALKIFID)'
                5,'CMD(%WALKIGMT)'
                6,'CMD(%WALKIIFE)'
                7,'CMD(%WALKIIFI)'
                8,'CMD(%WALKINAM)'
                9,'CMD(%WALKIPSU)'
                10,'CMD(%WALKIRPT)'
                11,'CMD(%WALKISCR)'
                12,'CMD(%WALKITGS)'
                13,'CMD(%WALKITID)'
                14,'CMD(%WALKIVAL)'
                15,'CMD(%WALKIVMS)'
                *,'?' )
  &ZTRAIL = .TRAIL
)END
