%-----------------------  Walker Type Selection Menu ------------------ --------
%OPTION  ===>_ZCMD                                                             +
%
%
%    1  +DOC      - Help TEXT
%    2  +DOP      - Dialogue Object Processor
%    3  +ERR      - Error Message
%    4  +FID      - File Definition & Data Dictionary Definitions
%    5  +GMT      - Maintainer Transaction Definition
%    6  +IFE      - Integrator Event
%    7  +IFI      - Integrator Move Set
%    8  +NAM      - TGS Name
%    9  +PSU      - Walker Production Software Update
%   10  +RPT      - Report Builder Report Program
%   11  +SCR      - Screenbuilder Screen Definition
%   12  +TGS      - Transaction Generator Program
%   13  +TID      - Transaction Definition
%   14  +VAL      - Value Definition
%   15  +VMS      - Validation Set
%
%
%
%
%
+Enter%END+command to return to PRIMARY OPTIONS PANEL
)INIT
  .HELP = TUTORPAN              /* insert name of tutorial panel    */
)PROC
  &ZSEL = TRANS( TRUNC (&ZCMD,'.')
                1,'CMD(%WALKDDOC)'
                2,'CMD(%WALKDDOP)'
                3,'CMD(%WALKDERR)'
                4,'CMD(%WALKDFID)'
                5,'CMD(%WALKDGMT)'
                6,'CMD(%WALKDIFE)'
                7,'CMD(%WALKDIFI)'
                8,'CMD(%WALKDNAM)'
                9,'CMD(%WALKDPSU)'
                10,'CMD(%WALKDRPT)'
                11,'CMD(%WALKDSCR)'
                12,'CMD(%WALKDTGS)'
                13,'CMD(%WALKDTID)'
                14,'CMD(%WALKDVAL)'
                15,'CMD(%WALKDVMS)'
                *,'?' )
  &ZTRAIL = .TRAIL
)END
