)ATTR DEFAULT(%+_)
  @   TYPE(OUTPUT) INTENS(LOW)
  ^   TYPE(OUTPUT) INTENS(HIGH)
  %   TYPE(TEXT) INTENS(HIGH)
  +   TYPE(TEXT) INTENS(LOW) SKIP(ON)
  _   TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT)
  !   TYPE(INPUT)  INTENS(HIGH) CAPS(ON)  JUST(LEFT)
      PAD(_)
)BODY EXPAND(\\)
+\-\%I found that element+\-\
%COMMAND ===>_ZCMD            \ \          %SCROLL = =>_AMT +
%
+\ \Use PF8 to scroll Forward / PF7 to scroll Backward\ \
+\ \Use PF3 to return to find another element\ \
+
+ Element     Type   System Subsys  Env  Stg   ProcGrp      CCID
+
+
)MODEL
 @ele      @typ       @sys  @sub   @env  @stg @pro      @cci
)INIT
&zcmd = &z
)REINIT
 if (.msg = ' ')
    refresh(y)
)PROC
)END
