)ATTR
 ! TYPE(OUTPUT) INTENS(HIGH) CAPS(OFF)
 ^ TYPE(TEXT) INTENS(HIGH) CAPS(OFF) COLOR(YELLOW) HILITE(REVERSE)
 % TYPE(TEXT)   INTENS(HIGH) SKIP(OFF)
 + TYPE(TEXT)   INTENS(LOW)  SKIP(ON)
 ¢ TYPE(TEXT)   INTENS(LOW) COLOR(TURQ)
 _ TYPE(INPUT)  INTENS(HIGH) CAPS(ON)
)BODY EXPAND (\\)
%\-\ WIZARD \-\
%COMMAND ==>_ZCMD
+
+
+
+Change Management Record  ===>_Z       +
+Endevor System            ===>_Z +(OS/OJ/OD)
+                 +
+
)INIT
 .help = WIZ1000H
 .ZVARS = '(CHANGE C1SYSTEM)'
)REINIT
  REFRESH(*)
)PROC
 VER (&CHANGE,NB)
 VER (&CHANGE,PICT,C9999999)
 &C = TRUNC (&CHANGE,1)
 VER (&C,LIST,'C')
 VER (&C1SYSTEM,NB,LIST,'OS','OD','OJ','EK')
)END
