)ATTR
 ! TYPE(OUTPUT) INTENS(HIGH) CAPS(OFF)
 % TYPE(TEXT)   INTENS(HIGH) SKIP(OFF)
 + TYPE(TEXT)   INTENS(LOW)  SKIP(ON)
 ¢ TYPE(TEXT)   INTENS(LOW) COLOR(TURQ)
 _ TYPE(INPUT)  INTENS(HIGH) CAPS(ON)
)BODY EXPAND (\\)
%\-\  &zsysid  EXPORT XPEDITER LISTING TO PROD PLEX \-\
%COMMAND ==>_ZCMD                                            + Date - &ZDATE
+                     +
+
+  PPLEX TARGET   %===>_PLEXTG+                  PLEXP1 or PLEXN1 or PLEXR1
+  FROM DDIO      %===>_PDDIOFIL                +E.G. PGSP.X#11.DDIOCICS
+  TO DDIO        %===>_PDDIOFI2                       +
+  PROGRAM        %===>_PDDIOMEM+                Listing Member
+
+  EXPORT DSN     %===>_exportds                       +

)INIT
 .help = xpph
 VGET(PLEXTG PDDIOFIL PDDIOFI2 PDDIOMEM) PROFILE
)REINIT
  REFRESH(*)
)PROC
 VER  (&PLEXTG,NB,LIST,PLEXP1,PLEXN1,PLEXR1)
 VER  (&PDDIOFIL,NB,DSNAME)
 VER  (&PDDIOFI2,NB,DSNAME)
 VER  (&PDDIOMEM,NB,NAME)
 VER  (&EXPORTDS,NB,DSNAME)
 VPUT(PLEXTG PDDIOFIL PDDIOFI2 PDDIOMEM) PROFILE
)END
