)ATTR DEFAULT(%+_)
)BODY EXPAND(\\)
%\-\  EXPORT XPEDITER LISTING TO PRODUCTION PLEX  \-\
+
  This panel builds and submits a job on the Qplex to do the following:

 %a)+EXPORT XPEDITER LISTING from Xpediter DDIO file on Qplex
 %b)+Submit Connect Direct Process to send exported listing to runtime plex
 %c)+Submit a second job on the runtime plex to import the listing.

  The first  jobname your TSO prefix followed by XP2P
  The second jobname is your TSO prefix followed by XP3P

)END
